{"id": "9d9ba18ee96fcf5f", "title": "Full Stack Developer (Python / ReactJS)", "company": "PV Generation Ltd", "location": "Glanmire, County Cork", "description": "About Us:\n\nPV Generation have been installing Solar PV systems across Ireland since 2015. Due to continued expansion, success & market growth we are seeking a Full Stack Developer (Python/ReactJS).\n\nIf you would like to join a business who are committed to helping Ireland prevent the depletion of natural resources for generations to come, then this could be your next career opportunity.\n\nHere at PV Generation, we have a people first policy which extends not only to our customers but also to our team. We pride ourselves on having a friendly and supportive work culture, with an open-door policy.\n\nAbout the Role\n\nWe’re looking for a skilled Full Stack Developer with strong experience in backend and frontend technologies to design, build, and scale modern web applications. The ideal candidate is proficient in Python, ReactJS, and cloud technologies, with a solid understanding of API integration and authentication systems.\n\nKey Responsibilities\n\n· Develop and maintain scalable web applications using Python and ReactJS.\n\n· Design, implement, and manage RESTful APIs for seamless data exchange.\n\n· Integrate secure authentication and authorization workflows using OAuth 2.0.\n\n· Deploy, monitor, and optimize applications in a cloud environment\n\n· Collaborate with cross-functional teams to design and deliver user-centric solutions.\n\n· Write clean, maintainable, and testable code following best development practices.\n\nRequired Skills and Qualifications\n\n· Proven experience with Python (Flask, Django, or FastAPI).\n\n· Hands-on experience with ReactJS for dynamic front-end development.\n\n· Deep understanding of REST API design principles.\n\n· Familiarity with OAuth 2.0 and secure API authentication standards.\n\n· Experience working with cloud platforms such as AWS, Google Cloud Platform, or Azure.\n\n· Strong problem-solving skills and ability to work in an agile, collaborative environment.\n\nNice-to-Have\n\n· Experience with CI/CD pipelines and DevOps tools.\n\n· Knowledge of Docker or Kubernetes.\n\n· Understanding of database systems (SQL/NoSQL).\n\nBenefits:\n\nPension Scheme\n\nCompany events\n\nFriendly team culture\n\nEmployee Assistance Programme-EAP\n\nOngoing training, guidance and monitoring\n\nGenerous salary\n\nStaff referral\n\nStaff uniforms\n\nHuge staff discount\n\nJob Type: Full-time\n\nWork Location: In person"}
{"id": "8174e5af20cbf45c", "title": "E-commerce Web Developer", "company": "Allied Imports LTD (Tipperary Crystal)", "location": "Dublin, County Dublin", "description": "Location: Dublin, Ireland | Salary: €35,000* | Full-Time | Monday – Friday, 8:00 am – 4:00 pm\n\nWe’re expanding our e-commerce team and work with an exciting range of products, including fragrances, soft toys, homeware, jewellery, and more. If you enjoy coding, building features, analysing data, and being hands-on across multiple areas of the business, this role could be perfect for you!\n\nThe E-commerce Web Developer will work on our websites, ensuring they’re technically robust, user-friendly, and optimised for sales. You will also use data analytics to drive performance improvements and support creative marketing initiatives across our brands: Tipperary Crystal, Regency Fragrances, and Gosh! Soft Toys.\n\nYou will collaborate closely with the E-commerce Manager, SEO Specialist, Paid Ads Manager, and Stock Management Team to support campaigns, social media, email marketing, and website management.\n\nKey Responsibilities\n\n1. Website & Web Development (BigCommerce)\n\nMaintain, and enhance our BigCommerce websites using coding skills (HTML, CSS, JavaScript, and relevant frameworks).\nImplement technical fixes, troubleshoot issues, and enhance website functionality.\nCustomise themes, configure plugins, and develop new features to improve UX and drive online sales.\nAssist with product listings: images, descriptions, pricing, and categorisation.\nMonitor website performance, page speed, and mobile responsiveness, implementing improvements as needed.\n\n2. E-commerce & Marketplace Management\n\nManage Amazon Seller Central accounts.\nOptimise product listings with high-quality content, images, and keywords using Amazon SEO techniques.\nHandle customer service, reviews, and daily operations on Amazon.\nUse data analytics to identify trends, track KPIs, and optimise sales performance.\n\n3. Creative Support & Content\n\nAssist with creating banners, visuals, and website content updates. Creative work on Canva and Adobe.\nWrite compelling product descriptions, marketing copy, and email campaigns.\nEnsure all creative content aligns with website updates and product launches.\n\n4. Collaboration & Analytics\n\nWork closely with the E-commerce Manager and other teams to support marketing and e-commerce initiatives.\nUse analytics tools (Google Analytics, BigCommerce reports, or similar) to monitor traffic, conversions, and customer behaviour.\nRecommend data-driven improvements for campaigns, promotions, and website features.\n\nBackground / Experience\n\n1–3 years’ experience in e-commerce, digital marketing, or web development.\nStrong technical skills: HTML, CSS, JavaScript, and experience customising BigCommerce or other e-commerce platforms.\nExperience managing online marketplaces, especially Amazon, is an advantage.\nComfortable with data analytics, KPI reporting, and conversion optimisation.\nExposure to creative work, copywriting, or CRM campaigns.\n\nAddress - Allied House, Unit 804, Northwest Business Park, Phase 3. Ballycoolin. Dublin 15\n\nJob Type: Full-time\n\nPay: €35,000.00 per year\n\nBenefits:\n\nCompany events\nEmployee discount\nOn-site parking\n\nEducation:\n\nBachelor's (required)\n\nExperience:\n\nE-commerce: 1 year (required)\n\nWork Location: In person"}
{"id": "ccbceb25d1505557", "title": "Erasmus Web Developer", "company": "Stay Planet", "location": "Dublin, County Dublin", "description": "Company Description\n\n\nStayPlanet is vacation rental booking engine which offers real time booking for homestay, farmstay, village stay, camping, apartments, hotels, hostels, and B&Bs. Our headquarters is based in Dublin, Ireland.\n\n\nJob Description\n\n\nThe Job:\n\nWe are currently seeking to recruit hard working, self-motivated PHP developer who has experience in hotel booking engine development and API integrations to work as web developer in our Dublin headquarters.\n\nThis position would be perfect for Erasmus students looking to develop their web skills in a professional environment.\n\nThe candidate must share passion for technology, innovation with deep technical expertise and extensive hands-on development experience.\n\nDuties & Responsibilities\n\nDesign, implement and maintain Web and mobile applications with an emphasis on PHP and Web-based application development.\nPHP – most of the server-side code is written in PHP and implemented in the Codeigniter framework, with other stand-alone PHP code such as web services and XML integrations.\nAngular – Angular is the front-end language of choice. Our apps still leverage basic Javascript or jQuery. The developer will write and transition most code in Angular.\nHTML – view code for web applications includes HTML code.\nCSS – view code for web applications includes CSS code.\nMySQL – the data from multiple applications are stored in MySQL databases. New and existing features will require an expertise in how to create/update/optimize both the MySQL schema and build out the model code and queries in PHP.\nGit – ability to manage and maintain source code in Git or other version control systems.\nLinux – the web servers are primarily Linux Servers, so you will often find yourself in a Linux Shell checking on the web services.\nApache – running on the Linux Servers is usually Apache. You may need to make changes to Apache configuration or spin up a new server running Apache.\nProvide support to enhance or debug application behaviour and performance-related problems.\n\nQualifications\n\n\nExperience:\nExperience in full stack web development;\nStrong knowledge of PHP MVC web frameworks (CodeIgnitor, Laravel, Slim) and Javascript MVC frameworks (Angular)\nExperience in architectural work involving performance optimization, MySQL query optimization, application caching strategies, or related work\n\nAPI development REST, SOAP, XML, JSON, Web Sockets, WebRTC, Graph QL\nGood working knowledge of html, Javascript and CSS\nExperience working with Git;\nExperience working with cloud infrastructure: AWS, RackSpace Cloud, DigitalOcean, etc.;\n\nNice to Have:\n\nSales Force integration experience\niOS and Android Development\nExperience in additional languages (C#, ASP.NET, Java)\nDevOps experience: experience automating deployments, testing, server configurations, etc.\nLinux System Administration\n\nQualifications:\n\nBachelor’s degree Computer Science or equivalent work experience\n\n\nAdditional Information\n\n\nWhat we offer\n\nThe opportunity to develop valuable marketing and communications skills.\nA personal development plan and regular support to help you in your role.\nReferences will be supplied on successful completion of your period."}
{"id": "17f660f5f3167d44", "title": "Frontend Developer", "company": "Kitman Labs", "location": "Dublin, County Dublin", "description": "Company Description\n\n\nWe’re building the software that enables world class sports teams to perform at the peak of their abilities. Our clients are elite professional and international squads in sports like rugby, soccer, American football, baseball and basketball.\n\n\nJob Description\n\n\nWe're looking for people to join our growing Product Engineering group. This team is responsible for creating and maintaining all of the tools that our customers use to get the best from their athletes.\n\n\nUltimately we want you to decide what you do, but for an idea of what your day to day work will be like, we imagine you'll do things like:\n\nBuild interfaces that make it incredibly easy to get information into our system. We collect data from a wide range of sources, so it has to be frictionless for our customers.\nDesign and build tools that help people make sense of the data they've collected and allow them to gain quick insights to power their decision making\nObsess over the quality of the products that you build. We care deeply about providing an amazing user experience and achieve that through a mix of automation, constantly shipping new code, and iterating in short loops\nEnsure the scalability and availability of our systems by writing robust and well tested code\nGrow your career. We want our team to grow with the company, so we bias heavily to internal promotions for leadership roles, whether you're interested in managing teams or being a technical leader\n\nQualifications\n\n\nWhat kind of things are we looking for?\n\nYour initial focus after joining the team will be on our web based products which are Rails applications with a mix of React and ERB views. To that end, you should have:\n\nAt least three years experience implementing data focused, testable and robust user interfaces using a highlevel Javascript application framework such as React or Ember\nExperience working with feature driven teams of designers, product managers and engineers\nExperience creating high quality and device independent user interfaces\n\nAdditional Information\n\n\nBENEFITS\n\nCompetitive salary\nMeaningful equity so that we all share in our successes\nComprehensive health insurance so you don't have to worry about the unexpected\nGym membership to help you keep active\nMacbook Pros are our standard issue laptop, but if you work better with different hardware, we can figure that out\nTaxsaver tickets and a cycle-to-work scheme to help you get around\nA kitchen fully stocked with snacks and drinks to keep fuelled\nA great location, close to the DART, Luas, plenty of bus routes, secure onsite bike parking, and showers in the office"}
{"id": "75a12b93721da004", "title": "Fullstack Engineer (Web Frontend)", "company": "Entity Games", "location": "Dublin, County Dublin•Remote", "description": "Summary\n\nAbout Entity\n\nEntity is on a mission to bring console-quality games to players everywhere — instantly, on any device. Just as software, music and film moved from download and own to click and stream, we believe gaming is shifting from Download and Install to Click and Play Now.\n\nPowered by the latest web technologies and built on the open web, Entity is creating a new home for next-gen instant games. For players, a destination to discover and enjoy incredible new titles (think Steam or YouTube for games). For developers, the tools, publishing power, and access to a truly global audience across every connected device.\n\nFounded by industry veterans and entrepreneurs, and backed by leading investors, we’re assembling our core team. Joining Entity at this stage is a rare opportunity to help shape the future of gaming.\n\n\nAbout the role\n\nWe’re now seeking a Web Engineer with full stack experience to shape the future of our web-based games platform. This role will be central to implementing slick, intuitive, cutting-edge and highly polished user experiences and designs that not only showcases games but also delivers engaging community and social features. The goal is to design an immersive “Games HUB” where players want to spend time, engage deeply, share their experiences and invite their friends to play with them.\n\n\nKey Responsibilities:\n\nBuild engaging, performant, and scalable user interfaces for a platform supporting web-based games.\nVerify and improve frontend performance across devices and browsers, ensuring compatibility and accessibility.\nChoose the right frameworks, tools and out-of-the-box solutions to balance short term objectives with long term sustainability.\nImplement frontend features using modern web frameworks (e.g., Vue.js, Angular, HTMX, Svelte) with TypeScript/JavaScript.\nIntegrate WebGL components and rendering pipelines to support game visuals and interactive experiences.\nWork with real-time systems using WebSockets for low-latency communication between players, services, and tools.\nCollaborate with backend engineers to define and consume APIs that power gameplay and LiveOps features.\nEnsure fast, smooth performance by optimizing UI rendering, asset loading, and content delivery through CDNs.\nWork closely with designers, QA, and product stakeholders to deliver polished, reliable, and testable code.\nStay up-to-date with emerging frontend technologies, real-time networking advances, and best practices for game-related web applications.\n\n\n\nRequirements:\n\n5+ years of experience as part of a professional development team, delivering modern web applications.\nStrong expertise in JavaScript (ES6+), TypeScript, HTML5, and CSS (with preprocessors like SCSS).\nFamiliarity with concepts leading to developing consistent interfaces across different platforms, device types and browsers.\nHands-on experience with Vue.js, Angular, HTMX, Svelte, or similar frameworks (not React).\nSolid understanding of frontend performance optimization (asset bundling, caching strategies, rendering tweaks, local storage).\nExperience with asset delivery optimization via CDNs and caching strategies for high-traffic environments.\nKnowledge of real-time communication with WebSockets and event-driven architectures.\nExperience integrating with RESTful APIs and contributing to API design discussions.\nAwareness of cloud deployment practices (AWS), CDNs, and how frontend interacts with large-scale systems.\nCompetence with version control (Git), CI/CD pipelines, and automated frontend testing.\n\n\n\nBonus points:\n\nExposure to game-related web development, such as multiplayer lobbies, leaderboards, or LiveOps dashboards.\nFamiliarity with WebGL basics and integrating 2D/3D rendering into web apps.\nFamiliarity with AWS services like CloudFront and S3.\nUnderstanding of basic security concerns for web games (preventing exploits, protecting APIs).\nKnowledge of performance monitoring tools (Lighthouse, browser dev tools, Datadog, Kibana).\n\n\n\nRemote Working Conditions:\n\nThis is a remote-first position, allowing employees to work from anywhere with a reliable internet connection, a suitable home-working setup and within +/- 3 hours GMT timezone. We place a strong emphasis on individual responsibility to manage time and work, enabling employees to accommodate their personal life requirements.\n\nOccasional travel may be required for team meetings, industry events, or visits to game development studios. Some flexibility in working hours may be necessary to accommodate meetings with international partners or developers in different time zones."}
{"id": "849feb9ee4fbafb3", "title": "Front End Developer with React", "company": "8 West Consulting", "location": "Cork, County Cork•Remote", "description": "Overview:\n\n8 West Consulting is one of the country’s largest software development organisations. Formerly named DeCare Systems Ireland, the company has been operating successfully in Cork city since 1998. 8 West Consulting employ a wide range of technologies including Mobile (iOS, Android), Java/Kotlin (Springboot, Akka, JPA, etc.), Microsoft .NET (ASP.NET, C#, etc.), JavaScript (React, Vue, AngularJS, JQuery, Node.js, etc.), various database management systems (MongoDB, Oracle, SQL Server, MySql, etc.) and multiple Cloud Providers (AWS, Azure, GCP). 8 West Consulting provides consultancy and leading-edge software solutions for a wide variety of US, EU and UK based clients in the insurance, healthcare, retail and public sector markets.\n\nFor more on 8 West Consulting visit our website on www.8west.ie\n\n\nWe are seeking an experienced Front End Developer to join our Team. The role is remote and will report to either our satellite office in Cagliari, Italy, or our head office in Cork, Ireland. As a company, we support all levels of remote working, where appropriate. The developer will report to the Software Project Manager and occasionally to appropriate Development Directors. The successful candidate would be responsible for building the frontend components to a variety enterprise applications.\n\n\nResponsibilities:\n\nDesigning & building applications using client-side technologies including React.js\nStrong proficiency in JavaScript, including DOM manipulation and the JavaScript object model\nProvide technical leadership to colleagues about best practices/patterns working with React\nExperience integrating front ends with back end REST APIs\nBuild high-level user interfaces using rapid prototyping methodologies\nGetting feedback from users and clients, and building solutions for them\nAssisting with the analysis of client requirements\nResearch into new frontend technologies and reporting on suitability and benefits to the organisation\nBuild user interfaces with accessibility (a11y)\n\nTechnical Profile:\n\nMust have 4+ cumulative years of Front End experience in an enterprise environment\nDeep understanding of JavaScript, and React ecosystems\nDeep understanding of modern testing methodologies, tools and practices\nUnderstanding of security and performance considerations\nUnderstanding of cross browser issues and how to debug them\nUnderstanding of JSON / RESTful web services\nUnderstanding of architectural and design patterns\n\nOptional Skills:\n\nRange of experience across various other frontend technologies, including Node.js, AngularJS and Typescript\nExperience and working knowledge of relational and non-relational data stores advantageous\nExperience working with cloud technologies advantageous, especially AWS and Azure\n\nPersonal Profile:\n\nAbility to work independently as well as part of team\nAbility to learn new business areas quickly\nExcellent written and verbal English communication skills\nAbility to engage with stakeholders, and help them prototype their requirements\nTechnical degree or equivalent experience\nDesire to develop your own knowledge by keeping abreast of testing tools and techniques, attending workshops and reviewing technical publications\nCandidates who apply must be eligible to work in Ireland and Italy holding either EU Citizenship or appropriate visa"}
{"id": "1f8d3ca8ab827223", "title": "Senior Agile Web Developer", "company": "Adroitpeople", "location": "Carlow, County Carlow", "description": "Job Description\n\n\nWe are looking for a full-stack Agile Web developer with experience leading small development teams in a Scrum / Kanban environment, using a continuous integration and continuous delivery (CI/CD) pipeline.\n\nWhat do you need to bring to the table?\n\nSolid Microsoft (ASP.NET, C#, SQL Server) experience\nStrong knowledge of API development\nPlenty of demonstrable experience building interactive experiences using JavaScript, CSS3, HTML5, or similar\nA guru in the use of JavaScript frameworks and libraries (jQuery, Angular, bootstrap)\nUnderstanding of UX / UI principles, responsive design, think mobile first\nSource control – we use GitHub, but we’re OK if that’s not what you’re used to\nAgile methodology experience (Scrum, Kanban, XP etc.)\n\n\nThis role will be accountable for:\n\nDesign the architecture of the components of an application\nDeveloping and delivering business applications, API’s, platforms, portals and mobile applications\nWriting code in one or more programming or scripting languages, JavaScript, CSS3, HTML5, or similar\nSupport of .NET/C#, SQL Server development\nUtilizing JavaScript frameworks and libraries (jQuery, Angular, bootstrap)\nMaintaining deployment schedules\nFollowing good development guidelines and maintaining proper Source control policies\nLearning and testing new technologies, frameworks and languages\nStaying up to date with new trends and advancements in web development\n\nQualifications\n\n\nGraduate"}
{"id": "9eeb621edbc302fe", "title": "Senior Full Stack Developer", "company": "SOULCHI", "location": "Remote", "description": "Position: Full Stack Developer\nLocation: Remote\nCategory: Full-time (40 hours)\nCompensation: Fair Market Value, Equity-Based Compensation Model Until Break-Even\n\nWelcome to the forefront of transformational change. At SOULCHI, we are driven by a vision that blends virtues-based leadership, conscious growth, and a commitment to the United Nations Sustainable Development Goals. As an equity-based startup team member, you're not just joining a team; you're embarking on a journey to shape a more harmonious and sustainable world. We believe that true progress stems from the fusion of innovation and values, and that's exactly what you'll find here – a dynamic environment where your talents will thrive, your ideas will flourish, and your impact will resonate far beyond. Join us in rewriting the narrative of leadership and making a lasting difference that echoes through generatio\n\nPosition: Senior Full Stack Developer\n\nRole Overview: Craft exceptional user experiences by building and connecting Flutter interfaces to AI-driven backend systems using Firebase and GCP. Drive innovation in a fast-paced, collaborative environment focused on wellness and accessibility.\n\nCore Responsibilities\n\nFull-Stack Development:\nBuild cross-platform apps with Flutter (Dart) for iOS, Android, and Web.\nDesign, develop, and maintain scalable backend APIs (REST/GraphQL) and cloud services.\nIntegrate Firebase (Auth, Firestore, Cloud Functions, FCM) and GCP (Cloud Run, Vertex AI) for real-time features.\nSystem Integration & Optimization:\nConnect third-party APIs, AI/ML services (e.g., Vertex AI), and multimedia data flows.\nOptimize app performance for low-bandwidth users and ensure seamless UX across devices.\nImplement Firebase Security Rules and manage real-time databases.\nCollaboration & Quality:\nPartner with designers to transform UX/UI mockups into functional, polished experiences.\nWrite clean, documented code following best practices; troubleshoot and debug issues.\nLead deployments to App Store and Google Play.\nQualifications / Technical Requirements:\n5+ years full-stack development, including 2+ years with Flutter and state management (Riverpod/Bloc).\nExpertise in Firebase (Firestore, Cloud Functions, Security Rules) and GCP services.\nBackend proficiency in Node.js/Python and API design (REST/GraphQL).\nExperience integrating AI/ML APIs (e.g., Vertex AI) and optimizing apps for diverse network conditions.\nStrong mobile UI/UX principles and cross-platform deployment (iOS/Android/Web).\nFluency in Git/GitLab and agile workflows.\n\n\nEquity-Based Compensation Opportunity:\n\nAs part of the SOULCHI team, you'll take part in our equity-based compensation model, aligning your success with the success of our business. After much research we have found the fairest equity model for a startup. We use the Slicing Pie model. First phase is equity-based only, which we are currently in. Equity calculations move dynamically based on your fair market rate and actual number of hours worked. In the second phase, which happens at the break-even point, the equity freezes at each member's current earned percentage and compensation switches to salary + benefits. Your equity percentage gets paid out annually as part of the profit sharing. This is more than a job; it's an opportunity to own a piece of the future.\n\nWe request you only apply for this position if you believe an equity-based model is the perfect fit for you. A more detailed explanation from the professor who created the model can be found on Youtube, 'Pie Slicer Equity Split Software' by Slicing Pie.\n\nWe understand the importance of work-life balance and recognize that each individual has unique scheduling needs. As such, we offer flexibility in working hours for the Full-Stack Developer role, with the opportunity to work anywhere between 15 to 40 hours per week, depending on the candidate's availability and suitability for the role.\n\nThank you for considering SOULCHI.\n\nHow to Apply: To apply, please submit your resume and a cover letter detailing your alignment with our mission and the value you can bring to our team. Join our passionate team and be part of a transformative journey to spread virtues, create social impact, and contribute to a more loving and peaceful world. Together, we can harness the power of technology to bring the truth of oneness to the center of societies worldwide."}
{"id": "d47a7abe6d095f08", "title": "Java Full Stack Developer", "company": "Version 1", "location": "Dublin, County Dublin", "description": "Company Description\n\n\nVersion 1 has celebrated over 28 years in Technology Services and continues to be trusted by global brands to deliver solutions that drive customer success. Our expertise enables our customers to navigate the rapidly changing Digital-First world we live in. We foster strong partnerships with leading technology giants including Microsoft, AWS, Oracle, Red Hat, OutSystems, Snowflake, ensuring that our customers are provided with the highest quality solutions and services.\n\nWe’re an award-winning employer reflecting how our employees are at the very heart of Version 1 and what we do:\n\nUK & Ireland's premier AWS, Microsoft & Oracle partner\n3300+ strong, €350/£300m revenue business\n10+ years as a Great Place to Work in Ireland & UK\nBest Workplace for Women in the UK & Ireland by GPTW\nBest Workplace for Wellbeing in the UK by GPTW\n\nJob Description\n\n\nJava has been a key technology throughout our company history, and our Java Practice has delivered some of the largest enterprise-to-enterprise systems and business-critical solutions across a wide range of sectors. We work with diverse platforms, operating systems, open-source components, and databases.\n\nWe are now looking for enthusiastic Full Stack Developers who are eager to grow their careers in a high-energy environment with exposure to modern technologies across both backend and frontend stacks.\n\nKey Responsibilities:\n\nParticipate in the design and build phases of the project lifecycle.\nDevelop new features and enhancements using Java and Angular as per technical specifications.\nEnsure adherence to code quality standards and unit testing practices.\nImplement and automate integration tests where appropriate.\nConduct peer code reviews and contribute to continuous improvement.\nProvide support during system testing and resolve defects (SIR resolution).\n\nQualifications\n\nMinimum 5 years of experience in Java development.\nExperience with frontend development using Angular and JavaScript.\n\nPreferred Skills:\n\nJava 8+\nSpring / Spring Boot\nAngular (v8+ preferred)\nJavaScript / TypeScript\nRESTful Web Services / Microservices\nJUnit and Integration Testing\nExperience in standards-driven development environments\n\nDesirable Skills:\n\nHibernate\nWebLogic\nExperience working in Agile/Scrum environments\n\nAdditional Information\n\n\nWhy Version 1?\n\nAt Version 1, we believe in providing our employees with a comprehensive benefits package that prioritises their wellbeing, professional growth, and financial stability.\n\nShare in our success with our Quarterly Performance-Related Profit Share Scheme, where employees collectively benefit from a share of our company's profits.\nStrong Career Progression & mentorship coaching through our Strength in Balance & Leadership schemes with a dedicated quarterly Pathways Career Development programme.\nFlexible/remote working, Version 1 is tremendously understanding of life events and people’s individual circumstances and offer flexibility to help achieve a healthy work life balance.\nFinancial Wellbeing initiatives including; Pension, Private Healthcare Cover, Life Assurance, Financial advice and an Employee Discount scheme.\nEmployee Wellbeing schemes including Gym Discounts, Bike to Work, Fitness classes, Mindfulness Workshops, Employee Assistance Programme and much more. Generous holiday allowance, enhanced maternity/paternity leave, marriage/civil partnership leave and special leave policies.\nEducational assistance, incentivised certifications, and accreditations, including AWS, Microsoft, Oracle, and Red Hat.\nReward schemes including Version 1’s Annual Excellence Awards & ‘Call-Out’ platform.\nEnvironment, Social and Community First initiatives allow you to get involved in local fundraising and development opportunities as part of fostering our diversity, inclusion and belonging schemes.\n\nAnd many more exciting benefits… drop us a note to find out more.\n\nEkta Bahl - Talent Acquisition Capability Partner\n\n#LI-EB1"}
{"id": "a3e803edad30cc8c", "title": "Hiring in Canada: Senior Web Application Developer", "company": "Flynn Group of Companies", "location": "Dublin, County Dublin", "description": "At Flynn, it's not just a job, it's a career\n\nFlynn Group of Companies, North America’s leading building envelope contractor is looking to hire a Sr. Web Application Developer to work in our Toronto, Canada office.\n\nThis is a permanent relocation opportunity to relocate to Canada and expects individuals coming to office all 5 days.\n\nIn-house, licensed Immigration team at Flynn who will assist you with the following:\nWork permit application (at no cost to you)\nPermits for your spouse/common-law partner and dependent children to relocate with you to Canada\nMaintaining and renewing your status in Canada without having to leave the country\nPermanent residency application for you and your family once you qualify\n\nHow We Will Help You Grow\n3 months accommodation\nReimbursement for your flight to Canada\nHealth Insurance and Prescription Drug Plan for you and your family\nDental and vision plans\nRegistered Retirement Savings Plan (RRSP) contributions\nExtensive safety training, state of the art equipment, and cutting edge technology that will allow you to work in a safe & healthy environment\n\nOur Tech Stack\nOur primary tech stack is .NET (C#) hosted in Amazon AWS and Microsoft Azure. We use MongoDB, MySQL, and SQL Server for our databases. Apps are built in ASP.NET and Angular for our web apps and a mix of Java, Swift, and Xamarin for our mobile apps.\n\n\n\n\nResponsibilities\nWill be a core member of the team to design, architect, develop, code reviews and\ntest our key applications\nDesign new application features and integrations in collaboration with team members to deliver complex changes\nDesign and implement scalable and resilient cloud solutions with security and disaster recovery in mind\nHelp the team plan and execute technical deliverables\nEnsure good code coverage and test coverage by writing and maintaining effective automated tests\nBe a champion of code quality in team by adhering to CLEAN architecture and SOLID principles\nMentor other developers on the team in software development life cycle and best practices and elevate the skill of the team through technical mentorship\nWork with BA team and stakeholders to identify business needs and develop solutions that align with their objectives\nOff-hours support as required\nParticipate in a rotating weekly on-call schedule\nWhat we are Seeking\n10+ years of recent experience, with at least 5 years in a Sr. Web Developer or similar senior role\nPost-secondary education in Computer Science/IT or related field\nExperience in .NET / .NET Framework and C#\nExperience in entity framework\nExperience with TypeScript front-end frameworks: Angular, React, Vue\nExperience with commonly used relational database: MySQL, SQL Server, Postgres\nExperience with commonly used non-relational databases: MongoDB, DocumentDB, DynamoDB\nDocker and container-hosting: AWS ECS, Kubernetes\nGeneral Amazon AWS knowledge (or equivalent): EC2, S3, CloudFront, Elastic Beanstalk, Dynamo DB\nBasic networking knowledge and troubleshooting\nExperience with any of the following tools and technologies: Atlassian Jira, GitHub, Azure DevOps, Aha!, New Relic, Sumo Logic\nFlynn Group of Companies is the leading trade contractor in North America that works on virtually every aspect of a building’s outer layer, including Roofing, Glazing, Waterproofing, and Architectural Metals. The foundation of our award winning success is having the right people on our team.\nDisclosure: We use an AI-powered system to initially screen resumes. However, all applications/resumes are also reviewed by our team of Human Resources and Talent Acquisition Professionals to ensure a fair and thorough evaluation in determining a candidate’s potential fit for a role they applied to.\nThis posting is for an existing vacancy within the organization.\n\n\n\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us."}
{"id": "9b87a9e7ff8addf8", "title": "Full Stack Developer / Engineer", "company": "GGL Security", "location": "Limerick, County Limerick", "description": "Role Overview:\n\nAs a Full Stack Developer / Engineer, you will play a key role in the design, development, and continuous enhancement of applications within GGL’s global logistics visibility and monitoring ecosystem. This position blends hands-on software engineering with solution design and technical leadership.\n\nYou will work onsite with cross-functional teams — including operations, SOC, and infrastructure — to improve performance, develop new platform modules, and integrate data from CCTV, alarm, GPS, and IoT systems. Reporting directly to the CTO, you will ensure that GGL’s products continue to evolve as scalable, secure, and resilient technology ecosystems supporting our international operations.\n\nCompany Summary\n\nGGL Security is a global leader in integrated security and logistics monitoring solutions, specialising in CCTV, alarm monitoring, and IoT-based supply chain protection. Through our proprietary applications, we deliver real-time visibility, intelligence, and operational assurance to clients across Europe and beyond.\n\nOur culture values innovation, accountability, and collaboration, providing a dynamic environment for engineers who are passionate about technology, security, and impact.\n\nKey Responsibilities:\n\n· Lead the design, development, and maintenance of front-end and back-end web applications supporting the All-One-View platform.\n\n· Develop secure, scalable, and high-performance systems integrating multiple data sources and APIs.\n\n· Collaborate with internal teams and external vendors to enhance functionality, data accuracy, and automation.\n\n· Implement and maintain best practices for coding, version control, testing, and deployment.\n\n· Work closely with infrastructure, SOC, and database teams to ensure reliability and uptime.\n\n· Monitor and troubleshoot live applications, ensuring timely issue resolution.\n\n· Mentor junior developers and interns, promoting technical excellence and adherence to development standards.\n\n· Contribute to continuous improvement, documentation, and innovation initiatives within the platform.\n\n· Maintain compliance with data protection, cybersecurity, and confidentiality standards.\n\nWhat We Look For in You:\n\n· 3–5 years of professional experience in full-stack web application development.\n\n· Proven ability to manage the end-to-end development lifecycle — design, build, test, deploy, and support.\n\n· Strong proficiency in Java, Python, JavaScript, SQL, and REST API integration.\n\n· Familiarity with modern front-end frameworks (React, Angular, or Vue) and back-end environments (Spring Boot, Node.js, or equivalent).\n\n· Experience in cloud and virtualised environments (Azure, AWS, VMware, or similar).\n\n· Familiarity with mobile development concepts and platforms (iOS, Android) is a plus.\n\n· Exposure to CCTV, alarm, GPS, or IoT data integration is an advantage.\n\n· Strong analytical, troubleshooting, and documentation skills.\n\n· Excellent communication and teamwork abilities.\n\n· Ability to work onsite in a secure environment, adhering to confidentiality and operational protocols.\n\nWhat We Offer:\n\n· Competitive salary and performance-based incentives.\n\n· Direct collaboration with senior leadership on strategic technology initiatives.\n\n· Professional development and certification support.\n\n· Exposure to advanced IoT, logistics, and monitoring technologies.\n\n· A supportive, innovation-driven work culture that values growth and excellence.\n\nJob Types: Full-time, Permanent\n\nPay: €50,000.00-€60,000.00 per year\n\nApplication question(s):\n\nWill you now or in the future require sponsorship for employment Visa status?\nAre you comfortable with working in an onsite setting?\nThis job is based in Limerick City Centre, are you able to commute to this location?\n\nWork authorisation:\n\nIreland (required)\n\nWork Location: In person"}
{"id": "58945db9c72ef5c9", "title": "Front End Web Developer", "company": "Brightery", "location": "Dublin, County Dublin", "description": "You're now applying on job, Please send real and updated information.\n\nJob Code: #UID10\n\nType: full-time\n\nResponsibilities:\nPerfectionism when it comes to code quality\nCommitment to developing a simple, clean, and attractive UI/front-end\nConfidence that your talent is significantly above your peers and competitors\nA willingness to embrace the concept of iterative development as the means for building excellent products\nAnd obsessive commitment to quality\n\nSkills:Bachelor’s Degree in Computer Science or related field\nGeneral knowledge of back-end web development from a consumer perspective\nExcellent communication skills (in English)\nProficiency in the following skills and technologies is mandatory:\nCSS, HTML5, Bootstrap, jQuery\nAdobe Creative and/or CorelDraw Graphics Suite\nBootstrap\nAngularJS\nProficiency in the following technologies is desired but not mandatory:\nCompass\nAdobe Flash\n\n\nExperience:0 - 4 Years\n\nOpening: 4"}
{"id": "7aab1dbd44acd105", "title": "Software Engineer Frontend - React", "company": "Uvation", "location": "Remote", "description": "Job Overview:\n\nAs a React Frontend Software Engineer, you will be responsible for developing and implementing user interface components using React.js and workflows (such as Flux or Redux). You will ensure that these components and the overall application are robust and easy to maintain, ensuring a seamless user experience.\n\nResponsibilities:\n\nDevelopment and Design: Develop new user-facing features using React.js. Build reusable components and front-end libraries for future use. Translate designs and wireframes into high-quality code.\n\nPerformance Optimization: Optimize components for maximum performance across a vast array of web-capable devices and browsers.\n\nCollaboration: Collaborate with product team and back-end developers for defining and implementing innovative solutions for the product direction, visuals, and user experience.\n\nTesting and Debugging: Write and maintain test cases to ensure the robustness and reliability of the code. Debug and fix issues reported in the production environment.\n\nMaintenance and Upgrades: Keep up-to-date with the latest React.js trends and industry best practices.\n\nRequirements:\n\nEducation: Bachelor's degree in Computer Science, Software Engineering, or a related field.\n\nExperience: At least 5-6 years of experience in React.js development. Experience with popular React.js workflows (such as Flux or Redux) is a must.\n\nTechnical Skills: Proficiency in JavaScript, including DOM manipulation and the JavaScript object model. Familiarity with newer specifications of ECMAScript. Experience with data structure libraries.\n\nSoft Skills: Strong problem-solving skills, a keen eye for detail, and a team-oriented mindset. Excellent communication skills for coordinating with other teams.\n\nOther: Familiarity with RESTful APIs, modern front-end build pipelines and tools, code versioning tools such as Git.\n\nDisclaimer:\n\nThis job description is not an exhaustive list of the skills, efforts, duties, and responsibilities associated with the position. The company is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations, and ordinances.\n\nNote: The actual duties and responsibilities may vary depending on the department's needs and the evolution of the role."}
{"id": "8b5523244bdd49b0", "title": "Tailwind Front-end Developer for B2B Platform", "company": "Dotsub", "location": "Remote", "description": "Dotsub is building a unique video captioning and translation management tool that enables clients organize their in-house linguists, create and manage custom workflows, take advantage of the power of AI to automate some aspects of the captioning and translation process - or just buy localization services.\n\nWe're seeking a talented and experienced UI designer, fluent in React and Tailwind CSS, to help us replace our bootstrap based front-end framework with Tailwind CSS components. The ideal candidate would have strong knowledge of modern CSS methodologies and patterns, and will be willing to work closely with our product team to understand the existing application and help us launch iterative improvements.\n\nAbout you\n\nYou've been working on CSS frameworks for enterprise-grade web applications.\nYou have proven experience with Tailwind CSS.\nFluency in React and Typescript is recommended.\nHave excellent visual design skills.\nYou proactively question the existing UI implementations, and make thoughtful suggestions based on your expertise and understanding of the use case.\n\nThe candidate should expect to be dedicated full-time to this project, for approximately 3 to 6 months, but we're open to continuing the collaboration after that, if needed.\n\nDotsub is a 100% remote team, so you can also work from anywhere, as long as your working day overlaps for at least a few hours with the US Eastern time zone.\n\nTo apply for this project, please share...\n\nYour hourly rate, weekly availability, and potential start date\nA portfolio of work that you've designed on your own or as the leader of a team (please note which designs weren't created independently).\nAny clarifying questions\n\nBecause of the collaborative nature of this work, we prefer to work with a single designer. Agencies will not be considered."}
{"id": "b547343efada0fe4", "title": "JavaScript Developer", "company": "BeetsBytes", "location": "Remote", "description": "Overview\n\nWe are looking for a JavaScript engineer to join us in building the HTML5-based UI for a global, market-leading trading platform. Work with Angular, TypeScript, Rx.js, and JavaScript in a company-wide UI monorepo containing both application and library code.\n\nAs a self-starter, you'll analyze complex problems and deliver clear solutions while proactively identifying customer needs and developing creative technological approaches.\n\nPerformance is critical as the platform handles real-time data for hundreds of financial products simultaneously. We value candidates with JavaScript/HTML5 optimization experience and awareness of the latest ECMAScript, V8, browser, and TypeScript developments. Strong automated testing skills (unit testing, TDD) on large-scale codebases are essential to our quality-first culture.\n\nOur client is expanding into Node.js microservices using Nest.js, MongoDB, Redis, and Docker, with tight UI integration. Though most server-side development is currently in C++, our client's goal is to have consistent practices and tooling across both the UI and server-side.\n\nJob Responsibilities:\n\nResponsible for delivering software end-to-end.\nLiaising with product managers and designers, to coordinating across international development teams on engineering and architecture, to working with our QA and dev ops teams.\nTo deliver a quality, innovative product to the traders and investors who depend on our platform every day.\nArchitecture, implementation, and delivery of new web-based trading UI functionality.\nProblem solving and debugging skills, especially for production issues.\nHosting and participating in code review\n\nRequired Qualifications:\n\nEducation: at least Bachelor's Degree, preferably in Computer Science\nAt least 3 years' professional web application development experience\nExpert-level JavaScript knowledge, and curiosity to learn more\nAngular 19 – the more in-depth your understanding, the better\nTypeScript, HTML5, CSS3, SASS\nSuperior analytical and problem-solving ability\nEffective communication skills to work with different teams across an international company\nAutomated unit testing and test-driven development\nBroad knowledge of web platform and technologies\nRobust understanding of performance issues, computational complexity, and code optimization.\nFamiliarity and implementation of industry-standard algorithms and design patterns\nProactive and team player who can deliver in a high-pressure demanding environment\nInterest in UX and UI design implementation\nInterest in DevOps and tooling\nNode.js microservices, Nest.js, Mongo, Docker – helpful\n\nCompany Description\n\nOur client is a leading technology company specializing in electronic trading solutions across multiple financial markets. As global financial markets continue to evolve, their platform enables efficient, multi-asset trading for institutional clients worldwide. They serve thousands of clients across numerous countries, including major financial institutions, asset managers, investment firms, and corporate clients.\n\nOur client's success is built on innovative collaboration and client-focused solutions that have driven consistent organic growth. They process significant daily trading volumes, facilitating billions in transactions across their platform ecosystem."}
{"id": "c11910e81a3c3c13", "title": "Web Developer - Full Stack MERN", "company": "Confidental Company", "location": "Remote", "description": "Job Title: Web Developer - MERN Stack\n\nLocation: Remote\n\nJob Type: Full-Time, Long-Term Hire\n\nSalary: Competitive, based on experience level\n\nAbout Us: We are a dynamic and innovative company looking to expand our team with a talented MERN Stack Developer. Our team is fully integrated and works collaboratively to deliver cutting-edge solutions. We value personal and professional growth and are committed to providing opportunities for our team members to learn and develop. This role will involve you working accross a variety of projects, you will be asked to learn a lot, take on repsonsibility, think outside the box, and become a key member of our team.\n\nKey Responsibilities:\n\nDevelop and maintain web applications and mobile apps using MongoDB, Node.js, React.js, and ReactNative.\nCollaborate with cross-functional teams to define, design, and create new features.\nWrite clean, maintainable, and efficient code.\nTroubleshoot and debug applications.\nStay up-to-date with emerging technologies and industry trends.\nInnovate, and come up with solutions to solve problems and to avail of opportunities.\n\nTech Stack:\n\nReact\nRedux\nNode\nMongoDB\nReact Native\n\nQualifications:\n\nExperience with the MERN stack (MongoDB, Express.js, React.js, Node.js).\nStrong understanding of JavaScript and modern web development practices.\nAbility to demonstrate innovative thinking and problem-solving skills.\nExcellent communication and teamwork abilities.\nEagerness to learn and grow both personally and professionally.\nOpen to developers of different experience levels; willingness to mentor and be mentored.\n\nWhat We Offer:\n\nCompetitive salary based on experience level.\nFully remote work environment.\nOpportunities for continuous learning and professional development.\nA supportive and collaborative team culture.\nLong-term career growth and stability.\n\nHow to Apply: Please submit your resume and a short cover letter detailing your experience and why you would be a great fit for our team.\n\nJob Type: Full-time\n\nPay: €35,000.00-€55,000.00 per year\n\nBenefits:\n\nCompany events\nFlexitime\nSick pay\nWork from home\n\nApplication question(s):\n\nPlease succinctly describe your professional React experience. No AI produced/enhanced answers will be accepted. If you do not have this experience, please simply state this.\nPlease succinctly describe your professional Node experience. No AI produced/enhanced answers will be accepted. If you do not have this experience, please simply state this.\nPlease succinctly describe your professional Redux experience No AI produced/enhanced answers will be accepted. If you do not have this experience, please simply state this.\nOur advertised salary range is €35k – €55K. Based on your professional experience and skills, where do you see yourself within this range (please justify your answer)? No AI produced/enhanced answers will be accepted.\n\nEducation:\n\nBachelor's (preferred)\n\nExperience:\n\nReact: 2 years (preferred)\nNode.js: 2 years (preferred)\nRedux: 2 years (preferred)\n\nWork Location: Remote"}
{"id": "48ad5a094fd28f03", "title": "Graduate/Junior Full Stack Developer", "company": "Ashgrove Renewables", "location": "Cork, County Cork", "description": "Role: Full Stack Developer I – (Graduate/Junior)\n\nLocation: Mallow, Co. Cork\nEmployment Type: Full-Time, On-site\n\nAshgrove is seeking a motivated graduate/Junior Full Stack Developer to join our fast-growing Mallow based team.\n\nThis role provides the opportunity to contribute across the full software development lifecycle, delivering scalable backend services and modern front-end applications while supporting continuous improvement initiatives across the business.\n\n\nContribute across the full project lifecycle, including requirements analysis, solution design, development, testing, deployment, and ongoing support.\n\nDevelop, design & create backend services and modern web-based front-end applications\n\nIdentify opportunities for automation and process improvement and implement scalable technical solutions.\n\nParticipate in architecture discussions, technical evaluations, and technology selection.\n\nActively collaborate in the strategic goals of the CI department,\nAssist in maininting existing applications & providing IT assistance to fellow employees,\nCollaborate with department heads to define and measure KPIs and KQIs aligned to business objectives.\n\nLiaise with Zoho support on complex integrations and enhancements.\n\nAssist in the development and deployment of non-software based process improvement,\n\nRequirements\n\nTechnical Skills & Experience\n\n\n\nStrong ability to analyse requirements, explore alternatives, and derive effective technical solutions to complex problems.\n\nProven experience in full stack development, with strong hands-on expertise in Node.js, Next.js, and PostgreSQL and other latest scripting languages. Experience with additional frameworks, languages, or databases is highly advantageous.\n\nExperience designing and consuming RESTful APIs, with a strong understanding of business process automation and system integration.\n\nFamiliarity with CI/CD pipelines, version control systems, and automated deployment practices.\n\nSolid understanding of software architecture, data modelling, scalability, and system maintainability.\n\nAshgrove uses the Zoho One platform. Experience with Deluge is not required; however, a strong foundation in general programming principles is essential to enable efficient review and adaptation of existing code.\n\n\nCore Competencies\n\n\n\nStrong written and verbal communication skills with the ability to work effectively in a collaborative team environment.\n\nExcellent analytical and problem-solving capability with a methodical approach to task execution.\n\nHigh level of initiative, curiosity, and willingness to continuously learn and develop technical expertise.\n\nAbility to independently research, evaluate, and implement viable solutions.\n\nStrong attention to quality, documentation, and delivery standards.\n\nBenefits\nCompetitive salary commensurate with experience\n\nCompany Pension\n\nFlexible working hours\n\nPerformance-related bonus\n\nBike to Work scheme\n\nOnsite parking\n\nEmployee Discounts\n\nCompany Paid Leave\n\nFurther educational support, training and development opportunities\n\nSports and Social events and activities"}
