{"id": "9d9ba18ee96fcf5f", "title": "Full Stack Developer (Python / ReactJS)", "company": "PV Generation Ltd", "location": "Glanmire, County Cork", "description": "About Us:\n\nPV Generation have been installing Solar PV systems across Ireland since 2015. Due to continued expansion, success & market growth we are seeking a Full Stack Developer (Python/ReactJS).\n\nIf you would like to join a business who are committed to helping Ireland prevent the depletion of natural resources for generations to come, then this could be your next career opportunity.\n\nHere at PV Generation, we have a people first policy which extends not only to our customers but also to our team. We pride ourselves on having a friendly and supportive work culture, with an open-door policy.\n\nAbout the Role\n\nWe’re looking for a skilled Full Stack Developer with strong experience in backend and frontend technologies to design, build, and scale modern web applications. The ideal candidate is proficient in Python, ReactJS, and cloud technologies, with a solid understanding of API integration and authentication systems.\n\nKey Responsibilities\n\n· Develop and maintain scalable web applications using Python and ReactJS.\n\n· Design, implement, and manage RESTful APIs for seamless data exchange.\n\n· Integrate secure authentication and authorization workflows using OAuth 2.0.\n\n· Deploy, monitor, and optimize applications in a cloud environment\n\n· Collaborate with cross-functional teams to design and deliver user-centric solutions.\n\n· Write clean, maintainable, and testable code following best development practices.\n\nRequired Skills and Qualifications\n\n· Proven experience with Python (Flask, Django, or FastAPI).\n\n· Hands-on experience with ReactJS for dynamic front-end development.\n\n· Deep understanding of REST API design principles.\n\n· Familiarity with OAuth 2.0 and secure API authentication standards.\n\n· Experience working with cloud platforms such as AWS, Google Cloud Platform, or Azure.\n\n· Strong problem-solving skills and ability to work in an agile, collaborative environment.\n\nNice-to-Have\n\n· Experience with CI/CD pipelines and DevOps tools.\n\n· Knowledge of Docker or Kubernetes.\n\n· Understanding of database systems (SQL/NoSQL).\n\nBenefits:\n\nPension Scheme\n\nCompany events\n\nFriendly team culture\n\nEmployee Assistance Programme-EAP\n\nOngoing training, guidance and monitoring\n\nGenerous salary\n\nStaff referral\n\nStaff uniforms\n\nHuge staff discount\n\nJob Type: Full-time\n\nWork Location: In person"}
{"id": "c11910e81a3c3c13", "title": "Web Developer - Full Stack MERN", "company": "Confidental Company", "location": "Remote", "description": "Job Title: Web Developer - MERN Stack\n\nLocation: Remote\n\nJob Type: Full-Time, Long-Term Hire\n\nSalary: Competitive, based on experience level\n\nAbout Us: We are a dynamic and innovative company looking to expand our team with a talented MERN Stack Developer. Our team is fully integrated and works collaboratively to deliver cutting-edge solutions. We value personal and professional growth and are committed to providing opportunities for our team members to learn and develop. This role will involve you working accross a variety of projects, you will be asked to learn a lot, take on repsonsibility, think outside the box, and become a key member of our team.\n\nKey Responsibilities:\n\nDevelop and maintain web applications and mobile apps using MongoDB, Node.js, React.js, and ReactNative.\nCollaborate with cross-functional teams to define, design, and create new features.\nWrite clean, maintainable, and efficient code.\nTroubleshoot and debug applications.\nStay up-to-date with emerging technologies and industry trends.\nInnovate, and come up with solutions to solve problems and to avail of opportunities.\n\nTech Stack:\n\nReact\nRedux\nNode\nMongoDB\nReact Native\n\nQualifications:\n\nExperience with the MERN stack (MongoDB, Express.js, React.js, Node.js).\nStrong understanding of JavaScript and modern web development practices.\nAbility to demonstrate innovative thinking and problem-solving skills.\nExcellent communication and teamwork abilities.\nEagerness to learn and grow both personally and professionally.\nOpen to developers of different experience levels; willingness to mentor and be mentored.\n\nWhat We Offer:\n\nCompetitive salary based on experience level.\nFully remote work environment.\nOpportunities for continuous learning and professional development.\nA supportive and collaborative team culture.\nLong-term career growth and stability.\n\nHow to Apply: Please submit your resume and a short cover letter detailing your experience and why you would be a great fit for our team.\n\nJob Type: Full-time\n\nPay: €35,000.00-€55,000.00 per year\n\nBenefits:\n\nCompany events\nFlexitime\nSick pay\nWork from home\n\nApplication question(s):\n\nPlease succinctly describe your professional React experience. No AI produced/enhanced answers will be accepted. If you do not have this experience, please simply state this.\nPlease succinctly describe your professional Node experience. No AI produced/enhanced answers will be accepted. If you do not have this experience, please simply state this.\nPlease succinctly describe your professional Redux experience No AI produced/enhanced answers will be accepted. If you do not have this experience, please simply state this.\nOur advertised salary range is €35k – €55K. Based on your professional experience and skills, where do you see yourself within this range (please justify your answer)? No AI produced/enhanced answers will be accepted.\n\nEducation:\n\nBachelor's (preferred)\n\nExperience:\n\nReact: 2 years (preferred)\nNode.js: 2 years (preferred)\nRedux: 2 years (preferred)\n\nWork Location: Remote"}
{"id": "c784399326fe39ab", "title": "Marketing Executive (Web Development)", "company": "WRX Supply", "location": "County Meath", "description": "WRX Supply are seeking a proactive and digitally skilled Marketing & Web Development Executive to support and grow the online business. This role is ideal for someone who combines marketing creativity with strong technical knowledge of website development, digital platforms, and content management.\n\nYou will play a key role in managing the website, supporting marketing campaigns, and improving digital experience for our audience.\n\nYou will be responsible for the day-to-day operation and development of our website while supporting wider marketing initiatives across different channels.\n\nKey Responsibilities:\n\nManage and maintain the company website, ensuring content, imagery, and messaging are up to date and engaging.\nSupport website development projects, including page build, updates, and performance optimisation.\nWork with the team to implement new website features and functionality.\nEnsure the website reflects brand standards and delivers a strong user experience across desktop and mobile.\nSupport digital marketing activates, including, social media, email campaigns, and online promotions.\nMonitor website performance, audience behaviour, and campaign results using analytics to drive improvements.\n\nSkills & Experience:\n\nPrevious experience in marketing or digital marketing roles.\nStrong working knowledge of website management and content management systems (e.g. WordPress.\nExperience with digital analytics tools such as Google Analytics.\nFamiliarity with SEO principles.\nStrong attention to detail.\nCreative, commercially aware, and results-driven mindset.\nExperience with social media advertising.\n\nWhat We Offer:\n\nFull-time, permanent position.\nCompetitive salary depending on experience.\nOpportunity to grow & develop.\nSupportive team.\n\nJob Type: Full-time\n\nPay: €35,000.00-€40,000.00 per year\n\nBenefits:\n\nOn-site parking\nSick pay\n\nWork Location: In person"}
{"id": "8174e5af20cbf45c", "title": "E-commerce Web Developer", "company": "Allied Imports LTD (Tipperary Crystal)", "location": "Dublin, County Dublin", "description": "Location: Dublin, Ireland | Salary: €35,000* | Full-Time | Monday – Friday, 8:00 am – 4:00 pm\n\nWe’re expanding our e-commerce team and work with an exciting range of products, including fragrances, soft toys, homeware, jewellery, and more. If you enjoy coding, building features, analysing data, and being hands-on across multiple areas of the business, this role could be perfect for you!\n\nThe E-commerce Web Developer will work on our websites, ensuring they’re technically robust, user-friendly, and optimised for sales. You will also use data analytics to drive performance improvements and support creative marketing initiatives across our brands: Tipperary Crystal, Regency Fragrances, and Gosh! Soft Toys.\n\nYou will collaborate closely with the E-commerce Manager, SEO Specialist, Paid Ads Manager, and Stock Management Team to support campaigns, social media, email marketing, and website management.\n\nKey Responsibilities\n\n1. Website & Web Development (BigCommerce)\n\nMaintain, and enhance our BigCommerce websites using coding skills (HTML, CSS, JavaScript, and relevant frameworks).\nImplement technical fixes, troubleshoot issues, and enhance website functionality.\nCustomise themes, configure plugins, and develop new features to improve UX and drive online sales.\nAssist with product listings: images, descriptions, pricing, and categorisation.\nMonitor website performance, page speed, and mobile responsiveness, implementing improvements as needed.\n\n2. E-commerce & Marketplace Management\n\nManage Amazon Seller Central accounts.\nOptimise product listings with high-quality content, images, and keywords using Amazon SEO techniques.\nHandle customer service, reviews, and daily operations on Amazon.\nUse data analytics to identify trends, track KPIs, and optimise sales performance.\n\n3. Creative Support & Content\n\nAssist with creating banners, visuals, and website content updates. Creative work on Canva and Adobe.\nWrite compelling product descriptions, marketing copy, and email campaigns.\nEnsure all creative content aligns with website updates and product launches.\n\n4. Collaboration & Analytics\n\nWork closely with the E-commerce Manager and other teams to support marketing and e-commerce initiatives.\nUse analytics tools (Google Analytics, BigCommerce reports, or similar) to monitor traffic, conversions, and customer behaviour.\nRecommend data-driven improvements for campaigns, promotions, and website features.\n\nBackground / Experience\n\n1–3 years’ experience in e-commerce, digital marketing, or web development.\nStrong technical skills: HTML, CSS, JavaScript, and experience customising BigCommerce or other e-commerce platforms.\nExperience managing online marketplaces, especially Amazon, is an advantage.\nComfortable with data analytics, KPI reporting, and conversion optimisation.\nExposure to creative work, copywriting, or CRM campaigns.\n\nAddress - Allied House, Unit 804, Northwest Business Park, Phase 3. Ballycoolin. Dublin 15\n\nJob Type: Full-time\n\nPay: €35,000.00 per year\n\nBenefits:\n\nCompany events\nEmployee discount\nOn-site parking\n\nEducation:\n\nBachelor's (required)\n\nExperience:\n\nE-commerce: 1 year (required)\n\nWork Location: In person"}
{"id": "8958e5b88e09fb14", "title": "Junior to Mid PHP Developer", "company": "Kelsius", "location": "Remote", "description": "Kelsius is the leading supplier of automation technology for product safety and compliance with the food services and healthcare industries. Using our world class wireless temperature monitoring technology, digital HACCP Management system and cloud-based data hosting and processing, Kelsius systems improve product safety, ensure regulatory compliance and optimise costs associated with these activities. Founded in 2003, Kelsius operates in Ireland and the UK and we export our products and services to over 50 countries across the globe. Our customers range from large supermarket chains, restaurants & hotels to pharmaceutical manufacturers, healthcare facilities, laboratories, foodservice companies and vaccination centres.\n\nKelsius is recruiting for the role of Junior to Mid PHP developer for a legacy web application to strengthen its R&D team. You will be responsible for enhancing and maintaining various applications (Client facing and internal web-based applications), to continue to grow our market base. This is an exciting opportunity, if you have an interest in IoT and want to get involved in a rapidly growing industry.\n\nYou will work alongside the Product Manager, the R&D team and the Testing team and be responsible for the full development life cycle of the app. Your ability to understand requirements and to convert them to efficient solutions makes you an ideal self-starter candidate. Your ability to work on multiple projects in a very agile environment will set you apart.\n\nOur application is built with core PHP (no full-stack frameworks), so a strong understanding of vanilla PHP and custom architecture is essential and includes:\n\nMain Responsibilities:\n\nDevelop new software features, and maintain existing software: debug and fix issues in an existing PHP codebase\nMake small/medium changes safely in legacy code\nWrite and maintain raw SQL queries\nMinor JavaScript for simple UI behaviour\n\nThe successful candidate will:\n\nHave good experience with PHP and MySQL. 1-5 years’ experience.\nPlain PHP fundamentals (comfortable without a framework)\nStrong debugging skills\nWeb Fundamentals\nPractical web security knowledge\nFamiliarity with RESTful APIs and integrating third-party services.\nAbility to write clean, maintainable, and testable code.\nDemonstrate initiative, be a self-starter, show willingness to learn.\nHave strong organizational skills and demonstrate a good attention to detail.\nHave good interpersonal skills and be a team player.\nHave some experience using Git (Git Basics)\nHave the ability to work in a fast-paced development environment and to commit to deadlines\n\nThis is a remote working role with occasional visits to our head office in Gweedore/Falcarragh, Co. Donegal. Candidates must reside in Ireland and have the right to work in Ireland.\n\nAt Kelsius we are an equal opportunity employer. We attract and retain the best qualified individuals available, without regard to race/ethnicity, religion, gender, sexual orientation, age or disability.\n\nJob Types: Full-time, Permanent\n\nPay: €35,000.00-€40,000.00 per year\n\nBenefits:\n\nBike to work scheme\nCompany events\nSick pay\nWork from home\n\nApplication question(s):\n\nKelsius is only able to hire individuals who are legally able to work in Ireland &/or the UK. We are not currently looking to sponsor candidates for this role. Are you currently able to work legally and full time in Ireland and/or the UK?\nThis positions requires fluency in English (reading, writing & speaking). Are you fluent in English?\nThis position requires the candidate live and work full time in Ireland &/or the UK. Are you located in Ireland and/or UK?\n\nExperience:\n\nPHP Development: 3 years (preferred)\n\nWork Location: Remote"}
{"id": "ccbceb25d1505557", "title": "Erasmus Web Developer", "company": "Stay Planet", "location": "Dublin, County Dublin", "description": "Company Description\n\n\nStayPlanet is vacation rental booking engine which offers real time booking for homestay, farmstay, village stay, camping, apartments, hotels, hostels, and B&Bs. Our headquarters is based in Dublin, Ireland.\n\n\nJob Description\n\n\nThe Job:\n\nWe are currently seeking to recruit hard working, self-motivated PHP developer who has experience in hotel booking engine development and API integrations to work as web developer in our Dublin headquarters.\n\nThis position would be perfect for Erasmus students looking to develop their web skills in a professional environment.\n\nThe candidate must share passion for technology, innovation with deep technical expertise and extensive hands-on development experience.\n\nDuties & Responsibilities\n\nDesign, implement and maintain Web and mobile applications with an emphasis on PHP and Web-based application development.\nPHP – most of the server-side code is written in PHP and implemented in the Codeigniter framework, with other stand-alone PHP code such as web services and XML integrations.\nAngular – Angular is the front-end language of choice. Our apps still leverage basic Javascript or jQuery. The developer will write and transition most code in Angular.\nHTML – view code for web applications includes HTML code.\nCSS – view code for web applications includes CSS code.\nMySQL – the data from multiple applications are stored in MySQL databases. New and existing features will require an expertise in how to create/update/optimize both the MySQL schema and build out the model code and queries in PHP.\nGit – ability to manage and maintain source code in Git or other version control systems.\nLinux – the web servers are primarily Linux Servers, so you will often find yourself in a Linux Shell checking on the web services.\nApache – running on the Linux Servers is usually Apache. You may need to make changes to Apache configuration or spin up a new server running Apache.\nProvide support to enhance or debug application behaviour and performance-related problems.\n\nQualifications\n\n\nExperience:\nExperience in full stack web development;\nStrong knowledge of PHP MVC web frameworks (CodeIgnitor, Laravel, Slim) and Javascript MVC frameworks (Angular)\nExperience in architectural work involving performance optimization, MySQL query optimization, application caching strategies, or related work\n\nAPI development REST, SOAP, XML, JSON, Web Sockets, WebRTC, Graph QL\nGood working knowledge of html, Javascript and CSS\nExperience working with Git;\nExperience working with cloud infrastructure: AWS, RackSpace Cloud, DigitalOcean, etc.;\n\nNice to Have:\n\nSales Force integration experience\niOS and Android Development\nExperience in additional languages (C#, ASP.NET, Java)\nDevOps experience: experience automating deployments, testing, server configurations, etc.\nLinux System Administration\n\nQualifications:\n\nBachelor’s degree Computer Science or equivalent work experience\n\n\nAdditional Information\n\n\nWhat we offer\n\nThe opportunity to develop valuable marketing and communications skills.\nA personal development plan and regular support to help you in your role.\nReferences will be supplied on successful completion of your period."}
{"id": "17f660f5f3167d44", "title": "Frontend Developer", "company": "Kitman Labs", "location": "Dublin, County Dublin", "description": "Company Description\n\n\nWe’re building the software that enables world class sports teams to perform at the peak of their abilities. Our clients are elite professional and international squads in sports like rugby, soccer, American football, baseball and basketball.\n\n\nJob Description\n\n\nWe're looking for people to join our growing Product Engineering group. This team is responsible for creating and maintaining all of the tools that our customers use to get the best from their athletes.\n\n\nUltimately we want you to decide what you do, but for an idea of what your day to day work will be like, we imagine you'll do things like:\n\nBuild interfaces that make it incredibly easy to get information into our system. We collect data from a wide range of sources, so it has to be frictionless for our customers.\nDesign and build tools that help people make sense of the data they've collected and allow them to gain quick insights to power their decision making\nObsess over the quality of the products that you build. We care deeply about providing an amazing user experience and achieve that through a mix of automation, constantly shipping new code, and iterating in short loops\nEnsure the scalability and availability of our systems by writing robust and well tested code\nGrow your career. We want our team to grow with the company, so we bias heavily to internal promotions for leadership roles, whether you're interested in managing teams or being a technical leader\n\nQualifications\n\n\nWhat kind of things are we looking for?\n\nYour initial focus after joining the team will be on our web based products which are Rails applications with a mix of React and ERB views. To that end, you should have:\n\nAt least three years experience implementing data focused, testable and robust user interfaces using a highlevel Javascript application framework such as React or Ember\nExperience working with feature driven teams of designers, product managers and engineers\nExperience creating high quality and device independent user interfaces\n\nAdditional Information\n\n\nBENEFITS\n\nCompetitive salary\nMeaningful equity so that we all share in our successes\nComprehensive health insurance so you don't have to worry about the unexpected\nGym membership to help you keep active\nMacbook Pros are our standard issue laptop, but if you work better with different hardware, we can figure that out\nTaxsaver tickets and a cycle-to-work scheme to help you get around\nA kitchen fully stocked with snacks and drinks to keep fuelled\nA great location, close to the DART, Luas, plenty of bus routes, secure onsite bike parking, and showers in the office"}
{"id": "75a12b93721da004", "title": "Fullstack Engineer (Web Frontend)", "company": "Entity Games", "location": "Dublin, County Dublin•Remote", "description": "Summary\n\nAbout Entity\n\nEntity is on a mission to bring console-quality games to players everywhere — instantly, on any device. Just as software, music and film moved from download and own to click and stream, we believe gaming is shifting from Download and Install to Click and Play Now.\n\nPowered by the latest web technologies and built on the open web, Entity is creating a new home for next-gen instant games. For players, a destination to discover and enjoy incredible new titles (think Steam or YouTube for games). For developers, the tools, publishing power, and access to a truly global audience across every connected device.\n\nFounded by industry veterans and entrepreneurs, and backed by leading investors, we’re assembling our core team. Joining Entity at this stage is a rare opportunity to help shape the future of gaming.\n\n\nAbout the role\n\nWe’re now seeking a Web Engineer with full stack experience to shape the future of our web-based games platform. This role will be central to implementing slick, intuitive, cutting-edge and highly polished user experiences and designs that not only showcases games but also delivers engaging community and social features. The goal is to design an immersive “Games HUB” where players want to spend time, engage deeply, share their experiences and invite their friends to play with them.\n\n\nKey Responsibilities:\n\nBuild engaging, performant, and scalable user interfaces for a platform supporting web-based games.\nVerify and improve frontend performance across devices and browsers, ensuring compatibility and accessibility.\nChoose the right frameworks, tools and out-of-the-box solutions to balance short term objectives with long term sustainability.\nImplement frontend features using modern web frameworks (e.g., Vue.js, Angular, HTMX, Svelte) with TypeScript/JavaScript.\nIntegrate WebGL components and rendering pipelines to support game visuals and interactive experiences.\nWork with real-time systems using WebSockets for low-latency communication between players, services, and tools.\nCollaborate with backend engineers to define and consume APIs that power gameplay and LiveOps features.\nEnsure fast, smooth performance by optimizing UI rendering, asset loading, and content delivery through CDNs.\nWork closely with designers, QA, and product stakeholders to deliver polished, reliable, and testable code.\nStay up-to-date with emerging frontend technologies, real-time networking advances, and best practices for game-related web applications.\n\n\n\nRequirements:\n\n5+ years of experience as part of a professional development team, delivering modern web applications.\nStrong expertise in JavaScript (ES6+), TypeScript, HTML5, and CSS (with preprocessors like SCSS).\nFamiliarity with concepts leading to developing consistent interfaces across different platforms, device types and browsers.\nHands-on experience with Vue.js, Angular, HTMX, Svelte, or similar frameworks (not React).\nSolid understanding of frontend performance optimization (asset bundling, caching strategies, rendering tweaks, local storage).\nExperience with asset delivery optimization via CDNs and caching strategies for high-traffic environments.\nKnowledge of real-time communication with WebSockets and event-driven architectures.\nExperience integrating with RESTful APIs and contributing to API design discussions.\nAwareness of cloud deployment practices (AWS), CDNs, and how frontend interacts with large-scale systems.\nCompetence with version control (Git), CI/CD pipelines, and automated frontend testing.\n\n\n\nBonus points:\n\nExposure to game-related web development, such as multiplayer lobbies, leaderboards, or LiveOps dashboards.\nFamiliarity with WebGL basics and integrating 2D/3D rendering into web apps.\nFamiliarity with AWS services like CloudFront and S3.\nUnderstanding of basic security concerns for web games (preventing exploits, protecting APIs).\nKnowledge of performance monitoring tools (Lighthouse, browser dev tools, Datadog, Kibana).\n\n\n\nRemote Working Conditions:\n\nThis is a remote-first position, allowing employees to work from anywhere with a reliable internet connection, a suitable home-working setup and within +/- 3 hours GMT timezone. We place a strong emphasis on individual responsibility to manage time and work, enabling employees to accommodate their personal life requirements.\n\nOccasional travel may be required for team meetings, industry events, or visits to game development studios. Some flexibility in working hours may be necessary to accommodate meetings with international partners or developers in different time zones."}
{"id": "745a5bb767dd833f", "title": "Front-End Software Engineer - Ireland", "company": "Arista Networks", "location": "Dublin, County Dublin", "description": "Company Description\n\n\nArista Networks is an industry leader in data-driven, client-to-cloud networking for large data center, campus and routing environments. What sets us apart is our relentless pursuit of innovation. We leverage the latest advancements in cloud computing, artificial intelligence, and software-defined networking to provide our clients with a competitive edge in an increasingly interconnected world. Our solutions are designed to not only meet the current demands of the digital landscape but to also anticipate and adapt to future challenges.\n\nAt Arista we value the diversity of thought and perspectives that each employee brings to the table. We believe that fostering an inclusive environment, where individuals from various backgrounds and experiences feel welcome, is essential for driving creativity and innovation.\n\nOur commitment to excellence has earned us several prestigious awards, such as Best Engineering Team, Best Company for Diversity, Compensation, and Work-Life Balance. At Arista, we take pride in our track record of success and strive to maintain the highest standards of quality and performance in everything we do.\n\n\nJob Description\n\n\nWho You'll Work With\n\nWorking on cloud based streaming telemetry services and applications; The Cloud Vision Portal is a web-based front-end application that abstracts the physical network to a broader, network-wide perspective. This consists of a front-end user interface for understanding the stored data from the real-time telemetry streamed from the network switches. It allows you to view events, inspect a device, or compare metrics across devices and much more is planned as it is a key part of Arista's Any Cloud Platform and also the Cognitive Campus initiative.\n\nWhat You'll Do\n\nYou will be part of a team building the user interface based on a streaming telemetry service for networking devices that send real-time updates to a cloud-based data ingestion infrastructure. You will actively participate in designing and implementing a top-quality data exploration and device management user interface, including visualization and correlation of events, network anomaly detection and configuration of networking devices using NodeJS, React and Redux as the pillars of the architecture with ES6 scripting and various tools including Webpack, Storybook,TypeScript and Less.\n\nOne of the many attractions of joining Arista is that from the top Arista is an engineering company. The founders and engineering managers are all engineers who understand good software engineering and the importance of doing things right.Arista hires directly into the broader team, regardless of geography.\n\nOur engineers have full ownership of their projects. Our management structure is flat and lightweight. Software engineering is run by software engineers who are in charge of delivering features from concept through to completion. We put a premium on building and using test automation tools.No part of the company is off-limits, meaning that our engineers have the chance to work on a variety of different areas.\n\n\n#LI-EO1\n\n\nQualifications\n\n5+ Strong development experience with JavaScript, including experience with frameworks like Angular or React\nFamiliarity with build and continuous integration using webpack and npm\nAbility to convert wireframes and mock-ups into high quality components\nCommitment to producing high quality, performant and reliable software\nAn open mind to change with willingness and desire to improve\nEnjoyment of writing code and solving problems\nAbility to appreciate a culture of invention, quality, respect and fun\nProfessional experience an advantage"}
{"id": "849feb9ee4fbafb3", "title": "Front End Developer with React", "company": "8 West Consulting", "location": "Cork, County Cork•Remote", "description": "Overview:\n\n8 West Consulting is one of the country’s largest software development organisations. Formerly named DeCare Systems Ireland, the company has been operating successfully in Cork city since 1998. 8 West Consulting employ a wide range of technologies including Mobile (iOS, Android), Java/Kotlin (Springboot, Akka, JPA, etc.), Microsoft .NET (ASP.NET, C#, etc.), JavaScript (React, Vue, AngularJS, JQuery, Node.js, etc.), various database management systems (MongoDB, Oracle, SQL Server, MySql, etc.) and multiple Cloud Providers (AWS, Azure, GCP). 8 West Consulting provides consultancy and leading-edge software solutions for a wide variety of US, EU and UK based clients in the insurance, healthcare, retail and public sector markets.\n\nFor more on 8 West Consulting visit our website on www.8west.ie\n\n\nWe are seeking an experienced Front End Developer to join our Team. The role is remote and will report to either our satellite office in Cagliari, Italy, or our head office in Cork, Ireland. As a company, we support all levels of remote working, where appropriate. The developer will report to the Software Project Manager and occasionally to appropriate Development Directors. The successful candidate would be responsible for building the frontend components to a variety enterprise applications.\n\n\nResponsibilities:\n\nDesigning & building applications using client-side technologies including React.js\nStrong proficiency in JavaScript, including DOM manipulation and the JavaScript object model\nProvide technical leadership to colleagues about best practices/patterns working with React\nExperience integrating front ends with back end REST APIs\nBuild high-level user interfaces using rapid prototyping methodologies\nGetting feedback from users and clients, and building solutions for them\nAssisting with the analysis of client requirements\nResearch into new frontend technologies and reporting on suitability and benefits to the organisation\nBuild user interfaces with accessibility (a11y)\n\nTechnical Profile:\n\nMust have 4+ cumulative years of Front End experience in an enterprise environment\nDeep understanding of JavaScript, and React ecosystems\nDeep understanding of modern testing methodologies, tools and practices\nUnderstanding of security and performance considerations\nUnderstanding of cross browser issues and how to debug them\nUnderstanding of JSON / RESTful web services\nUnderstanding of architectural and design patterns\n\nOptional Skills:\n\nRange of experience across various other frontend technologies, including Node.js, AngularJS and Typescript\nExperience and working knowledge of relational and non-relational data stores advantageous\nExperience working with cloud technologies advantageous, especially AWS and Azure\n\nPersonal Profile:\n\nAbility to work independently as well as part of team\nAbility to learn new business areas quickly\nExcellent written and verbal English communication skills\nAbility to engage with stakeholders, and help them prototype their requirements\nTechnical degree or equivalent experience\nDesire to develop your own knowledge by keeping abreast of testing tools and techniques, attending workshops and reviewing technical publications\nCandidates who apply must be eligible to work in Ireland and Italy holding either EU Citizenship or appropriate visa"}
{"id": "1f8d3ca8ab827223", "title": "Senior Agile Web Developer", "company": "Adroitpeople", "location": "Carlow, County Carlow", "description": "Job Description\n\n\nWe are looking for a full-stack Agile Web developer with experience leading small development teams in a Scrum / Kanban environment, using a continuous integration and continuous delivery (CI/CD) pipeline.\n\nWhat do you need to bring to the table?\n\nSolid Microsoft (ASP.NET, C#, SQL Server) experience\nStrong knowledge of API development\nPlenty of demonstrable experience building interactive experiences using JavaScript, CSS3, HTML5, or similar\nA guru in the use of JavaScript frameworks and libraries (jQuery, Angular, bootstrap)\nUnderstanding of UX / UI principles, responsive design, think mobile first\nSource control – we use GitHub, but we’re OK if that’s not what you’re used to\nAgile methodology experience (Scrum, Kanban, XP etc.)\n\n\nThis role will be accountable for:\n\nDesign the architecture of the components of an application\nDeveloping and delivering business applications, API’s, platforms, portals and mobile applications\nWriting code in one or more programming or scripting languages, JavaScript, CSS3, HTML5, or similar\nSupport of .NET/C#, SQL Server development\nUtilizing JavaScript frameworks and libraries (jQuery, Angular, bootstrap)\nMaintaining deployment schedules\nFollowing good development guidelines and maintaining proper Source control policies\nLearning and testing new technologies, frameworks and languages\nStaying up to date with new trends and advancements in web development\n\nQualifications\n\n\nGraduate"}
{"id": "9eeb621edbc302fe", "title": "Senior Full Stack Developer", "company": "SOULCHI", "location": "Remote", "description": "Position: Full Stack Developer\nLocation: Remote\nCategory: Full-time (40 hours)\nCompensation: Fair Market Value, Equity-Based Compensation Model Until Break-Even\n\nWelcome to the forefront of transformational change. At SOULCHI, we are driven by a vision that blends virtues-based leadership, conscious growth, and a commitment to the United Nations Sustainable Development Goals. As an equity-based startup team member, you're not just joining a team; you're embarking on a journey to shape a more harmonious and sustainable world. We believe that true progress stems from the fusion of innovation and values, and that's exactly what you'll find here – a dynamic environment where your talents will thrive, your ideas will flourish, and your impact will resonate far beyond. Join us in rewriting the narrative of leadership and making a lasting difference that echoes through generatio\n\nPosition: Senior Full Stack Developer\n\nRole Overview: Craft exceptional user experiences by building and connecting Flutter interfaces to AI-driven backend systems using Firebase and GCP. Drive innovation in a fast-paced, collaborative environment focused on wellness and accessibility.\n\nCore Responsibilities\n\nFull-Stack Development:\nBuild cross-platform apps with Flutter (Dart) for iOS, Android, and Web.\nDesign, develop, and maintain scalable backend APIs (REST/GraphQL) and cloud services.\nIntegrate Firebase (Auth, Firestore, Cloud Functions, FCM) and GCP (Cloud Run, Vertex AI) for real-time features.\nSystem Integration & Optimization:\nConnect third-party APIs, AI/ML services (e.g., Vertex AI), and multimedia data flows.\nOptimize app performance for low-bandwidth users and ensure seamless UX across devices.\nImplement Firebase Security Rules and manage real-time databases.\nCollaboration & Quality:\nPartner with designers to transform UX/UI mockups into functional, polished experiences.\nWrite clean, documented code following best practices; troubleshoot and debug issues.\nLead deployments to App Store and Google Play.\nQualifications / Technical Requirements:\n5+ years full-stack development, including 2+ years with Flutter and state management (Riverpod/Bloc).\nExpertise in Firebase (Firestore, Cloud Functions, Security Rules) and GCP services.\nBackend proficiency in Node.js/Python and API design (REST/GraphQL).\nExperience integrating AI/ML APIs (e.g., Vertex AI) and optimizing apps for diverse network conditions.\nStrong mobile UI/UX principles and cross-platform deployment (iOS/Android/Web).\nFluency in Git/GitLab and agile workflows.\n\n\nEquity-Based Compensation Opportunity:\n\nAs part of the SOULCHI team, you'll take part in our equity-based compensation model, aligning your success with the success of our business. After much research we have found the fairest equity model for a startup. We use the Slicing Pie model. First phase is equity-based only, which we are currently in. Equity calculations move dynamically based on your fair market rate and actual number of hours worked. In the second phase, which happens at the break-even point, the equity freezes at each member's current earned percentage and compensation switches to salary + benefits. Your equity percentage gets paid out annually as part of the profit sharing. This is more than a job; it's an opportunity to own a piece of the future.\n\nWe request you only apply for this position if you believe an equity-based model is the perfect fit for you. A more detailed explanation from the professor who created the model can be found on Youtube, 'Pie Slicer Equity Split Software' by Slicing Pie.\n\nWe understand the importance of work-life balance and recognize that each individual has unique scheduling needs. As such, we offer flexibility in working hours for the Full-Stack Developer role, with the opportunity to work anywhere between 15 to 40 hours per week, depending on the candidate's availability and suitability for the role.\n\nThank you for considering SOULCHI.\n\nHow to Apply: To apply, please submit your resume and a cover letter detailing your alignment with our mission and the value you can bring to our team. Join our passionate team and be part of a transformative journey to spread virtues, create social impact, and contribute to a more loving and peaceful world. Together, we can harness the power of technology to bring the truth of oneness to the center of societies worldwide."}
{"id": "9698b57e7164152f", "title": "PHP Developer - Core Platform Team", "company": "Experlogix", "location": "Drogheda, County Louth•Hybrid work", "description": "PHP Developer – Core Platform Team – Digital Commerce (Hybrid)\n\n\nReady to level up your PHP career? Build, innovate, and make an impact!\n\n\nExperlogix is looking for an experienced, passionate, and self-driven PHP Developer to join our Digital Commerce team based in Drogheda, Ireland. Bring your expertise, build impactful solutions, and help deliver maximum value to our products and customers. Join us and help shape the future of digital commerce!\n\n\nOur global team is growing alongside the increasing demand for B2B eCommerce. This is a fast-moving, complex, and constantly evolving space where our products make a significant impact—helping customers succeed in a multi-channel digital world.\n\n\nAs a member of the Core Platform Engineering Team, you will work in an agile environment and report to the Director of Engineering for Digital Commerce. You’ll be at the forefront of developing new features across our suite of B2B eCommerce products, creating solutions that truly delight our customers. By collaborating closely with cross-functional teams, including development, product, and QA, you will play a key role in delivering robust, high-quality platform enhancements.\n\n\nWe are looking for someone with strong customer empathy and a solid understanding of software design and development, capable of delivering solutions that meet product needs. Collaboration is central to this role—you’ll thrive on understanding the business value behind solutions and continuously improving everything we do.\n\n\nKey Responsibilities\n\nDesign, build, and maintain backend components of our PHP-based e-commerce platform\nWork with our in-house framework, following established coding standards and conventions\nImplement integrations with third-party systems (ERPs, payment gateways, APIs, etc.)\nDevelop and maintain frontend functionality using Twig and PHP (and occasionally React)\nContribute to our React-based administrative application (basic React familiarity is sufficient; full training provided)\nWrite and maintain automated tests using Codeception (PHP unit/functional tests) and Cypress (end-to-end UI tests)\nParticipate in code reviews, technical planning, and sprint ceremonies\nDiagnose, debug, and resolve performance or scalability issues in production\nWork with GitHub-based CI/CD pipelines for automated testing and AWS deployment\nCollaborate with the Product, Customer Engineering and Support teams to deliver maintainable, high-quality code\n\n\n\nRequired Skills, Experience & Education\n\nStrong solution design skills, preferably in a SaaS based product development role.\nExcellent collaboration and communication skills, both with internal and external stakeholders.\nPro-active mindset, with a strong sense of ownership and accountability over the team's delivery.\nKnowledge and experience of e-commerce solutions and/or ERP integrations.\nProficient in speaking and written English.\nAgile / Scrum experience with a passion for process improvement.\nKnowledge of containerization (Docker) or task scheduling (e.g., cron, queues)\n\nExperience writing tests with Codeception or PHPUnit.\n\nDegree In Computer Science related field is desirable but not essential.\n\n\n\nDesirable skills\n\nExperience or understanding of React (hooks, functional components, context).\nFamiliarity with Cypress for end-to-end UI testing.\nExperience working in AWS environments (EC2, RDS, S3, CloudWatch, etc.).\nExposure to B2B or e-commerce systems.\n\n\n\nWhat you'll get\n\nGenerous annual leave entitlement that grows with tenure\nHealth Insurance\nCompany Sick Pay\nFlexible Hybrid working\nModern office close to shops, amenities, and various transport options\nSocial events\nBe part of a global organisation and work with likeminded individuals"}
{"id": "064c1559dd1fadc2", "title": "Fullstack Engineer (Backend)", "company": "Entity Games", "location": "Dublin, County Dublin•Remote", "description": "Summary\n\nAbout Entity\n\nEntity is on a mission to bring console-quality games to players everywhere — instantly, on any device. Just as software, music and film moved from download and own to click and stream, we believe gaming is shifting from Download and Install to Click and Play Now.\n\nPowered by the latest web technologies and built on the open web, Entity is creating a new home for next-gen instant games. For players, a destination to discover and enjoy incredible new titles (think Steam or YouTube for games). For developers, the tools, publishing power, and access to a truly global audience across every connected device.\n\nFounded by industry veterans and entrepreneurs, and backed by leading investors, we’re assembling our core team. Joining Entity at this stage is a rare opportunity to help shape the future of gaming.\n\n\nAbout the role\n\nWe’re now seeking a Fullstack Engineer to shape the future of our web-based games platform. This role will be central to implementing high performance, reliable and cost-effective backend platform that not only showcases games but also delivers engaging community and social features. The goal is to design an immersive “Games HUB” where players want to spend time, engage deeply, share their experiences and invite their friends to play with them.\n\n\nKey Responsibilities:\n\nCollaborate with a cross-functional team to design, develop, and maintain backend services in Go and frontend features using modern web frameworks (e.g., Vue.js, Angular, HTMX, Svelte).\nChoose the right frameworks, tools and out-of-the-box solutions to balance short term objectives with long term sustainability.\nImplement real-time communication features using WebSockets and optimize performance for interactive web games and social features.\nWork with WebGL basics and rendering pipelines to support game client integrations.\nDesign and build scalable APIs and services to support gameplay, LiveOps tools, and player-facing web features.\nInspect and optimize the performance of services, including latency, throughput, and bandwidth usage, to ensure smooth real-time experiences.\nContribute to platform resilience by analyzing player interactions, preventing exploits (cheating, botting), and hardening systems against bad actors.\nDeploy, monitor, and manage applications in a cloud environment (AWS + Github), leveraging CDNs and CI/CD pipelines for efficient content delivery.\nWork closely with QA to resolve bugs and deliver high-quality, tested, maintainable code.\nStay up to date with industry trends in Go, modern web frameworks, WebSockets, WebGL, CDN technologies, cloud services, and online gaming infrastructure.\n\n\n\nRequired Qualifications:\n\n5+ years of experience as part of a professional software development team building scalable systems.\nHands-on expertise with Go and its ecosystem.\nFamiliarity with modern web frameworks (Vue.js, Angular, Svelte, or similar) and TypeScript/JavaScript.\nUnderstanding of real-time web communication (WebSockets) and basics of WebGL rendering.\nExperience with the design and implementation of scalable, reliable, and secure APIs.\nExperience with AWS services (EC2, ECS, S3, CloudFront, RDS, IAM).\nProficiency with databases (MySQL/Postgres, Redis, DynamoDB) and caching strategies.\nPractical knowledge of Linux, Docker containers, and deploying applications in cloud environments.\nFamiliarity with CI/CD pipelines, automated testing, and version control in multi-branch environments.\nAwareness of game server security concerns such as preventing intrusions, injections, and cheating.\n\n\n\nBonus Points:\n\nUnderstanding of CDN strategies for efficient game asset and content delivery.\nFamiliarity with Terraform or other Infrastructure-as-Code tools.\nKnowledge of networking concepts such as load balancing, VPCs, and traffic routing for high-scale systems.\nExposure to traffic analysis tools (browser dev tools, CloudWatch, Datadog, Kibana, Postman, Charles Proxy, etc.).\nExperience with stateless and stateful game server architectures.\n\n\n\nRemote Working Conditions:\n\nThis is a remote-first position, allowing employees to work from anywhere with a reliable internet connection, a suitable home-working setup and within +/- 3 hours GMT timezone. We place a strong emphasis on individual responsibility to manage time and work, enabling employees to accommodate their personal life requirements.\n\nOccasional travel may be required for team meetings, industry events, or visits to game development studios. Some flexibility in working hours may be necessary to accommodate meetings with international partners or developers in different time zones."}
{"id": "7b4518634cf62907", "title": "Senior Backend Engineer, PHP/Go - 100% Remote - EMEA", "company": "Hostaway", "location": "Dublin, County Dublin•Remote", "description": "NOTE: This is a FULLY remote role, but the candidate must be within EMEA to collaborate with their team, peers, and internal customers. You do not have to be in the specific city shown in this listing, but please only apply if you are physically based within EMEA.\n\nHostaway is the market-leading SaaS scale-up transforming the vacation rental industry. With innovative solutions and partnerships with giants like Airbnb, VRBO, and Booking, we're taking on the competition and winning. Leveraging our customer-centric core values, we consistently deliver results that encourage growth, learning, and innovation for our team, our customers, and the industry.\n\nProfitable, high-growth, and the first short-term rental Property Management System unicorn . Join us at our most exciting stage yet! Learn more about our recent valuation and story here.\n\nAbout the role:\n\nHostaway is seeking a highly motivated Senior Backend Engineer to join the Core team. This team is responsible for the integrations with our key partners (Online Travel Agencies). These integrations are critical to our customers’ daily workflows, powering seamless connectivity between their properties and major booking platforms. If you’ve worked on similar tools that handle huge volumes and interact with a variety of complex APIs, you’ll be a great fit!\n\nCollaboration with the Product Manager is essential. While the Product Manager defines the 'what', you are responsible for the 'how'—translating business requirements into effective technical solutions. By deeply understanding the problems our users face, you help shape the technical direction and ensure our backend services deliver maximum value.\n\nYou’ll be supported by an Engineering Manager, who will help coordinate the team’s day-to-day work, maintain a sustainable delivery pace, and ensure the team is set up for success. Together, you’ll break down complex projects into manageable tasks and drive continuous improvement in our engineering practices.\n\n\n6+ years of experience in SaaS software development\n\nStrong-level proficiency in any backend language or platform, with a strong willingness to dive deep into PHP + Go, as these are the primary languages we use in this domain\n\nExperience in designing and developing RESTful web APIs\n\nFamiliarity with transitioning event-driven service-oriented architectures by applying Domain Driven Design (DDD) principles\n\nExperience in writing Unit Tests and Integration Tests\n\nExperience working in a Cloud environment (AWS is a plus)\n\nExperience with message queues (e.g., AWS SQS) is a plus\n\nEnglish language level C1\n\nWhat we offer:\n\nCompetitive Compensation: We offer competitive pay based on market rates in the country of the applicant.\n\n100% Remote: Enjoy the freedom to work from anywhere within your country of residence—be it a co-working space, your home office, or even your dining room table. The choice is yours. Just don’t ask to work in our office (we don’t have one).\n\nEquity: Every role in our company comes with valuable stock options in a fast-growing and profitable company. This ensures we all share in the company’s success.\n\nValues-Driven Leadership: Our Core Values are not just words we’ve written to make us feel good. We leverage them daily when making strategic and tactical decisions.\n\nProfessional Growth: Our rapid growth offers unparalleled learning and development opportunities, along with a multitude of career advancement opportunities.\n\nAnnual Paid Leave: The specific amounts vary by country and are aligned with country and/or contract-specific norms.\n\nGeographic Specific Benefits: As an international employer, we offer different country-specific benefits such as Health Insurance and Pensions in countries where these perks are customary. The specifics depend on the country of the applicant.\n\nDynamic Team Culture: As a global company with team members in over 40 countries, our diverse and international culture fuels our innovation and creativity, providing a key pillar to our success (and making it a lot of fun to work here).\n\nThank you for your interest. If you apply for this role, you will receive an email from our Talent Acquisition team after your application has been reviewed alongside the qualifications for this role and the qualifications of others who have applied."}
{"id": "48ad5a094fd28f03", "title": "Graduate/Junior Full Stack Developer", "company": "Ashgrove Renewables", "location": "Cork, County Cork", "description": "Role: Full Stack Developer I – (Graduate/Junior)\n\nLocation: Mallow, Co. Cork\nEmployment Type: Full-Time, On-site\n\nAshgrove is seeking a motivated graduate/Junior Full Stack Developer to join our fast-growing Mallow based team.\n\nThis role provides the opportunity to contribute across the full software development lifecycle, delivering scalable backend services and modern front-end applications while supporting continuous improvement initiatives across the business.\n\n\nContribute across the full project lifecycle, including requirements analysis, solution design, development, testing, deployment, and ongoing support.\n\nDevelop, design & create backend services and modern web-based front-end applications\n\nIdentify opportunities for automation and process improvement and implement scalable technical solutions.\n\nParticipate in architecture discussions, technical evaluations, and technology selection.\n\nActively collaborate in the strategic goals of the CI department,\nAssist in maininting existing applications & providing IT assistance to fellow employees,\nCollaborate with department heads to define and measure KPIs and KQIs aligned to business objectives.\n\nLiaise with Zoho support on complex integrations and enhancements.\n\nAssist in the development and deployment of non-software based process improvement,\n\nRequirements\n\nTechnical Skills & Experience\n\n\n\nStrong ability to analyse requirements, explore alternatives, and derive effective technical solutions to complex problems.\n\nProven experience in full stack development, with strong hands-on expertise in Node.js, Next.js, and PostgreSQL and other latest scripting languages. Experience with additional frameworks, languages, or databases is highly advantageous.\n\nExperience designing and consuming RESTful APIs, with a strong understanding of business process automation and system integration.\n\nFamiliarity with CI/CD pipelines, version control systems, and automated deployment practices.\n\nSolid understanding of software architecture, data modelling, scalability, and system maintainability.\n\nAshgrove uses the Zoho One platform. Experience with Deluge is not required; however, a strong foundation in general programming principles is essential to enable efficient review and adaptation of existing code.\n\n\nCore Competencies\n\n\n\nStrong written and verbal communication skills with the ability to work effectively in a collaborative team environment.\n\nExcellent analytical and problem-solving capability with a methodical approach to task execution.\n\nHigh level of initiative, curiosity, and willingness to continuously learn and develop technical expertise.\n\nAbility to independently research, evaluate, and implement viable solutions.\n\nStrong attention to quality, documentation, and delivery standards.\n\nBenefits\nCompetitive salary commensurate with experience\n\nCompany Pension\n\nFlexible working hours\n\nPerformance-related bonus\n\nBike to Work scheme\n\nOnsite parking\n\nEmployee Discounts\n\nCompany Paid Leave\n\nFurther educational support, training and development opportunities\n\nSports and Social events and activities"}
{"id": "ababd0774e099037", "title": "Software Developer Intern", "company": "yieldHUB", "location": "DUBLIN 24, County Dublin", "description": "Company Information and Introduction:\n\n\nyieldHUB is a global leader in semiconductor yield management solutions. We use advanced data analytics and AI to help the world’s top semiconductor companies optimize processes, reduce waste, and increase engineering efficiency.\n\nAt yieldHUB, you’ll find a young, diverse, and collaborative team that thrives on innovation and solving complex challenges. With employees across Ireland, the UK, USA, and Asia, we are global from the start and proud of our excellent workplace culture.\n\nThe Role\n\nKick-start your career in software development with hands-on projects, global collaboration, and mentorship from industry experts. As a Full Stack Software Development Intern at our Limerick R&D hub, you won’t just shadow others - you’ll take ownership of meaningful projects that directly contribute to yieldHUB’s success.\n\nYou’ll gain exposure to both front-end and back-end development, cutting-edge AI and analytics technologies, work closely with our international team, and even collaborate directly with customers to help solve their real-world challenges. Throughout your placement, you’ll be supported by a dedicated mentor to ensure your growth and development.\n\nThis role is hybrid, combining on-site collaboration with the flexibility of remote work.\n\n\nKey Responsibilities and Duties:\n\n\n\nDevelop, test, and maintain user-facing features in yieldHUB’s web applications.\n\nTranslate UI/UX design wireframes into responsive, high-quality code.\n\nWork with databases to store, retrieve, and process large volumes of semiconductor data.\n\nCollaborate with designers, product managers, data scientists, and experienced software developers to deliver seamless solutions.\n\nOptimize applications for maximum speed, performance, and scalability.\n\nDebug and resolve issues to ensure a smooth user experience.\n\nContribute to agile development processes, including code reviews and sprint planning.\n\nCollaborate effectively with colleagues and customers across different time zones (Ireland, UK, USA, and Asia).\n\n\nKey Skills and Competencies:\n\n\nCurrently enrolled in a Bachelor’s or Master’s program in Computer Science, Software Engineering, or a related field.\n\nStrong interest in full stack development and modern web technologies.\n\nProficiency in HTML, CSS, and JavaScript.\n\nFamiliarity with frameworks such as React, Angular, 3.js or Vue.js.\n\nUnderstanding of responsive design and cross-browser compatibility.\n\nProficiency in at least one programming language such as PHP, Python, C, C++, Java, or C#.\n\nStrong problem-solving and communication skills.\n\nTeam player with curiosity and a willingness to learn."}
{"id": "ea41f74c5c13a34e", "title": "Full Stack Developer", "company": "Version 1", "location": "Dublin, County Dublin•Hybrid work", "description": "Company Description\n\n\nVersion 1 has celebrated over 29 years in Technology Services and continues to be trusted by global brands to deliver solutions that drive customer success. Our expertise enables our customers to navigate the rapidly changing Digital-First world we live in. We foster strong partnerships with leading technology giants including Microsoft, AWS, Oracle, Red Hat, OutSystems, Snowflake, ensuring that our customers are provided with the highest quality solutions and services.\n\nWe’re an award-winning employer reflecting how our employees are at the very heart of Version 1 and what we do:\n\nUK & Ireland's premier AWS, Microsoft & Oracle partner\n3300+ strong, €350/£300m revenue business\n10+ years as a Great Place to Work in Ireland & UK\nBest Workplace for Women in the UK & Ireland by GPTW\nBest Workplace for Wellbeing in the UK by GPTW\n\nWe’re a core values driven company, we hire people who share our values, and we reward those who display and foster them, it’s deeply embedded within our DNA. Invest in us and we’ll invest in you!\n\n\nJob Description\n\n\nWe are seeking a Full Stack Developer to design, build, and deploy AI-powered solutions that support digital transformation across enterprise environments. You will work on full-stack applications integrating GenAI features, collaborating with cross-functional teams to operationalize AI models and deliver scalable, secure, and user-friendly solutions.\n\nResponsibilities\n\nDevelop responsive UIs and scalable APIs integrated with cloud services and databases.\nBuild and maintain full-stack applications using modern frameworks and cloud-native practices.\nCollaborate with data scientists, UX designers, and MLOps engineers to deliver end-to-end AI solutions.\nLead implementation of architectural components including REST APIs, microservices, and authentication flows.\nEnsure code quality through automated testing, CI/CD pipelines, and performance optimization.\nDocument design decisions and support internal teams through knowledge sharing.\n\nQualifications\n\n7+ years experience in Applications Development Lifecycle\nProficiency in JavaScript frameworks (React, Angular) and backend technologies (Node.js, .NET, Python).\nStrong experience with Microsoft Azure and cloud-native development.\nSolid understanding of REST APIs, OAuth 2.0, OpenID Connect, and claims-based authentication.\nExperience with CI/CD, automated testing, and DevOps tools (Azure DevOps, Git, PowerShell).\nFamiliarity with ASP.Net MVC, C#, HTML5, CSS3, and responsive design principles.\nKnowledge of Agile methodologies and experience working in Scrum teams.\nExcellent communication skills in English (oral and written).\n\nAdditional Information\n\n\nWhy Version 1?\n\nAt Version 1, we believe in providing our employees with a comprehensive benefits package that prioritises their wellbeing, professional growth, and financial stability.\n\nShare in our success with our Quarterly Performance-Related Profit Share Scheme, where employees collectively benefit from a share of our company's profits.\nStrong Career Progression & mentorship coaching through our Strength in Balance & Leadership schemes with a dedicated quarterly Pathways Career Development programme.\nFlexible/remote working, Version 1 is tremendously understanding of life events and people’s individual circumstances and offer flexibility to help achieve a healthy work life balance.\nFinancial Wellbeing initiatives including; Pension, Private Healthcare Cover, Life Assurance, Financial advice and an Employee Discount scheme.\nEmployee Wellbeing schemes including Gym Discounts, Bike to Work, Fitness classes, Mindfulness Workshops, Employee Assistance Programme and much more. Generous holiday allowance, enhanced maternity/paternity leave, marriage/civil partnership leave and special leave policies.\nEducational assistance, incentivised certifications, and accreditations, including AWS, Microsoft, Oracle, and Red Hat.\nReward schemes including Version 1’s Annual Excellence Awards & ‘Call-Out’ platform.\nEnvironment, Social and Community First initiatives allow you to get involved in local fundraising and development opportunities as part of fostering our diversity, inclusion and belonging schemes.\n\nAnd many more exciting benefits… drop us a note to find out more.\n\nEkta Bahl - Talent Acquisition Capability Partner\n\n#LI-EB1"}
{"id": "d604de41e53572f7", "title": "iOS Mobile Lead Engineer", "company": "Kitman Labs", "location": "Dublin, County Dublin•Hybrid work", "description": "Dublin, Ireland\nEngineering – Mobile /\nFull-time /\nRemote\nKitman Labs is the performance intelligence company, disrupting and transforming the way the sports industry uses data to unlock the potential of the world’s top athletes.\n\nDriven by a passion to innovate in the areas of sports performance, analytics and user experience, we have assembled a team of the industry’s top data scientists, sports performance scientists, product and software designers and engineers.\n\nKitman Labs’ advanced operating system, the Intelligence Platform (iP) is now used by over 2000 teams in 50 leagues on 6 continents, including the NFL, Premier League, National Women’s Soccer League and MLS.\n\nBuild Next-Gen Sports Tech Apps!\n\nWe’re on the lookout for passionate iOS developers to join our Mobile Team within our growing Product Engineering group. This team is at the heart of creating cutting-edge tools that empower athletes and coaches worldwide to make data-driven decisions. Our mobile apps are crafted primarily with Swift and SwiftUI, with some Objective-C for legacy support. We embrace a culture of continuous learning, collaboration, and innovation, making this the perfect opportunity for engineers looking to grow and make a real impact.\nWhat you'll be doing:\nWrite scalable and well-tested code – You’ll design and implement robust solutions that ensure system scalability and high availability.\nOwn the mobile journey – Take end-to-end responsibility for our iOS applications, ensuring they remain robust, performant, and aligned with our high engineering standards.\nExpand our global footprint – Lead the charge in localised deployments, facilitating seamless app releases across new regions to bring our platform to a worldwide audience.\nBuild from the ground up – Architect and deliver new end-to-end features, bridging the gap between complex backend logic and a refined user interface.\nEmpower and mentor talent – Manage a team of high-performing engineers, providing technical guidance and career coaching to foster a culture of excellence and continuous growth.\nBridge the gap between vision and execution – Partner closely with Product and Engineering Managers to scope, estimate, and roadmap work, ensuring technical feasibility and timely delivery of our product goals.\nModernise and refactor – Champion the health of our codebase by identifying legacy bottlenecks and migrating toward modern iOS patterns like SwiftUI, Combine, or Swift Concurrency.\nDefine the mobile standard – Collaborate with Android and Web leads to ensure architectural consistency and shared best practices across our entire engineering organisation.\nGuard the app’s vitals – Oversee app performance, crash rates, and battery usage, ensuring that our high-performance sports insights never come at the cost of device stability.\nCultivate an \"App Store Ready\" culture – Manage the intricacies of the App Store Connect ecosystem, from certificates and provisioning to navigating Apple’s evolving privacy and submission guidelines.\nWhat we're look for:\nLeadership & Strategy\nProven technical leadership – A track record of guiding iOS teams and mentoring engineers, balancing high-level architectural decisions with hands-on development and people growth.\nStrategic planning and execution – Experience partnering with Product and Engineering Managers to translate roadmaps into actionable milestones with reliable estimation and scoping.\nA product-oriented mindset – Strong collaboration skills with Design and Product teams to ensure technical implementation always serves the user experience and business goals.\nTechnical Mastery\nMastery of the iOS ecosystem – Deep expertise in Swift and SwiftUI, with a sophisticated understanding of mobile performance, state management, and modern concurrency.\nArchitectural vision – Success in designing modular, scalable, and testable app architectures that remain maintainable as the team and codebase grow.\nAdvanced automation and infrastructure – Experience designing and optimising CI/CD pipelines (e.g., Fastlane, CircleCI) to streamline deployment workflows and ensure release stability.\nQuality & Problem Solving\nCommitment to engineering excellence – A high bar for quality, with experience implementing comprehensive testing strategies and establishing coding standards that elevate the entire team.\nNavigating technical complexity – Extensive experience integrating real-time data via REST or GraphQL and managing the nuances of multi-region app deployments and localised content.\nAnalytical and decisive problem-solving – An ability to deconstruct complex technical challenges into elegant, robust solutions while considering long-term system health.\nBonus skills (nice to have!):\nCross-platform exposure – Familiarity with Kotlin Multiplatform (KMP), helping to bridge the gap between our iOS and Android engineering strategies.\nApp Store Ecosystem navigation – Deep knowledge of App Store Connect, including managing complex provisioning profiles, App Store localised metadata, and navigating Apple’s review guidelines.\nWhy join us?\nWork on high-impact products used by athletes and coaches worldwide.\nBe part of an innovative, fast-moving team with a focus on automation and continuous delivery.\nHybrid/remote work flexibility, with a collaborative and supportive team culture.\nDirect influence on technical decisions and product roadmap.\nBenefits\nAt Kitman Labs we pride ourselves on being the best and working with the best, so it should be no surprise that we are also dedicated to keeping the best through building a world-class work culture.\nWe truly believe that a successful company begins through having an outstanding and inspiring culture, so our benefits reflect this:\n\nCompetitive salary\nMeaningful equity\nPension Plan\nFully paid health insurance for employee & dependants\nLife Assurance\nWellness Perk\nFlexible workplace with options for office-based, hybrid and remote working\n\nLocation\nWhilst remote, you can work from our Dublin office, which is located in the impressive CHQ Building, a 2 minute walk from Connolly train station, and very close to all major bus routes and both Luas lines. We're also on the doorstep of many shops, restaurants, bars & cafes.\n\nDiversity\nIn addition to building a team with diverse skill-sets, Kitman Labs is committed to hiring people with diverse backgrounds. We do not discriminate based on age, civil or family status, disability, ethnicity, gender, race, religion, or sexual orientation. If you are a person with a disability and require assistance during the application process, please let us know.\n\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analysing CVs/resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us."}
{"id": "faa2d9bc2f108e56", "title": "Senior Full Stack Developer (.NET + Angular)", "company": "EX Squared LATAM", "location": "Remote", "description": "Senior Full Stack Developer (.NET + Angular)\n\nAt EX Squared LATAM, we partner with leading engineering organizations to build scalable, high-impact digital products. We are looking for a Senior Full Stack Developer with strong experience in .NET Core, C#, and Angular, capable of leading technical decisions, evolving architectures, and supporting teams in complex, high-demand environments.\n\nThis role is ideal for a senior engineer with a full-stack mindset, solid backend foundations, frontend proficiency, and the ability to lead technically while staying hands-on.\n\nWhat You Will Do\n\nDesign, develop, and maintain full-stack solutions using .NET Core, C#, Angular, and SQL Server.\n\nBuild and consume RESTful APIs, ensuring scalability, performance, and maintainability.\n\nContribute to the design and evolution of microservices-based architectures.\n\nActively participate in technical design, planning, estimation, and delivery tracking.\n\nLead technically development teams or cells, guiding architectural and implementation decisions.\n\nSupport teams working in high-demand contexts, including environments with significant technical debt.\n\nDrive the evolution of legacy systems while contributing to new architectural initiatives.\n\nApply and promote design patterns, clean code practices, and software engineering best practices.\n\nCollaborate closely with product, QA, and other engineering stakeholders in Agile (Scrum) environments.\n\nParticipate in code reviews, technical discussions, and continuous improvement initiatives.\n\nWhat You Will Bring\n\n7+ years of experience as a Software Engineer, with a strong Full Stack focus.\n\nSolid hands-on experience with: .NET Core and C#, Angular 11, and SQL Server (advanced level)\n\nProven experience designing and consuming REST APIs.\n\nStrong understanding of microservices architecture.\n\nHands-on experience with Docker and containerized environments.\n\nSolid knowledge of software design patterns and clean architecture principles.\n\nExperience working under Agile methodologies (Scrum).\n\nIntermediate English level for technical communication.\n\nDemonstrated technical leadership, mentorship, and guidance of development teams.\n\nExperience modernizing or refactoring legacy systems.\n\nExposure to CI/CD pipelines and DevOps practices.\n\nExperience working in enterprise-scale or high-traffic systems.\n\nFamiliarity with cloud environments (AWS, Azure, or equivalent).\n\nWhy Join EX Squared?\n\nA strong engineering culture focused on technical excellence, ownership, and continuous improvement.\n\nOpportunities to lead and influence architecture and technical direction.\n\nCollaboration with senior engineers across LATAM on impactful systems for U.S. clients.\n\nA balance between hands-on development and technical leadership.\n\nWhat We Offer\n\nCompetitive compensation in USD aligned with senior-level experience.\n\n100% remote work from anywhere in Latin America.\n\nOpportunities to work on complex architectures, legacy modernization, and new systems.\n\nContinuous learning, technical growth, and leadership development opportunities.\n\nA collaborative and inclusive environment where your technical impact truly matters."}
{"id": "458c37b0ef0cac72", "title": "Front End Engineer", "company": "f5", "location": "Dublin, County Dublin", "description": "At F5, we strive to bring a better digital world to life. Our teams empower organizations across the globe to create, secure, and run applications that enhance how we experience our evolving digital world. We are passionate about cybersecurity, from protecting consumers from fraud to enabling companies to focus on innovation.\n\nEverything we do centers around people. That means we obsess over how to make the lives of our customers, and their customers, better. And it means we prioritize a diverse F5 community where each individual can thrive.\nRole Summary:\nAt F5, we are expanding our AI Security team and seeking a motivated and skilled Frontend Engineer to develop intuitive and efficient user interfaces for our AI-powered security web applications. In this critical role, you will collaborate with multidisciplinary teams to deliver high-quality and user-centric solutions.\nAs a Frontend Engineer, you will work with cutting-edge technologies to build modern, scalable, and performant web applications. You will contribute to the team by creating frontend components, improving application architecture, ensuring superior user experience, and advancing F5's technical solutions. If you're passionate about frontend engineering and eager to innovate, grow, and work with modern web technologies, F5’s AI Security team is the perfect environment for your career advancement.\n\nKey Responsibilities:\nFrontend Development\nBuild and maintain robust, efficient, and scalable web applications using TypeScript, JavaScript, CSS, and HTML.\nDevelop and optimize frontend components, ensuring performance, usability, and accessibility standards are met.\nCollaboration\nPartner with backend engineers, data scientists, UX designers, and product managers to deliver seamless user-centered features.\nFacilitate open and effective communication across teams to ensure alignment on development goals and requirements.\nArchitecture and Design\nDesign features and components that align with modern frontend architecture and design principles, including component-based systems and micro-frontend architecture.\nContribute to the development of design systems and reusable libraries to streamline frontend development processes.\nQuality and Performance\nDeliver high-quality UI elements with seamless functionality across devices and browsers.\nOptimize web applications for speed, scalability, and performance, focusing on reducing size and enhancing responsiveness.\nUser Focus and Feedback\nImplement feedback from end users and customers to enhance user experiences and achieve product goals.\nEmbrace a user-focused mindset to ensure solutions address real-world needs.\nContinuous Improvement\nStay updated on evolving frontend standards, tools, and technologies, and contribute innovative ideas for improving current processes.\nProactively suggest and implement solutions to challenges, fostering an environment of continuous growth and improvement.\n\nQualifications:\nRequired Skills and Experience:\nMinimum 3 years of experience as a Frontend Engineer or Frontend Developer.\nComprehensive knowledge of frontend architecture and design patterns.\nStrong expertise in the JavaScript language and ecosystem.\nWorking knowledge of CSS and CSS preprocessors such as Sass, SCSS, or Less.\nProficiency in modern JavaScript features (e.g., ES2015–ES2025).\nAbility to debug and optimize browser performance, troubleshoot compatibility issues, and ensure cross-platform functionality.\nHands-on experience with modern JavaScript view libraries, such as Vue.js, React, or Svelte.\nFamiliarity with popular frontend tools such as Webpack, Vite, and CSS Modules.\nPreferred Skills:\nExperience with Vue 3 and TypeScript.\nAdvanced knowledge of modern CSS features, including grid, flexbox, CSS variables, and animations.\nFamiliarity with mobile-first design, atomic design principles, and progressive enhancement for responsive applications.\nWorking knowledge of npm or Vite package managers, including publishing packages.\nUnderstanding of emerging browser APIs and modern web technologies.\nKnowledge of design tools such as Figma, Adobe XD, or Sketch for translating design concepts into functional interfaces.\n\nTeam and Technology Stack:\nAt F5’s AI Security team, we are strong believers in creating scalable and reusable solutions. As part of our team, you'll contribute to:\nComponent-based design and the development/maintenance of robust component libraries for reusable and modular functionality.\nA cutting-edge technology stack, including Vue 3, TypeScript, Socket.IO, Pinia (state management), Storybook (components), npm workspaces, and Vite (build tools).\nAdvancing micro-frontend architecture and leveraging in-house tools and libraries to supercharge day-to-day work.\n\nWhy Join F5’s AI Security Team:\nAt F5, we are committed to building innovative solutions that enhance system security and user experience. Joining our team means:\nWorking on industry-leading AI technologies in a fast-paced, collaborative environment.\nHaving the flexibility to innovate and grow as a Frontend Engineer, leveraging the latest web standards and technologies.\nGaining access to mentorship, resources, and opportunities to advance your skills and career.\nBuilding impactful solutions that address cutting-edge security and system challenges.\n\nWhat Success Looks Like:\nA successful Frontend Engineer at F5 demonstrates the following:\nTechnical excellence in designing and building performant, scalable, and user-centric web applications.\nProactive communication and collaboration to ensure alignment across technical and non-technical stakeholders.\nStrong ownership of problem-solving and initiative in introducing innovative solutions to challenges.\nContinuous learning and adaptability to stay ahead in the evolving landscape of frontend technologies.\n\n#LI-SS5\nThe Job Description is intended to be a general representation of the responsibilities and requirements of the job. However, the description may not be all-inclusive, and responsibilities and requirements are subject to change.\nPlease note that F5 only contacts candidates through F5 email address (ending with @f5.com) or auto email notification from Workday (ending with f5.com or @myworkday.com).\nEqual Employment Opportunity\nIt is the policy of F5 to provide equal employment opportunities to all employees and employment applicants without regard to unlawful considerations of race, religion, color, national origin, sex, sexual orientation, gender identity or expression, age, sensory, physical, or mental disability, marital status, veteran or military status, genetic information, or any other classification protected by applicable local, state, or federal laws. This policy applies to all aspects of employment, including, but not limited to, hiring, job assignment, compensation, promotion, benefits, training, discipline, and termination. F5 offers a variety of reasonable accommodations for candidates. Requesting an accommodation is completely voluntary. F5 will assess the need for accommodations in the application process separately from those that may be needed to perform the job. Request by contacting\naccommodations@f5.com\n."}
{"id": "f1af33b871876505", "title": "Web Developer Work Placement Student", "company": "Tricel", "location": "Killarney, County Kerry", "description": "Web Developer Work Placement Student\n\nTricel are currently recruiting a Web Developer work-placement student. This is an exciting opportunity for a college student to gain valuable hands on Web Developer experience in a multinational organisation while being financially supported.\nAre you eager to kick start your career in a dynamic and fast-growing industry? Look no further! The successful student will gain hands on experience in building websites. The successful candidate will report to the Marketing Delivery Project Manager during their placement.\n\n\nKey Responsibilities:\n\nWork on all web development projects across the European and Irish markets in which Tricel operate and will be working closely with our Design and Development team to build websites.\nTesting websites to ensure they fit our stake holder’s brief.\nOther ad hoc projects.\n\nCandidate Profile:\n\nWorking towards a Developer degree\nExcellent organisational and administrative skills with a strong commitment to teamwork.\nExcellent communication skills both written and verbal.\nExcellent MS Office applications.\nHighly motivated, capable of working on own initiative.\nExperience in WordPress/ Magento advantageous\n\nWhat do we offer?\nAt Tricel, we care about you and your progression. As well as a competitive salary and benefits package, we offer:\n\nExcellent development and growth opportunities\nA supportive and collaborative culture\nA fun and dynamic work environment\nTeam oriented atmosphere\nGood work life balance\nCompany Accommodation\nOpportunity to work across countries and cultures\nEmployee Assistance Programme\nHealth and Wellbeing initiatives\n\n\nTricel is a global manufacturing and engineering company, recognized for its innovative and high-quality products across various sectors. Founded in Ireland, this family run business has expanded its operations internationally, with a presence in multiple countries. The company specializes in producing advanced composite materials, environmental solutions, water storage systems, and electrical enclosures. Tricel's products are widely used in industries such as construction, water storage and wastewater treatment, and distribution.\nThe company's core strengths lie in its commitment to innovation, quality, and customer service. Tricel consistently invests in research and development to create products that meet the evolving needs of its customers while maintaining a focus on sustainability and environmental responsibility. With a skilled workforce and a strong engineering foundation, Tricel is dedicated to delivering reliable, durable, and cost- effective solutions that help build a better, more sustainable future.\n\nHow to apply:\nIf you are interested in applying for this exciting opportunity please email HR@tricel.ie today with your CV and cover letter. We look forward to hearing from you."}
{"id": "37657972e639f6b7", "title": "Senior Web Application Developer", "company": "Acuity Inc.", "location": "Cork, County Cork", "description": "Acuity Inc. (NYSE: AYI) is a market-leading industrial technology company. We use technology to solve problems in spaces, light and more things to come. Through our two business segments, Acuity Brands Lighting (ABL) and Acuity Intelligent Spaces (AIS), we design, manufacture, and bring to market products and services that make a valuable difference in people’s lives.\n\nWe achieve growth through the development of innovative new products and services, including lighting, lighting controls, building management solutions, and an audio, video and control platform. We focus on customer outcomes and drive growth and productivity to increase market share and deliver superior returns. We look to aggressively deploy capital to grow the business and to enter attractive new verticals.\n\nAcuity Inc. is based in Atlanta, Georgia, with operations across North America, Europe and Asia. The Company is powered by approximately 13,000 dedicated and talented associates. Visit us at www.acuityinc.com.\n\nJob Summary\n\nAre you a team player who loves diving into technology? Do you want to contribute to a team that strives to solve demanding problems and operates in a space directly involved in reducing the carbon footprint of buildings?\n\nJoin our team! We are looking for a Front-End developer who has an excellent technical foundation in front-end technology such as React and TypeScript.\n\nYou’ll be shaping the future by working on Facilities—our cloud and edge platform that powers three transformative modules: Organize to simplify deployment and maintenance workflows, Operate to deliver real-time building insights and seamless interaction, and Optimize to uncover inefficiencies and drive peak performance for truly intelligent spaces.\n\nKey Tasks & Responsibilities (Essential Functions)\nDevelop and maintain modern web applications using React and TypeScript/JavaScript.\nCollaborate with UX designers to deliver responsive, accessible, and user-friendly interfaces.\nIntegrate front-end applications with RESTful APIs and real-time data streams.\nEnsure code quality, performance, and security through best practices and automated testing.\nWork closely with back-end developers and cloud engineers to deliver end-to-end solutions.\nParticipate in agile ceremonies, contribute to team planning, and provide accurate estimates.\nContinuously improve the front-end architecture and development workflow.\nActively participate in exploration and research phases for product design.\nSkills and Minimum Experience Required\n5+ years of professional experience in web application development.\nStrong proficiency in React, TypeScript, and modern JavaScript (ES6+).\nExperience with state management (Redux, Context API, or similar).\nSolid understanding of HTML5, CSS3, and responsive design principles.\nFamiliarity with RESTful APIs and WebSockets for real-time data.\nExperience with front-end build tools (Webpack, Vite) and package managers (npm, yarn).\nKnowledge of unit and integration testing frameworks (Jest, React Testing Library).\nStrong problem-solving and analytical skills.\nExcellent communication and collaboration abilities.\nPassion for creating clean, maintainable, and scalable code.\nAbility to thrive in an agile, distributed team environment.\nGreat team spirit and excellent interpersonal skills\nAutonomy, leadership and initiative\nPreferred Skills and Experience\nExperience with progressive web apps (PWAs) and offline-first strategies.\nExposure to CI/CD pipelines and DevOps practices for front-end deployments.\nUnderstanding of cloud environments (Azure preferred) and edge computing concepts.\nKnowledge of IoT data visualization and real-time dashboards.\nExperience with cloud security best practices, identity management (OAuth2, OpenID Connect), and data encryption.\nExperience with performance tuning for large-scale SaaS platforms.\nCreativity in user interface development\n\nWe value diversity and are an equal opportunity employer. All qualified applicants will be considered for employment without regards to race, color, age, gender, sexual orientation, gender identity and expression, ethnicity or national origin, disability, pregnancy, religion, covered veteran status, protected genetic information, or any other characteristic protected by law.\n\n\nAccommodation for Applicants with Disabilities: As an equal opportunity employer, Acuity Inc. is committed to providing reasonable accommodations in its application process for qualified individuals with disabilities and disabled veterans. If you have difficulty using our online system due to a disability and need an accommodation, you may contact us at (770) 922-9000, select option 4. Please clearly indicate what type of accommodation you are requesting and for what requisition.\n\n\nAny unsolicited resumes sent to Acuity Inc. from a third party, such as an Agency recruiter, including unsolicited resumes sent to an Acuity Inc. mailing address, fax machine or email address, directly to Acuity Inc. employees, or to Acuity Inc. resume database will be considered Acuity Inc. property. Acuity Inc. will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.\n\n\nAcuity Inc. will consider any candidate for whom an Agency has submitted an unsolicited resume to have been referred by the Agency free of any charges or fees. This includes any Agency that is an approved/engaged vendor, but does not have the appropriate approvals to be engaged on a search.\n\n\nE-Verify Participation Poster\n\ne-verify.gov\n\neeoc.gov"}
{"id": "fba4055a4994be1d", "title": "Full-Stack Software Developer (Drupal / React)", "company": "Charles River Laboratories", "location": "County Cork", "description": "At Charles River, we are passionate about improving the quality of people’s lives. When you join our global family, you will help create healthier lives for millions of patients and their families.\n\n\nCharles River employees are innovative thinkers, who are dedicated to continuous learning and improvement. We will empower you with the resources you need to grow and develop in your career.\n\n\nAs a Charles River employee, you will be part of an industry-leading, customer-focused company at the forefront of drug development. Your skills will play a key role in bringing life-saving therapies to market faster through simpler, quicker, and more digitalized processes. Whether you are in lab operations, finance, IT, sales, or another area, when you work at Charles River, you will be the difference every day for patients across the globe.\n\n\nJob Summary\n\n\nContribute to the build and maintenance of high-performance, decoupled web applications that pair Drupal back-ends with React front-ends. Working alongside cross-functional teams, you will help deliver secure, scalable solutions while actively working with established CI/CD processes and containerised environments to ensure steady code delivery. In this role, you will follow standardised workflows to maintain quality and ensure alignment with necessary regulatory requirements.\n\n\nEssential duties and responsibilities:\n\n\nAssist in the design and development of Drupal-based sites and React-based user interfaces\n\nImplement and improve GitHub Actions pipelines and broader CI/CD automation\n\nConfigure and optimise containerised, high-scale environments (Docker / Kubernetes)\n\nWrite and maintain unit, integration, and end-to-end tests\n\nParticipate in backlog grooming, sprint planning, and other ceremonies\n\nConduct peer code reviews and provide constructive feedback\n\nFollow SOX, SOP, GLP, GMP and related standards\n\nProduce clean, well-documented, efficient code\n\nLeverage approved AI tools to streamline daily development tasks\n\n\nMust-Have Qualifications:\n\n\nBachelor's degree (B.A ./ B.Sc) or equivalent in Computer Science, Engineering, Information Systems, or a related discipline\n\nExtensive development experience in web development with technologies like PHP and React\n\n\nDrupal Expertise\n\nKnowledge of Drupal 10+\n\nProficient with decoupled architectures (JSON:API)\n\nStrong PHP (modern OOP, Dependency Injection, SOLID principles)\n\n\nReact Expertise\n\nFamiliar with React, NextJS and Jest best practices\n\nNice to have:\n\nChakra UI experience\n\nUnderstanding of React components lifecycle: mounting, evolving, unmounting\n\n\nSoftware Delivery and Automation\n\nExperience managing automated workflows within GitHub to streamline code integration and deployment\n\nProficiency in Docker / Kubernetes to ensure consistency across local, staging, and production environments\n\nPractical understanding of the Software Development Lifecycle (SDLC)\n\n\nSoft Skills\n\nClear written & verbal communication\n\nAble to explain technical decisions and trade-offs succinctly\n\n\nWhat We Offer:\n\n\nCharles River offers a competitive benefits package, including a generous company pension scheme, private healthcare, dental coverage, performance bonuses, and access to employee discount programs - plus much more!\n\n\nAbout Corporate Functions\nThe Corporate Functions provide operational support across Charles River in areas such as Human Resources, Finance, IT, Legal, Sales, Quality Assurance, Marketing, and Corporate Development. They partner with their colleagues across the company to develop and drive strategies and to set global standards. The functions are essential to providing a bridge between strategic vision and operational readiness, to ensure ongoing functional innovation and capability improvement.\n\n\nAbout Charles River\nCharles River is an early-stage contract research organization (CRO). We have built upon our foundation of laboratory animal medicine and science to develop a diverse portfolio of discovery and safety assessment services, both Good Laboratory Practice (GLP) and non-GLP, to support clients from target identification through preclinical development. Charles River also provides a suite of products and services to support our clients’ clinical laboratory testing needs and manufacturing activities. Utilizing this broad portfolio of products and services enables our clients to create a more flexible drug development model, which reduces their costs, enhances their productivity and effectiveness to increase speed to market.\n\n\nWith over 20,000 employees within 110 facilities in 20 countries around the globe, we are strategically positioned to coordinate worldwide resources and apply multidisciplinary perspectives in resolving our client’s unique challenges. Our client base includes global pharmaceutical companies, biotechnology companies, government agencies and hospitals and academic institutions around the world.\n\n\nAt Charles River, we are passionate about our role in improving the quality of people’s lives. Our mission, our excellent science and our strong sense of purpose guide us in all that we do, and we approach each day with the knowledge that our work helps to improve the health and well-being of many across the globe. We have proudly worked on 80% of the drugs approved by the U.S. Food and Drug Administration (FDA) in the past five years.\n\n\nEqual Employment Opportunity\n\nCharles River Laboratories is an Equal Opportunity Employer - M/F/Disabled/Vet.\n\n\nIf you are interested in applying to Charles River Laboratories and need special assistance or an accommodation due to a disability to complete any forms or to otherwise participate in the resume submission process, please contact a member of our Human Resources team by sending an e-mail message to UKITA@crl.com. This contact is for accommodation requests for individuals with disabilities only and cannot be used to inquire about the status of applications.\n\n\nFor more information, please visit www.criver.com.\n\n231881"}
{"id": "619402b3b17d5570", "title": "Senior JavaScript Developer (MarTech)", "company": "Social Discovery Group", "location": "Remote", "description": "(https://socialdiscoverygroup.com/about-us/) (https://socialdiscoverygroup.com/about-us)Social Discovery Group (https://socialdiscoverygroup.com/about-us) (SDG) is the 3rd largest social discovery company in the world, uniting 60+ brands with 500 million users. We solve the problems of loneliness, isolation, and disconnection by transforming virtual intimacy into the new normal. Our portfolio includes online communication platforms focusing on AI, game mechanics, and video streaming - Dating.com, DateMyAge, Cupid Media, Dil Mil, Kiseki, and others.\n\nSDG invests in IT startups around the world. Our investments include Open AI, Patreon, Flo, Clubhouse, Woebot, Flure, Astry, Coursera, Academia.edu, and many others.\n\nWe bring together a team of like-minded people and IT professionals specializing in the creation and development of globally impactful social discovery products. Our international team of 1200 professionals and digital nomads works all over the world.\n\nOur teams of digital nomads work remotely from Cyprus, Malta, the USA, Armenia, Georgia, Kazakhstan, Montenegro, Poland, Latvia, Serbia, Spain, Portugal, UAE, Israel, Turkey, Thailand, Indonesia, Japan, Hong Kong, Australia and many other locations.\n\nIn August 2024, we achieved Great Place to Work US Certification™! This achievement reflects our core belief that a truly exceptional workplace is built on trust, pride, and camaraderie—not just great perks.\n\nWe are looking for a Senior JavaScript developer for our Martech product.\n\nYour main tasks will be:\n\nFullstack development with a focus on the backend (85%).\nDevelopment of the high-performance landing pages platform Terra, including A/B testing, multi-armed bandits, and Cloudflare integration.\nMaintenance of the CI/CD pipeline (GitHub Actions).\nDevelopment of a Google Optimize–like platform (TDS).\nDevelopment of a REST-like API using Node.js, TypeScript, MongoDB, Kafka, and ClickHouse.\nWriting unit and/or integration tests.\nDevelopment of Cloudflare Workers.\n\nWe expect from you:\n\nDeep understanding of modern web application architecture.\nStrong knowledge of Node.js and TypeScript development, with an understanding of REST-like architecture.\nWillingness to develop and maintain high-load applications with a focus on performance and stability.\nKnowledge and hands-on experience with Docker for container orchestration.\nBasic nowledge of HTML/CSS, layout, Vanilla JavaScript for frontend development\nExperience working with CI/CD tools (GitHub Actions).\nExperience with NoSQL databases and a basic understanding of query optimization principles (indexes).\n\nWhat do we offer:\n\n\n\nREMOTE OPPORTUNITY to work full time;\nVacation 28 calendar days per year;\n7 wellness days per year (time off) that can be used to deal with household issues, to lie down and recover without taking sick leave;\nBonuses up to $5000 for recommending successful applicants for positions in the company;\n50% payment for professional training, international conferences and meetings;\nCorporate discount for English lessons;\nHealth benefits. According to the paychecks, if you are not eligible for corporate medical insurance, the company will compensate you with up to $ 1,000 gross per year per employee. This can be spent on self-purchase of health insurance or on doctor's fees for yourself and close relatives (spouse, children);\nWorkplace organization. The company provides all employees with an equipped workplace and all the necessary equipment (table, armchair, wifi, etc.) in our offices or co-working locations. In the other locations, the company provides reimbursement of workplace costs up to $ 1000 gross once every 3 years, according to the paychecks. This money can be spent on the rent of the co-working room, on equipping the working place at home (desk, chair, Internet, etc.) during those 3 years;\nInternal gamified gratitude system: receive bonuses from colleagues and exchange them for our merchandise, team building activities, massage certificates, etc.\n\nSounds good? Join us now!"}
{"id": "a15b3b9e3aab548d", "title": "Senior Front-End Developer- Analytics & UX Focused (Remote)", "company": "Actionable.co", "location": "Remote", "description": "At Actionable.co (https://actionable.co/), we're transforming how Learning & Development initiatives create lasting, measurable behavior change. Our platform empowers Consultants and Professionals in the Training, Leadership Development, Learning and Culture Change space to demonstrate measurable impact through our tech-enabled change methodology.\n\nWe're looking for a UX-obsessed front-end engineer who can turn complex analytics and participant workflows into intuitive, high-impact user experiences. This role starts with full ownership of front-end development with a potential path to product leadership for someone who wants to grow beyond pure engineering.\n\nWHAT YOU'LL DO\nEnhance the Analytics Experience\nOwn the front-end development of our interactive, flexible, analytics solution delivering high-performance dashboards and data visualizations for our users and their stakeholders.\nDesign analytics experiences that are easy to use, trustworthy, and executive-ready, translating complex data into actionable insight.\nEnsure consistency and reliability across reporting, permissions, and role-based views.\nOwn the End User Experience\nModernize and streamline onboarding, authentication, and core workflows.\nDesign intuitive, accessible, and motivating user flows that encourage consistent adoption and engagement.\nEnsure performance, responsiveness, and accessibility across devices and operating systems.\nCollaborate Across the Stack\nWork closely with back-end engineers integrating MySQL, Python services, and Laravel/PHP APIs.\nImprove performance and reliability across all user-facing experiences.\nHelp evolve our design system and front-end standards.\nDrive Product from Concept to Delivery\nPartner with Client Success and Engineering to turn ideas into clear scopes, user stories, and technical plans.\nIdentify MVPs, make smart tradeoffs, and prioritize what delivers the most user value.\nAct as a bridge between design, engineering, and product—bringing clarity to ambiguity.\nOwn features from discovery through delivery and iteration.\nGrow Into Product Leadership (Optional Path)\nAct as a feature owner and product partner.\nContribute to roadmap discussions and discovery.\nMentor others and influence technical and product direction.\nProgress toward a Product Lead / Product Manager role, if desired.\nWHAT WE'RE LOOKING FOR\nCore Front-End Experience\nStrong experience building complex applications with both Vue.js and React.\nConfident working with CSS frameworks (we use Bootstrap and Tailwind).\nExperience building client-facing, executive-ready analytics dashboards.\nHands-on experience with Highcharts or similar visualization libraries.\nExperience integrating with REST APIs and backend systems.\nExperience building multi-lingual interfaces.\nExperience measuring and improving front-end performance (CI/CD or browser-based testing).\nExperience using AI-assisted development tools (e.g., code assistants, design tools, testing or documentation aids) to improve development speed and quality.\nStrong judgment in reviewing, refining, and validating AI-generated output.\nComfort integrating new tools into daily workflows while maintaining high engineering standards.\nUX & Design Strength\nStrong UX judgment and superior attention to detail.\nExperience translating designs into polished, production-ready interfaces.\nComfortable creating wire frames in Figma or similar tools.\nExperience contributing to design systems.\nFamiliarity with UX analytics tools (e.g., PostHog).\nKnowledge of accessibility and responsive design best practices (WCAG 2.2 AA).\nPrioritization & Collaboration Skills\nProduct-minded approach: from problem definition to shipped solution.\nComfortable working with ambiguity and evolving requirements.\nExperience prioritizing and scoping work strategically.\nEffective, professional English communication skills and ability to explain reasoning and decisions clearly.\nAbility to collaborate and work flexibly with North American teams and time zones.\nBackend & Platform Awareness\nExperience working with MySQL-backed APIs.\nFamiliarity with Python services and Laravel/PHP.\nExperience with multi-tenant SaaS applications.\nUnderstanding of authentication, permissions, and role-based access.\nNice to Have\nExperience modernizing legacy front-end code bases.\nBackground in B2B analytics or workflow-driven products.\nExposure to AI/LLM integrations in production.\nInterest in product management or product leadership.\n\n\n\nWHY THIS ROLE IS DIFFERENT\nYou'll have real ownership, not just tickets.\nYou'll shape both UX and product direction.\nYou'll help define how AI is used responsibly and effectively.\nYou'll have a clear growth path beyond engineering.\nOur Ideal Candidate\n\nYou're someone who:\n\nLoves building elegant, intuitive user experiences.\nThinks like a product owner, not just an implementer.\nEnjoys simplifying complex problems into clear workflows.\nWants to grow into broader impact over time.\n\nLearn more about working at Actionable HERE. (https://actionable.co/careers/)\n\nWe encourage candidates from all backgrounds to apply.\n\nWe aim to offer strong, fair compensation within local markets for senior-level ownership roles.\n\nIf this role excites you but you don't meet every requirement, we'd still love to hear from you!\n\nPlease mention the word 'exemplary' when applying to show you read the job post completely and to help us know you are a human (and not a spam bot)."}
{"id": "e6e58f8b38a0c7df", "title": "IAM Security Engineer/Full-Stack Developer, Officer", "company": "State Street", "location": "Kilkenny, County Kilkenny", "description": "We are seeking a skilled professional to lead the implementation of Oracle Directory and ForgeRock Directory solutions. This role involves defining and implementing new product features, deploying ForgeRock/Oracle Directory and ForgeRock IDM in public cloud environments (AWS/Azure), and developing standard processes for issue remediation and vulnerability management. The candidate will also contribute to maturing the operations model for long-term support.\nKey Responsibilities\nImplement Oracle Unified Directory and ForgeRock Directory\nParticipate in defining and implementing new product features.\nRe-design Oracle Unified Directory.\nDeploy ForgeRock Directory and ForgeRock IDM in public cloud (AWS/Azure)\nWill be supporting Oracle Unified Directory and ForgeRock Directory\nRequired Skills & Knowledge\nComprehensive knowledge and hands-on experience with ForgeRock/Oracle Directories.\nFamiliarity with Java development for customization, configuration, and integration tasks.\nExperience with Unix and Windows platforms.\nProficiency in automation.\nSecondary Skills\nKnowledge of scripting languages: Python, PowerShell, or Shell scripting for automation and customization.\nUnderstanding of Identity Governance and Administration (IGA) concepts and tools.\nKnowledge of cloud-based identity and access management solutions and experience with AWS, Azure, or Google Cloud.\nExperience Desired\n3+ years working with any Open LDAP Product (Oracle Unified Directory, Ping Directory, ForgeRock Directory).\n3+ years of Unix/Linux scripting experience.\n3+ years working in large, complex environments (financial services experience is a plus).\nAbout State Street\nAcross the globe, institutional investors rely on us to help them manage risk, respond to challenges, and drive performance and profitability. We keep our clients at the heart of everything we do, and smart, engaged employees are essential to our continued success.\nWe are committed to fostering an environment where every employee feels valued and empowered to reach their full potential. As an essential partner in our shared success, you’ll benefit from inclusive development opportunities, flexible work-life support, paid volunteer days, and vibrant employee networks that keep you connected to what matters most. Join us in shaping the future.\nAs an Equal Opportunity Employer, we consider all qualified applicants for all positions without regard to race, creed, color, religion, national origin, ancestry, ethnicity, age, disability, genetic information, sex, sexual orientation, gender identity or expression, citizenship, marital status, domestic partnership or civil union status, familial status, military and veteran status, and other characteristics protected by applicable law.\nDiscover more information on jobs at\nStateStreet.com/careers\nRead our\nCEO Statement"}
{"id": "0cbe90cc6af05814", "title": "Staff Frontend Engineer", "company": "Gong.io Inc.", "location": "Dublin, County Dublin", "description": "Gong harnesses the power of AI to transform how revenue teams win. The Gong Revenue AI Operating System unifies data, insights, and workflows into a single, trusted system that observes, guides, and acts alongside the world’s most successful revenue teams. Powered by the Gong Revenue Graph, AI-powered intelligence, specialized agents, and trusted applications, Gong helps more than 5,000 companies around the world deeply understand their teams and customers, automate critical sales workflows, and close more deals with less effort. For more information, visit www.gong.io.\n\nAt Gong, you will join a company built on innovative products, ambitious goals, and passionate people. We are shaping the future of revenue intelligence and we want people who are excited to build what comes next. You will work with a team that dreams big, moves fast, and cares deeply about the craft and about each other. Here, transparency and trust are core to how we operate, and every person has the opportunity to make a visible impact. If you want to grow, stretch, and do work that truly matters, Gong is the place to do the best work of your career.\n\nAt Gong, you will join a company built on innovative products, ambitious goals, and passionate people. We are shaping the future of revenue intelligence and we want people who are excited to build what comes next. You will work with a team that dreams big, moves fast, and cares deeply about the craft and about each other. Here, transparency and trust are core to how we operate, and every person has the opportunity to make a visible impact. If you want to grow, stretch, and do work that truly matters, Gong is the place to do the best work of your career.\n\nAs a Frontend Engineer at Gong, you will...\nBe a major part of Gong's Frontend guild with Frontend developers from all the teams in the company.\nTackle hard technical problems—some at the architecture level, some at the code level, some at the product level—and come up with solutions, balancing practicality and innovation, short and long term.\nBe the owner of the features you develop, while collaborating with product and UX teams from thinking and wireframes processes to production.\nBe part of our known architecture huddles when we make future decisions about our code and best practices.\nConstantly learn new things - join professional lectures and workshops organized by Gong. In addition, each developer gets extra learning time on behalf of Gong to gain or improve new professional skills.\nBe a part of a successful startup technology team that translates our vision into a solid SaaS product that performs, scales, is easy to use, and makes a big impact.\nYou should apply if you are...\n10+ years of software engineering industry experience developing web applications.\n4+ years of experience as a staff / principal engineer, preferably in an enterprise SaaS environment, leading cross-functional and cross-feature initiatives.\nSomeone who enjoys having responsibility and a sense of ownership of the product you are creating.\nDeeply knowledgeable of how JavaScript works and experienced with React (a must!).\nFamiliarity with backend languages such as Java, Node.js, C#, and others is an advantage.\nExperienced with large scale, cloud-based web applications.\nProven experience in the architecture of design systems and components.\nPreferably someone with a degree in computer science or similar discipline.\nAn all-around player, fast-learner and self-motivated individual.\nAn excellent communicator and team player, with strong verbal and written skills in English.\nMost importantly, a person who enjoys working independently and within a team of highly skilled peers.\nWhat makes Engineering at Gong unique?\n\nHere at Gong, we trust and empower our employees with ownership to solve complex problems, make the right decisions, and build the best products that create radical impact. We call this “Own. Solve. Impact.” For our engineers, it means it's not just about writing code. You are involved and able to influence the entire process to create the best product. If you are curious to discover Gong's wonderful and challenging world, what are you waiting for? Don’t delay - fill in your application details. Who knows, maybe there’s a Gongster in you!\n\nPERKS & BENEFITS\nWe offer Gongsters a variety of private health insurance plans, designed to fit you and your family’s needs.\nWellbeing Fund - flexible wellness stipend to support a healthy lifestyle.\nMental Health benefits with covered therapy and coaching.\nPension Scheme\nEducation & learning stipend for personal growth and development.\nFlexible vacation time to promote a healthy work-life blend.\nPaid parental leave to support you and your family.\nCompany-wide recharge days each quarter.\n\nWe have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates' personal and financial information through fake interviews and offers. All Gong recruiting email communications will always come from the @gong.io domain. Any outreach claiming to be from Gong via other sources should be ignored.\n\nGong believes in offering competitive compensation and benefits tailored to the local region. Gong is an equal-opportunity employer. We believe that diversity is integral to our success, and do not discriminate based on race, colour, religion, age, or any other basis protected by law.\n\nTo review Gong's privacy policy, visit https://www.gong.io/gong-io-job-candidates-privacy-notice/ for more details.\n\n#LI-OH1"}
