{"id": "bac6d13cc925f49e", "title": "Customer Solutions Engineer, Compute, Google Cloud", "company": "Google", "location": "Dublin, County Dublin", "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Warsaw, Poland; Dublin, Ireland.\nMinimum qualifications:\nBachelor’s degree in Science, Technology, Engineering, Mathematics, or equivalent practical experience.\n\n3 years of experience writing code in one or more general purpose programming languages (e.g., Java, C, C++, Python, Shell, Go or JavaScript, etc.) and in virtualization and orchestration frameworks.\nSystem administrator level experience with Linux/Unix systems.\nExperience debugging issues across the hardware/software boundary on enterprise-grade server infrastructure.\nExperience troubleshooting and advocating for customer needs, and triaging technical issues across the stack (e.g., hardware faults, low-level software, networking, virtualization, kernel drivers, firmware, performance).\n\n\nPreferred qualifications:\nExperience working with AI/ML computing hardware, including GPUs or other accelerators.\nExperience with ML frameworks (e.g., TensorFlow, Pytorch), and understanding of the AI/ML training and inference lifecycle.\n\nExperience working with large-scale distributed systems, and familiarity with common solutions, design patterns, or best practices.\n\nFamiliarity with containerization and orchestration technologies like Kubernetes or Slurm in an on-prem or cloud environment.\n\nExcellent troubleshooting, attention to detail, and communication skills.\nAbout the job\nThe Google Cloud team helps companies, schools, and government seamlessly make the switch to Google products and supports them along the way. You listen to the customer and swiftly problem-solve technical issues to show how our products can make businesses more productive, collaborative, and innovative. You work closely with a cross-functional team of web developers and systems administrators, not to mention a variety of both regional and international customers. Your relationships with customers are crucial in helping Google grow its Cloud business and helping companies around the world innovate.\n\nAs a Technical Solutions Engineer, you will be a trusted advisor to a range of customers. You'll look into complex technical challenges, troubleshoot critical issues across the Google Cloud platform, and provide solutions that help customers innovate with confidence. In this role, you will act as the advocate for the customer, collaborating with engineering and product teams to drive improvement in our products and services. You will be a part of a global team that provides support to ensure customers can seamlessly deploy their Artificial Intelligence (AI) and Machine Learning (ML) workloads on AI Infrastructure products. When customers encounter technical issues, you will ensure we have the expertise, tools, and processes to resolve the issue. You will troubleshoot technical problems with a mix of hardware and software debugging, networking, Linux system administration, coding/scripting, and updating documentation. You will help our customer’s success in the AI/ML space by making improvements to the product, internal tools, processes, and documentation. You'll help drive business growth by recognizing and advocating for our customer's tests related to AI deployments.\n\nResponsibilities\nManage customer’s problems through effective diagnosis, resolution, or implementation of new investigation tools to increase productivity for customer issues on AI/ML infrastructure.\n\nDevelop an understanding of AI/ML workloads and underlying hardware architectures by troubleshooting, reproducing, determining the root cause for customer reported issues, and building tools for faster diagnosis.\n\nAct as a consultant and subject matter expert for internal stakeholders in Engineering, Sales, and customer organizations to resolve complex deployment and operational obstacles in AI infrastructure environments.\n\nWork with multiple Product and Engineering teams to find ways to improve the product, and interact with our Site Reliability Engineering (SRE) teams to drive high-quality production.\nBe available for non-standard work hours or shifts which may include weekends as needed.\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form."}
{"id": "e1dcf7597e6fb8a7", "title": "AI and Automation Engineer", "company": "DAA", "location": "Dublin, County Dublin", "description": "\n\n\nAs an AI and Automation Engineer, you will design, develop, and deploy intelligent solutions using Microsoft’s cloud and AI technologies. You’ll work across data science, machine learning, and cognitive services to build scalable, secure, and impactful AI systems that integrate seamlessly with enterprise-grade Microsoft platforms.\n\n\n\n\nResponsibilities\n\n\n\nDesign and implement scalable machine learning models and AI solutions, specifically in MS Azure using MS AI products.\nLeverage Azure Open AI Service for generative AI applications.\nIntegrate Cognitive Services (Vision, Speech, Language) into business workflows.\nDesign data pipelines using Azure Data Factory, Synapse Analytics, and Databricks.\nEnsure data quality, governance, and compliance using Microsoft Purview.\nImplement ML Ops practices using Azure ML, GitHub Actions, and DevOps Pipelines.\nMonitor model performance and retrain as needed using Azure Monitor and Application Insights.\nIntegrate AI models into Power Platform apps\nCollaborate with cross-functional teams to identify opportunities for AI integration.\nDevelop and maintain data pipelines and infrastructure for model training and deployment.\nMonitor and optimize model performance in production environments.\nStay current with advancements in AI/ML technologies and apply them where appropriate.\nEnsure ethical and responsible AI practices, including bias mitigation and explainability.\nDocument processes, models, and systems for transparency and reproducibility Implement and maintain unit testing frameworks to ensure code quality.\nCommunicate effectively with stake holders and business units to better understand the need and ensure its being met through technical specifications.\nCreate and maintain technical documentation for web applications, including setup, guides and BAU support transition documentation.\n\n\n\nQualifications\n\n\n\nExperience\n\n3+ years professional software development experience with a focus on Azure cloud and MS AI technologies\n\nDeep experience with Azure AI services, including:\n\nAzure Machine Learning, Azure OpenAI, Cognitive Services and Azure Databricks\n\nFamiliarity with Power BI, Power Apps, and Power Automate for AI-driven insights and automation.\n\nStrong understanding of cloud architecture, security, and cost optimization in Azure.\n\nSkills\n\nProficiency in Python, R, or C# for AI/ML development.\n\nExperience with ML frameworks such as TensorFlow, PyTorch, Scikit-learn.\n\nSolid understanding of data structures, algorithms, and software engineering principles.\n\nExperience with NLP, computer vision, or reinforcement learning is a plus.\n\nKnowledge of data privacy, security, and ethical AI considerations.\n\nStrong understanding of RESTful API’s and microservices / services architectures.\n\nExperience Azure cloud services (e.g. functions and DevOps)\n\nExperience with Git and GitHub workflows.\n\nStrong problem-solving skills and attention to detail.\n\nExperience with database technologies (SQL Server, MySQL, Azure SQL and NoSQL).\n\nComfortable building and improving CI/CD pipelines.\n\nSelf-motivated with a passion for keeping up with industry trends.\n\nClear communicator and collaborator with stakeholders and project teams\n\nAbility to work independently and collaboratively in a team environment.\n\nFormal Education Qualifications\n\nDegree/Diploma/Certification in Computer Science, or related field.\n\nAgile/DevOps related certifications such as – SCRUM Master, Cloud Foundations, etc., is desirable"}
{"id": "c15ee29eaf9dca49", "title": "Application Security Engineer", "company": "Millennium Management", "location": "Dublin, County Dublin", "description": "Application Security Engineer\n\nThe successful candidate will be a subject matter expert with direct experience in a wide range of security technologies, tools, and methodologies. The role is suited for an experienced Application Security engineer with proven understanding in enterprise security and AI security and will focus on building toolsets and processes to drive adoption of secure practices across the enterprise. The team fosters a collaborative environment and is building a best-in-class program to partner with the business to protect the Firm’s information and computer systems. Millennium is a complex and robust technical environment and securing the Firm from external and internal threats is a top priority.\n\nPrincipal Responsibilities\n\nAI Security Strategy: Define and implement security guardrails for Generative AI, LLMs, and Agentic frameworks, ensuring safe enterprise adoption.\n\nAI Risk Management: Conduct specialized threat modeling, red teaming, and risk assessments for AI/ML models (e.g., testing for prompt injection, model theft, and data poisoning).\n\nSecurity Consulting: Lead risk management activities, including application risk assessments, design reviews, and mitigation strategies for IT projects.\n\nLifecycle Engagement: Engage throughout the SDLC to identify vulnerabilities, conduct code reviews/penetration testing, and enforce secure coding standards.\n\nProgram Development: Evangelize AppSec and AI security best practices through developer education, training materials, and outreach.\n\nTooling & Architecture: Design robust security architectures and integrate automated security testing (SAST/DAST/SCA) into CI/CD pipelines.\n\nStakeholder Liaison: Partner with Technology, Trading, Legal, and Compliance to create policies and communicate technical risks to non-technical stakeholders.\n\nQualifications/Skills Required\n\nBachelor's degree or higher in Computer Science, Computer Engineering, IT Security or related field.\n\n5+ years’ experience working as an Application Security Engineer, Software Engineer, or similar role.\n\nDeep understanding of AI-specific risks (OWASP Top 10 for LLMs) and experience securing applications utilizing LLMs.\n\nExperience working with AI models, Agentic frameworks and security risks associated with AI.\n\nExperience in working with global teams, collaborating on code and presentations.\n\nDemonstrated work experience in hybrid on-premise and Public Cloud environments (AWS/GCP/Azure)\n\nStrong understanding of security architectures, secure configuration principles/coding practices, cryptography fundamentals and encryption protocols.\n\nExperience with common SCM & CI/CD technologies like GitHub, Jenkins, Artifactory, etc. and integrating Security Scanning and Vulnerability Management into the CI/CD Pipelines\n\nFamiliarity with static and dynamic security analysis tools, and SCA/SBOM solutions.\n\nHands on experience with Secrets Management & Password Vault technologies such as Delinea Secret Server and/or Hashicorp Vault, etc.\n\nStrong experience in secure programming in languages such as Python, Java, C++, C#, or similar.\n\nFamiliarity with Infrastructure as Code tools (CloudFormation, Terraform, Ansible, etc.)\n\nFamiliarity with web application security testing tools and methodologies.\n\nKnowledge of various security frameworks and standards such as ISO 27001, NIST, OWASP, etc.\n\nKnowledge of Linux, OS internals and containers is a plus.\n\nCertifications like CISSP, CISM, CompTIA Security+, or CEH are advantageous."}
{"id": "c11910e81a3c3c13", "title": "Web Developer - Full Stack MERN", "company": "Confidental Company", "location": "Remote", "description": "Job Title: Web Developer - MERN Stack\n\nLocation: Remote\n\nJob Type: Full-Time, Long-Term Hire\n\nSalary: Competitive, based on experience level\n\nAbout Us: We are a dynamic and innovative company looking to expand our team with a talented MERN Stack Developer. Our team is fully integrated and works collaboratively to deliver cutting-edge solutions. We value personal and professional growth and are committed to providing opportunities for our team members to learn and develop. This role will involve you working accross a variety of projects, you will be asked to learn a lot, take on repsonsibility, think outside the box, and become a key member of our team.\n\nKey Responsibilities:\n\nDevelop and maintain web applications and mobile apps using MongoDB, Node.js, React.js, and ReactNative.\nCollaborate with cross-functional teams to define, design, and create new features.\nWrite clean, maintainable, and efficient code.\nTroubleshoot and debug applications.\nStay up-to-date with emerging technologies and industry trends.\nInnovate, and come up with solutions to solve problems and to avail of opportunities.\n\nTech Stack:\n\nReact\nRedux\nNode\nMongoDB\nReact Native\n\nQualifications:\n\nExperience with the MERN stack (MongoDB, Express.js, React.js, Node.js).\nStrong understanding of JavaScript and modern web development practices.\nAbility to demonstrate innovative thinking and problem-solving skills.\nExcellent communication and teamwork abilities.\nEagerness to learn and grow both personally and professionally.\nOpen to developers of different experience levels; willingness to mentor and be mentored.\n\nWhat We Offer:\n\nCompetitive salary based on experience level.\nFully remote work environment.\nOpportunities for continuous learning and professional development.\nA supportive and collaborative team culture.\nLong-term career growth and stability.\n\nHow to Apply: Please submit your resume and a short cover letter detailing your experience and why you would be a great fit for our team.\n\nJob Type: Full-time\n\nPay: €35,000.00-€55,000.00 per year\n\nBenefits:\n\nCompany events\nFlexitime\nSick pay\nWork from home\n\nApplication question(s):\n\nPlease succinctly describe your professional React experience. No AI produced/enhanced answers will be accepted. If you do not have this experience, please simply state this.\nPlease succinctly describe your professional Node experience. No AI produced/enhanced answers will be accepted. If you do not have this experience, please simply state this.\nPlease succinctly describe your professional Redux experience No AI produced/enhanced answers will be accepted. If you do not have this experience, please simply state this.\nOur advertised salary range is €35k – €55K. Based on your professional experience and skills, where do you see yourself within this range (please justify your answer)? No AI produced/enhanced answers will be accepted.\n\nEducation:\n\nBachelor's (preferred)\n\nExperience:\n\nReact: 2 years (preferred)\nNode.js: 2 years (preferred)\nRedux: 2 years (preferred)\n\nWork Location: Remote"}
{"id": "2743065496be8cbf", "title": "Front End Engineer", "company": "AccountsIQ", "location": "Dublin, County Dublin•Hybrid work", "description": "The Company\nAt AccountsIQ, we’re on a mission to deeply understand our customers and deliver technology that enriches their lives. We provide smart, feature-rich financial management software designed for ambitious businesses that have outgrown basic starter systems or seek a simpler, more affordable alternative to complex, costly ERP solutions. Our cloud-based accounting software transforms the finance function, making it easier for multi-entity businesses to capture, process, and report their financial data with ease and efficiency.\n\n\nThe Role\n\nThis Front-End Engineer role has been created due to continued growth and reports to the Director of Engineering. It sits within a fast-paced, product-led SaaS environment and works closely with an international engineering team. The role focuses on designing, building, and evolving the front end of the product. It contributes to delivering high-quality, innovative software to a high engineering standard. The role operates within cross-functional product squads using Scrum, where collaboration and shared ownership are central.\n\n\nWhat you’ll be doing:\n\nBuilding new front-end features and continuously improving existing functionality as part of a product-focused engineering squad.\nCollaborating closely with designers and fellow engineers to deliver intuitive, high-quality user experiences.\nContributing to shared ownership of the application’s architecture and technical direction.\nWorking effectively in an agile, distributed environment with both on-site and remote colleagues.\nSupporting and learning from other engineers, sharing knowledge and best practices.\nBe involved across the full development lifecycle, from design and implementation through to testing and release.\nWorking across a modern tech stack, primarily focused on front-end development, with some exposure to backend technologies.\nReviewing code, participating in retrospectives and post-mortems, and actively contributing to continuous improvement within a cross-cultural team.\n\n\n\nWhat you’ll need:\n\nYou’ll have at least 3 years’ hands-on experience building modern front ends using technologies such as Vue.js (or React), alongside strong HTML, CSS, and JavaScript fundamentals.\nYou’re curious about new technologies and enjoy thoughtfully applying them to improve existing systems.\nYou’re comfortable writing modern, maintainable CSS. Familiarity with design systems or using design tokens is a bonus.\nYou have a solid understanding of HTTP and REST APIs and how front ends integrate with backend services.\nExperience or interest in working with a component-driven development approach, building and validating reusable UI components in isolation using tools such as Storybook. Familiarity with interactive component tests, JavaScript unit tests, end-to-end testing tools like Playwright, and API mocking tools such as Mock Service Worker (MSW) is welcome but not required.\nA good understanding of browser fundamentals and platform features, including common browser APIs, client-side storage options, and when these are appropriate to use.\nAn interest in front-end performance, with some experience using browser developer tools (including the Performance tab) to investigate and reason about rendering, scripting, and network-related performance issues.\n\n\n\nWhy work with us?\n\nAs a forward-thinking, collaborative company, we combine drive, energy, and ambition with a friendly, supportive culture that encourages everyone to do their best work. Having recently secured a €60M investment, it's an exciting time to join AccountsIQ. With a strong focus on growth and expansion, we're poised to elevate both the AccountsIQ product and the level of service we provide to our customers.\n\n\nSome of our perks\n\n28 days annual leave + bank holidays + your birthday off\nHybrid working\nWorking from abroad - up to 6 weeks per calendar year\nPrivate Health Insurance\n5% Pension contribution\nLife Assurance - 4 x Salary\nIncome Benefit\nWellbeing initiatives\n\n\n\nBy submitting your application, you agree that AccountsIQ Group may collect your personal data for recruiting, global organisation planning, and related purposes. AccountsIQ Group’s Privacy Notice explains what personal information we may process, where we may process your personal information, our purposes for processing your personal information, and the rights you can exercise over AccountsIQ Group’s use of your personal information."}
{"id": "16eb220367d2c596", "title": "Software Development Engineer in Test II", "company": "PlayStation Global", "location": "Dublin, County Dublin", "description": "Position Type:\nLocation(s):\nIreland, Dublin\nDate Posted:\nJob ID:\nR-122949\n\n\n\nWhy PlayStation?\n\nPlayStation isn’t just the Best Place to Play — it’s also the Best Place to Work. Today, we’re recognized as a global leader in entertainment producing The PlayStation family of products and services including PlayStation®5, PlayStation®4, PlayStation®VR, PlayStation®Plus, acclaimed PlayStation software titles from PlayStation Studios, and more.\n\nPlayStation also strives to create an inclusive environment that empowers employees and embraces diversity. We welcome and encourage everyone who has a passion and curiosity for innovation, technology, and play to explore our open positions and join our growing global team.\n\nThe PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Group Corporation.\n\nWe are continuing to grow our Quality Engineering team in Dublin. We are looking for another SDET II's who will contribute to developing and maintaining automation opportunities within our quality engineering framework.\n\nOur QE team strives to ensure high quality customer experience using standard methodologies in manual and automated testing.\n\nWhat you’ll be doing:\n\nContribute to the design and evolution of test strategies and frameworks.\nWrite automation scripts for features with key characteristics of stability and maintainability which prevents regressions in the product code.\nContribute to and extend scalable test frameworks for functional, integration and regression testing.\nDevelop and extend API test frameworks for microservices, including mocking external services, databases and dependencies\nWork in an agile and highly collaborative environment with our globally distributed engineering teams, architecture, product, program, and operations.\nEvaluate gaps in testing and contribute solutions by writing high-quality automation to increase test coverage.\nExperience working with build automation infrastructure and contributing to CI Pipeline automation.\nEye for detail to test the Applications from the End user perspective.\nCreate scripts and tools to improve test efficiency and effectiveness.\nSupport code quality, static analysis, continuous integration, bespoke test frameworks and other systems\nSupport project quality by adopting and contributing to suitable tools and processes.\nLearning about PlayStation tools, systems and products\n\nWhat we’re looking for:\n\n2 years of experience in UI, API and E2E testing. Test case design and automation for web applications.\nExperience with one or more testing frameworks including Junit, REST Assured, TestNG, Selenium, Webdriver.io, Playwright\nExperience in coding in any of the languages Java, Javascript, Python or C#\nExperience with build automation and continuous integration tools; Jenkins, etc.\nExperience with Behavior-Driven Development; Cucumber or Gherkin is a plus.\nStrong analytical skills and a sense of ownership.\nGood written and verbal communication skills.\nKnowledge of testing commerce and payment solutions is a plus.\nMobile applications testing is a plus.\nMethodical and detailed problem-solving approach\nCustomer and peer relationship focused with strong interpersonal and communication skills, able to partner across teams to inspire change.\nAbility to thrive in a fast-paced team environment.\nAbility to learn new skills/technologies quickly and independently.\n\n\nPlease note, Sony Interactive Entertainment conducts background checks at the offer stage for all new employees (which may include criminal background checks for some roles) and will need to process personal information to support these checks.\n\nPlease refer to our Candidate Privacy Notice for more information about what personal information we collect, how we use it, who we share it with, and your data protection rights.\n\nEqual Opportunity Statement:\n\nSony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to gender (including gender identity, gender expression and gender reassignment), race (including colour, nationality, ethnic or national origin), religion or belief, marital or civil partnership status, disability, age, sexual orientation, pregnancy, maternity or parental status, trade union membership or membership in any other legally protected category.\n\nWe strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.\n\nPlayStation is a Fair Chance employer and qualified applicants with arrest and conviction records will be considered for employment."}
{"id": "8958e5b88e09fb14", "title": "Junior to Mid PHP Developer", "company": "Kelsius", "location": "Remote", "description": "Kelsius is the leading supplier of automation technology for product safety and compliance with the food services and healthcare industries. Using our world class wireless temperature monitoring technology, digital HACCP Management system and cloud-based data hosting and processing, Kelsius systems improve product safety, ensure regulatory compliance and optimise costs associated with these activities. Founded in 2003, Kelsius operates in Ireland and the UK and we export our products and services to over 50 countries across the globe. Our customers range from large supermarket chains, restaurants & hotels to pharmaceutical manufacturers, healthcare facilities, laboratories, foodservice companies and vaccination centres.\n\nKelsius is recruiting for the role of Junior to Mid PHP developer for a legacy web application to strengthen its R&D team. You will be responsible for enhancing and maintaining various applications (Client facing and internal web-based applications), to continue to grow our market base. This is an exciting opportunity, if you have an interest in IoT and want to get involved in a rapidly growing industry.\n\nYou will work alongside the Product Manager, the R&D team and the Testing team and be responsible for the full development life cycle of the app. Your ability to understand requirements and to convert them to efficient solutions makes you an ideal self-starter candidate. Your ability to work on multiple projects in a very agile environment will set you apart.\n\nOur application is built with core PHP (no full-stack frameworks), so a strong understanding of vanilla PHP and custom architecture is essential and includes:\n\nMain Responsibilities:\n\nDevelop new software features, and maintain existing software: debug and fix issues in an existing PHP codebase\nMake small/medium changes safely in legacy code\nWrite and maintain raw SQL queries\nMinor JavaScript for simple UI behaviour\n\nThe successful candidate will:\n\nHave good experience with PHP and MySQL. 1-5 years’ experience.\nPlain PHP fundamentals (comfortable without a framework)\nStrong debugging skills\nWeb Fundamentals\nPractical web security knowledge\nFamiliarity with RESTful APIs and integrating third-party services.\nAbility to write clean, maintainable, and testable code.\nDemonstrate initiative, be a self-starter, show willingness to learn.\nHave strong organizational skills and demonstrate a good attention to detail.\nHave good interpersonal skills and be a team player.\nHave some experience using Git (Git Basics)\nHave the ability to work in a fast-paced development environment and to commit to deadlines\n\nThis is a remote working role with occasional visits to our head office in Gweedore/Falcarragh, Co. Donegal. Candidates must reside in Ireland and have the right to work in Ireland.\n\nAt Kelsius we are an equal opportunity employer. We attract and retain the best qualified individuals available, without regard to race/ethnicity, religion, gender, sexual orientation, age or disability.\n\nJob Types: Full-time, Permanent\n\nPay: €35,000.00-€40,000.00 per year\n\nBenefits:\n\nBike to work scheme\nCompany events\nSick pay\nWork from home\n\nApplication question(s):\n\nKelsius is only able to hire individuals who are legally able to work in Ireland &/or the UK. We are not currently looking to sponsor candidates for this role. Are you currently able to work legally and full time in Ireland and/or the UK?\nThis positions requires fluency in English (reading, writing & speaking). Are you fluent in English?\nThis position requires the candidate live and work full time in Ireland &/or the UK. Are you located in Ireland and/or UK?\n\nExperience:\n\nPHP Development: 3 years (preferred)\n\nWork Location: Remote"}
{"id": "ea50d8ff71a85bc4", "title": "Senior Quality Assurance Engineer", "company": "ClickDimensions", "location": "Remote", "description": "As a Senior Quality Assurance Engineer, you'll be a driving force in guaranteeing the quality and reliability of our sophisticated .NET Core product suite. You'll team up closely with our development teams to architect, build, and execute comprehensive test strategies that cover all the bases – functional, integration, and performance. We're looking for someone who doesn't just find bugs, but proactively champions quality at every stage.\n\nKey Responsibilities:\n\nStrategic Test Leadership: Take the lead in crafting and implementing forward-thinking test plans and strategies that sync perfectly with product goals and release timelines.\nCollaborative Test Definition: Partner with development teams to deeply understand product intricacies and proactively identify critical testing needs.\nAutomation Architect & Implementer: Design, develop, and maintain resilient automated test suites using your expertise in .Net, Selenium WebDriver, and NUnit for seamless UI testing.\nAPI Testing: Postman to ensure our APIs are robust and reliable.\nCI/CD Integration Champion: Seamlessly integrate automated tests into our CI/CD pipeline, baking in quality at every iteration.\nHands-on Testing & Insight Generation: Expertly execute both manual and automated tests, pinpointing and clearly reporting defects. Go beyond just finding bugs – analyse results to spot trends and drive continuous improvement.\nDefect Master & Collaborator: Efficiently track and manage defects using tools like Jira, working closely with development to ensure swift and effective resolutions.\n\nRequired Skills and Experience:\n\n8+ years of hands-on experience in software quality assurance, with a significant track record in .NET Core environments.\nSelenium WebDriver: Proven mastery of Selenium WebDriver for crafting effective web application automation.\nAzure native services (e.g., Azure Functions, Azure App Services, Azure SQL Database) would be an advantage\nTesting Framework Fluent: Extensive experience with NUnit or similar frameworks for structured test management and execution.\nAPI Testing : Solid experience with API testing tools like Postman\nPerformance Testing Acumen: Familiarity with performance testing tools (JMeter, LoadRunner) – a definite plus.\nPlaywright Proficiency: Knowledge of Playwright is a valuable asset.\nCI/CD Integration Expertise: Hands-on experience integrating automated tests into CI/CD pipelines (e.g., Azure DevOps).\nAgile & DevOps Mindset: Strong grasp of software development methodologies (Agile, Scrum, DevOps).\nSharp Problem Solver & Analyst: Exceptional problem-solving and analytical capabilities.\nExceptional Communicator & Collaborator: Outstanding communication and interpersonal skills – you can articulate technical findings clearly and work effectively across teams.\nSelf-Starter with Initiative: A proactive individual who spots opportunities for improvement and acts on them.\nAdaptable & Responsive: Thrives in a dynamic environment and responds effectively to change.\nQuality-First: A deep-seated commitment to delivering high-quality software.\n\nJob Types: Full-time, Permanent\n\nPay: Up to €80,000.00 per year\n\nBenefits:\n\nAdditional leave\nBike to work scheme\nCompany events\nCompany pension\nEmployee assistance program\nGym membership\nPrivate medical insurance\nWellness program\nWork from home\n\nWork Location: Remote"}
{"id": "f560810e6031db86", "title": "Senior Software Engineer (PHP)", "company": "Supermetrics", "location": "Dublin, County Dublin", "description": "We are looking for a Senior Backend Engineer to join our Data Management team.\n\nThe Data Management Team is a dedicated team within the Platform and UX Group, focusing on user-oriented initiatives to enhance data handling and reporting capabilities\n\nHere's what you'll help us deliver:\n\nData Blending makes it possible to join data from multiple Supermetrics data sources into one graph or table, without having to do manual data manipulation on the destination side , such as Looker Studio or Google Sheets\nCustom Fields transform the data you use in your reporting. How the data is transformed is up to you — once you've created a custom field, it's saved and ready for use whenever you need it\nData source account management: Effortlessly handle a multitude of accounts, create custom tags, and streamline your workflow without the hassle of selecting individual accounts\nData Explorer is a new way to explore data right inside the Supermetrics platform. It lets users get insights in an intuitive way, using all the available space in the UI for an optimal experience\nData Workflow Agent aims to streamline the entire data fetching process by owning the pipeline end-to-end. Through a conversational interface combined with live previews, the agent will guide users in setting up workflows: connecting sources, normalizing data, blending datasets, creating additional fields, validating queries, and selecting destinations\n\nEach project is a complex solution that includes\n\nManagement tools: API endpoints and user interfaces\nCustom engine: A tailored engine to meet specific project needs\nIntegration with the Core framework and all Supermetrics destinations\n\nYour day-to-day work and responsibilities include...\n\nLeading the development of new features and functionalities for our customers.\nLeading and planning new initiatives and features\nCollaborate with product managers, designers, and other stakeholders to define technical roadmaps, prioritize features, and estimate development efforts\nDrive and enforce high code quality standards through thorough code reviews, promoting best practices in software development, and ensuring maintainability and scalability.\nMentor and guide team members, fostering a culture of learning, collaboration, and continuous improvement. Provide technical guidance, conduct code reviews, and share knowledge to enhance the team's overall performance and expertise\nProactively identify and address potential system bottlenecks, improve monitoring and alerting capabilities, and ensure the stability and performance\nUtilizing existing monitoring tools to ensure system stability\n\nTechnologies you'll be using...\n\nPHP\nMySQL / PostgreSQL\nRedis\nGCP / AWS Clouds and derived services, e.g., Google Pub/Sub, Cloud Storage Bucket, etc.\nDocker\nKubernetes\nKibana / Grafana / DataDog\nGit\nKubernetes\nTerraform\n\nThis role is for you if you have:\n\n7+ years of back-end experience.\nAbility to design, architect, and build a feature from scratch.\nAbility to conduct unit testing, integration testing, and end-to-end testing.\nStrong understanding of architecture & software design.\nStrong grasp of the software testing discipline.\nExperience with handling large volumes of data\nUnderstanding of security best practices.\nUnderstanding of monitoring tools and ability to interpret monitoring data. This includes tools such as Datadog, Kibana, Grafana, etc., which are used to track application performance and system metrics\nExperience collaborating directly with product teams and designers.\nDetail-oriented with strong analytical and problem-solving abilities.\nStrong communication skills; fluent in English is a must.\nAbility to give effective feedback.\n\nNice to have skills:\n\nPython\nExperience in developing AI agents\nExperience with Kubernetes in a cloud environment.\nProficient use of AI tools\nExperience working with and safely modifying existing legacy code to implement new features or improve performance\nExperience developing and maintaining applications using the Symfony framework and its associated ecosystem (e.g., Doctrine ORM)\n\nBenefits we offer:\n\nAttractive compensation package, including equity.\nExcellent work equipment and home office allowance for remote locations.\nAnnual personal learning budget.\nBenefits vary based on location\n\nDoes this sound like your next adventure? Apply now! We'll fill the role as soon as we find the right person.\n\nAnd don't forget to read more about our Engineering teams at Supermetrics!\n\n#LI-FullTime #LI-MiddleToSeniorLevel\n\n\n\n\nJoin us on our mission to make data a marketing superpower\n\n\n\n\nSupermetrics builds an end-to-end marketing intelligence platform, with 15% of global advertising spend reported through our products.\n\n\n\n\nWe help marketers turn their data into insights that improve business results and predict the best next step. Our technology streamlines marketing data for over 200,000 businesses through a network of agencies and customers like Shopify, HubSpot, and Nestlé. Since our founding in 2013, we've grown from a one-person shop to a key player in the industry—and we're just getting started!\n\n\n\n\nWe're a team of 400+ growth-minded people from diverse backgrounds. Together, we make a multicultural, resourceful, and collaborative team.\n\n\n\n\nSupermetrics operates on trust, transparency, and a keen customer focus. Forward-looking and action-oriented, we work hard to raise the bar in our industry. As team players, we help each other and win together.\n\n\n\n\nWe're hiring for a diverse, skilled, and collaborative team and building an inclusive workplace where everyone is treated fairly and respectfully.\n\n\n\n\nSupermetrics is committed to providing a welcoming and inclusive workplace for all. We believe that a diverse workforce is a strong workforce, and we are dedicated to creating an environment where everyone feels valued and respected.\n\n\n\n\nIt all started with a Google t-shirt... Read the rest of our growth story at supermetrics.com/about."}
{"id": "8c9a6159fbb690fe", "title": "QA Engineer", "company": "AccountsIQ", "location": "Dublin, County Dublin•Hybrid work", "description": "The Company\nAt AccountsIQ, we’re on a mission to deeply understand our customers and deliver technology that enriches their lives. We provide smart, feature-rich financial management software designed for ambitious businesses that have outgrown basic starter systems or seek a simpler, more affordable alternative to complex, costly ERP solutions. Our cloud-based accounting software transforms the finance function, making it easier for multi-entity businesses to capture, process, and report their financial data with ease and efficiency.\n\n\nThe Role\n\nThis is a newly created QA Engineer role reporting to the Director of Engineering, driven by the continued growth of our engineering function. You will join an international team building and maintaining high-quality SaaS products across web applications and backend services. Working within cross-functional product squads in an Agile/Scrum environment, you will ensure quality is embedded throughout the development lifecycle. Automation and repeatability will be core to your work, with shared ownership of the quality of every software increment.\n\n\nWhat you’ll be doing:\n\nDefining and executing testing scenarios across the full software development lifecycle\nBuilding, maintaining, and improving automated UI tests using Playwright\nWorking closely with developers to clarify requirements and validate solutions\nPerforming and automating functional, regression, and acceptance testing\nTracking and reporting on quality metrics and investigating critical production issues\nPromoting a strong quality-first culture and mentoring junior QA team members\n\n\n\nWhat you’ll need:\n\n3+ years’ experience in a QA or test automation role\nExperience authoring and maintaining automated tests in Playwright with a code-first approach\nExperience working in Agile or Lean development environments\nA solid understanding of test automation principles and quality best practices\nBasic SQL knowledge and the ability to understand and work with C# code\nExperience with at least one scripting language\nISTQB certification (or equivalent) is a plus\nYou’re curious about new technologies and enjoy thoughtfully applying them to improve existing systems\nExperience working on a SaaS product is a plus\n\n\n\nWhy work with us?\n\nAs a forward-thinking, collaborative company, we combine drive, energy, and ambition with a friendly, supportive culture that encourages everyone to do their best work. Having recently secured a €60M investment, it's an exciting time to join AccountsIQ. With a strong focus on growth and expansion, we're poised to elevate both the AccountsIQ product and the level of service we provide to our customers.\n\n\nSome of our perks\n\n28 days annual leave + bank holidays + your birthday off\nHybrid working\nWorking from abroad - up to 6 weeks per calendar year\nPrivate Health Insurance\n5% Pension contribution\nLife Assurance - 4 x Salary\nIncome Benefit\nWellbeing initiatives\n\n\n\nBy submitting your application, you agree that AccountsIQ Group may collect your personal data for recruiting, global organisation planning, and related purposes. AccountsIQ Group’s Privacy Notice explains what personal information we may process, where we may process your personal information, our purposes for processing your personal information, and the rights you can exercise over AccountsIQ Group’s use of your personal information."}
{"id": "8683eca54f789c2c", "title": "Frontend Engineer (Full Stack Environment), PerfectScale by DoiT", "company": "DoiT", "location": "Dublin, County Dublin", "description": "Location\n\nOur Frontend Engineer (Full Stack Environment) will be an integral part of our Engineering teams in EMEA. This role is based remotely as a full-time employee in the UK, Ireland, Estonia, Israel, the Netherlands, and Sweden. We are also open to contractors in Eastern Europe and Portugal.\n\nWho We Are\nDoiT is a global technology company that works with cloud-driven organizations to leverage the cloud to drive business growth and innovation. We combine data, technology, and human expertise to ensure our customers operate in a well-architected and scalable state - from planning to production.\n\nDelivering DoiT Cloud Intelligence, the only solution that integrates advanced technology with human intelligence, we help our customers solve complex multicloud problems and drive efficiency.\n\nWith decades of multicloud experience, we have specializations in Kubernetes, GenAI, CloudOps, and more. An award-winning strategic partner of AWS, Google Cloud, and Microsoft Azure, we work alongside more than 4,000 customers worldwide.\n\nThe Opportunity\nWe're looking for a frontend-leaning Full Stack Engineer to join PerfectScale by Doit, you will play a key role in building and evolving the foundational infrastructure and services that power PerfectScale for Compute. You'll work on scalable, multi-cloud systems that enhance performance, cost efficiency, and automation across Kubernetes environments.\n\nYou'll design, develop, and maintain critical platform components, including cloud integrations and intelligent cost optimization workflows. This role offers a unique opportunity to shape the infrastructure that underpins the DoiT and PerfectScale partnership and directly influences how customers optimize and scale their compute workloads.\n\nResponsibilities\n\nBuild and evolve frontend-heavy features using React and TypeScript, with a strong focus on usability, performance, and maintainability.\nCollaborate with backend engineers to design and consume clean APIs that power rich frontend experiences.\nOwn features end-to-end: from technical design and implementation to testing and long-term maintenance.\nImprove frontend architecture, component reuse, and overall code quality.\nActively participate in design discussions, helping balance technical feasibility with user experience.\nProactively identify UX and technical debt, and help drive improvements across the product.\n\nQualifications\n\n5+ years of experience in software development, ideally frontend-leaning full stack.\nStrong experience with React + TypeScript and modern frontend patterns.\nComfort working across the stack (Node.js, APIs, cloud services), with interest in expanding backend knowledge.\nSolid understanding of microservices, API-driven architectures, and cloud-native environments.\nStrong communication skills and the ability to collaborate effectively in a distributed, remote-first team\n\nBonus Points\n\nExperience building dashboards, data-heavy UIs, or developer-facing tools.\nFamiliarity with Kubernetes concepts and cloud infrastructure (even at a high level).\nExposure to CI/CD pipelines, GitOps, or DevOps workflows.\nExperience with databases such as BigQuery, ClickHouse, or Firestore.\n\nAre you a Do'er?\n\nBe your truest self. Work on your terms. Make a difference.\n\nWe are home to a global team of incredible talent who work remotely and have the flexibility to have a schedule that balances your work and home life. We embrace and support leveling up your skills professionally and personally.\n\nWhat does being a Do'er mean? We're all about being entrepreneurial, pursuing knowledge, and having fun! Click here to learn more about our core values.\n\nSounds too good to be true? Check out our Glassdoor Page.\n\nWe thought so too, but we're here and happy we hit that 'apply' button.\n\nFull-time employee benefits include:\n\nUnlimited Vacation\nFlexible Working Options\nHealth Insurance\nParental Leave\nEmployee Stock Option Plan\nHome Office Allowance\nProfessional Development Stipend\nPeer Recognition Program\n\nMany Do'ers, One Team\n\nDoiT unites as Many Do'ers, One Team, where diversity is more than a goal—it's our strength. We actively cultivate an inclusive, equitable workplace, recognizing that each unique perspective enhances our innovation. By celebrating differences, we create an environment where every individual feels valued, contributing to our collective success.\n\n#LI-Remote"}
{"id": "48ad5a094fd28f03", "title": "Graduate/Junior Full Stack Developer", "company": "Ashgrove Renewables", "location": "Cork, County Cork", "description": "Role: Full Stack Developer I – (Graduate/Junior)\n\nLocation: Mallow, Co. Cork\nEmployment Type: Full-Time, On-site\n\nAshgrove is seeking a motivated graduate/Junior Full Stack Developer to join our fast-growing Mallow based team.\n\nThis role provides the opportunity to contribute across the full software development lifecycle, delivering scalable backend services and modern front-end applications while supporting continuous improvement initiatives across the business.\n\n\nContribute across the full project lifecycle, including requirements analysis, solution design, development, testing, deployment, and ongoing support.\n\nDevelop, design & create backend services and modern web-based front-end applications\n\nIdentify opportunities for automation and process improvement and implement scalable technical solutions.\n\nParticipate in architecture discussions, technical evaluations, and technology selection.\n\nActively collaborate in the strategic goals of the CI department,\nAssist in maininting existing applications & providing IT assistance to fellow employees,\nCollaborate with department heads to define and measure KPIs and KQIs aligned to business objectives.\n\nLiaise with Zoho support on complex integrations and enhancements.\n\nAssist in the development and deployment of non-software based process improvement,\n\nRequirements\n\nTechnical Skills & Experience\n\n\n\nStrong ability to analyse requirements, explore alternatives, and derive effective technical solutions to complex problems.\n\nProven experience in full stack development, with strong hands-on expertise in Node.js, Next.js, and PostgreSQL and other latest scripting languages. Experience with additional frameworks, languages, or databases is highly advantageous.\n\nExperience designing and consuming RESTful APIs, with a strong understanding of business process automation and system integration.\n\nFamiliarity with CI/CD pipelines, version control systems, and automated deployment practices.\n\nSolid understanding of software architecture, data modelling, scalability, and system maintainability.\n\nAshgrove uses the Zoho One platform. Experience with Deluge is not required; however, a strong foundation in general programming principles is essential to enable efficient review and adaptation of existing code.\n\n\nCore Competencies\n\n\n\nStrong written and verbal communication skills with the ability to work effectively in a collaborative team environment.\n\nExcellent analytical and problem-solving capability with a methodical approach to task execution.\n\nHigh level of initiative, curiosity, and willingness to continuously learn and develop technical expertise.\n\nAbility to independently research, evaluate, and implement viable solutions.\n\nStrong attention to quality, documentation, and delivery standards.\n\nBenefits\nCompetitive salary commensurate with experience\n\nCompany Pension\n\nFlexible working hours\n\nPerformance-related bonus\n\nBike to Work scheme\n\nOnsite parking\n\nEmployee Discounts\n\nCompany Paid Leave\n\nFurther educational support, training and development opportunities\n\nSports and Social events and activities"}
{"id": "405ec2302169bc11", "title": "Senior Software Engineer", "company": "Quest Software", "location": "Cork, County Cork", "description": "Overview:\nQuest Software's AI Center of Excellence in Cork, Ireland is seeking a Software Developer with expertise in the Microsoft technology stack. The ideal candidate will have a strong foundation in .NET technologies, C#, and SQL Server, and will contribute to the design, development, and maintenance of scalable enterprise applications.\n\nAs the central hub for AI innovation across Quest's SaaS platform ecosystem, our Cork-based AI CoE shapes the future of enterprise AI solutions serving millions of users worldwide. In this role, you will design and implement AI-powered solutions on Microsoft Azure, take ownership of specific AI system components, and collaborate closely with data scientists and senior engineers to deliver scalable, production-ready AI systems.\nResponsibilities:\nDesign, develop, test, and maintain web and desktop applications using Microsoft technologies (.NET Core/.NET Framework, C#, ASP.NET, Blazor, etc.)\nImplement and maintain RESTful APIs and integrate with third-party services\nWork with SQL Server to design and optimize database schemas, queries, and stored procedures\nDesign and implement AI/ML model deployment pipelines on Azure (Azure ML, AKS, Azure Functions)\nCollaborate with cross-functional teams, including product managers, designers, and QA engineers\nParticipate in code reviews, debugging, and performance tuning\nProduce testing documentation and demos\nAdhere to Quest’s software development methodology and security best practices\nAccurately estimate work and participate in planning activities\nStay current with emerging technologies and apply them to improve development practices\nHonor commitments to the team and business, and contribute meaningfully in team meetings\nProduces testing documentation and demos.\nQualifications:\nRequired\nBachelor’s degree in Computer Science, Engineering, or related field (or equivalent experience)\n8+ years of professional experience in software development using Microsoft technologies\nStrong experience with C#/.NET development and Python\nProficiency in .NET Core/.NET Framework, ASP.NET MVC/Web API\nExperience with SQL Server and relational database design\nHands-on experience with Azure ML, containerization (Docker, Kubernetes), and CI/CD\nUnderstanding of machine learning model deployment and MLOps practices\nFamiliarity with Azure services (App Services, Azure Functions, Azure DevOps)\nStrong problem-solving skills and attention to detail\nExcellent communication and teamwork abilities.\nCommunicate directly with customers as needed to diagnose issues or gather feedback.\nDemonstrate deep subject matter expertise within the product domain, the product technology stack, or the tools used to build the product\n\nNice to Have\nExperience with Azure OpenAI and Cognitive Services\nKnowledge of infrastructure-as-code (Terraform, ARM templates)\nExperience with microservices architecture\nExposure to Agile/Scrum methodologies\nExperience with front-end technologies such as HTML, CSS, JavaScript, and frameworks like Angular or React\nIs self-motivated, requiring minimal supervision\n\nCompany Overview\nQuest Software builds the foundation for enterprise AI with solutions in data governance, cybersecurity, and platform modernization. More than 45,000 companies — including 90% of the Fortune 500 — trust Quest to solve their most critical IT challenges. From securing identities and modernizing platforms to preparing data for AI, we help enterprises unlock their full potential.\n\nWhy Quest\nAt Quest, your work makes an impact. You’ll help organizations get AI-ready while building your career with a global team of innovators. We offer:\nCompetitive pay, annual bonuses, and top-performer recognition.\nComprehensive health, family, and retirement benefits.\nFlexible work options, generous PTO, and wellness programs.\nProfessional growth through learning platforms, mentorship, and leadership programs.\nInclusive teams that reflect the world we serve, supported by Employee Resource Groups and our Equality & Inclusion Council.\n\nCome join us. For more information, visit us on the web at Quest Careers | Innovate. Collaborate. Grow.\n\nJob seekers should be aware of fraudulent job offers from online scammers and only apply to roles listed on quest.com/careers using our applicant system. Note: We do not use text messaging or third-party messaging apps like Telegram to communicate with applicants, so please exercise caution if you are approached in this way and only interact with people claiming to be Quest employees if they have an email address ending in @quest.com."}
{"id": "f2f45c0bfb12d002", "title": "Senior C# Engineer", "company": "Quest Software", "location": "Cork, County Cork", "description": "Overview:\nQuest Software's AI Center of Excellence in Cork, Ireland is seeking a Software Developer with expertise in the Microsoft technology stack. The ideal candidate will have a strong foundation in .NET technologies, C#, and SQL Server, and will contribute to the design, development, and maintenance of scalable enterprise applications.\n\nAs the central hub for AI innovation across Quest's SaaS platform ecosystem, our Cork-based AI CoE shapes the future of enterprise AI solutions serving millions of users worldwide. In this role, you will design and implement AI-powered solutions on Microsoft Azure, take ownership of specific AI system components, and collaborate closely with data scientists and senior engineers to deliver scalable, production-ready AI systems.\nResponsibilities:\nDesign, develop, test, and maintain web and desktop applications using Microsoft technologies (.NET Core/.NET Framework, C#, ASP.NET, Blazor, etc.)\nImplement and maintain RESTful APIs and integrate with third-party services\nWork with SQL Server to design and optimize database schemas, queries, and stored procedures\nDesign and implement AI/ML model deployment pipelines on Azure (Azure ML, AKS, Azure Functions)\nCollaborate with cross-functional teams, including product managers, designers, and QA engineers\nParticipate in code reviews, debugging, and performance tuning\nProduce testing documentation and demos\nAdhere to Quest’s software development methodology and security best practices\nAccurately estimate work and participate in planning activities\nStay current with emerging technologies and apply them to improve development practices\nHonor commitments to the team and business, and contribute meaningfully in team meetings\nProduces testing documentation and demos.\nQualifications:\nRequired\nBachelor’s degree in Computer Science, Engineering, or related field (or equivalent experience)\n8+ years of professional experience in software development using Microsoft technologies\nStrong experience with C#/.NET development and Python\nProficiency in .NET Core/.NET Framework, ASP.NET MVC/Web API\nExperience with SQL Server and relational database design\nHands-on experience with Azure ML, containerization (Docker, Kubernetes), and CI/CD\nUnderstanding of machine learning model deployment and MLOps practices\nFamiliarity with Azure services (App Services, Azure Functions, Azure DevOps)\nStrong problem-solving skills and attention to detail\nExcellent communication and teamwork abilities.\nCommunicate directly with customers as needed to diagnose issues or gather feedback.\nDemonstrate deep subject matter expertise within the product domain, the product technology stack, or the tools used to build the product\n\nNice to Have\nExperience with Azure OpenAI and Cognitive Services\nKnowledge of infrastructure-as-code (Terraform, ARM templates)\nExperience with microservices architecture\nExposure to Agile/Scrum methodologies\nExperience with front-end technologies such as HTML, CSS, JavaScript, and frameworks like Angular or React\nIs self-motivated, requiring minimal supervision\n\nCompany Overview\nQuest Software builds the foundation for enterprise AI with solutions in data governance, cybersecurity, and platform modernization. More than 45,000 companies — including 90% of the Fortune 500 — trust Quest to solve their most critical IT challenges. From securing identities and modernizing platforms to preparing data for AI, we help enterprises unlock their full potential.\n\nWhy Quest\nAt Quest, your work makes an impact. You’ll help organizations get AI-ready while building your career with a global team of innovators. We offer:\nCompetitive pay, annual bonuses, and top-performer recognition.\nComprehensive health, family, and retirement benefits.\nFlexible work options, generous PTO, and wellness programs.\nProfessional growth through learning platforms, mentorship, and leadership programs.\nInclusive teams that reflect the world we serve, supported by Employee Resource Groups and our Equality & Inclusion Council.\n\nCome join us. For more information, visit us on the web at Quest Careers | Innovate. Collaborate. Grow.\n\nJob seekers should be aware of fraudulent job offers from online scammers and only apply to roles listed on quest.com/careers using our applicant system. Note: We do not use text messaging or third-party messaging apps like Telegram to communicate with applicants, so please exercise caution if you are approached in this way and only interact with people claiming to be Quest employees if they have an email address ending in @quest.com.\n\n#Q"}
{"id": "4f2c59ed35da0d64", "title": "Senior Software Engineer", "company": "Sirius XM", "location": "Dublin, County Dublin•Remote", "description": "Responsibilities:\n\nWho We Are:\n\nSiriusXM and its brands (Pandora, SiriusXM Media, AdsWizz, Simplecast, and SiriusXM Connected Vehicle Services) are leading a new era of audio entertainment and services by delivering the most compelling subscription and ad-supported audio entertainment experience for listeners - in the car, at home, and anywhere on the go with connected devices. Our vision is to shape the future of audio, where everyone can be effortlessly connected to the voices, stories and music they love wherever they are.\n\nThis is the place where a diverse group of emerging talent and legends alike come to share authentic and purposeful songs, stories, sounds and insights through some of the best programming and technology in the world. Our critically-acclaimed, industry-leading audio entertainment encompasses music, sports, comedy, news, talk, live events, and podcasting. No matter their individual role, each of our employees plays a vital part in bringing SiriusXM’s vision to life every day.\n\nWe are proud to be launching a new state-of-the-art technology facility in Dublin, Ireland. The Dublin-based team will play a critical role in our continued digital transformation, and will function as a center of excellence for SiriusXM’s global Product and Technology organization.\n\nSiriusXM’s new Dublin facility will comprise a workforce primarily focused on software development, automotive technology and engineering, adtech, data science, and analytics. Talent based in the new technology hub will be charged with developing and implementing best-in-class standards for high-quality, scalable software deliveries for SiriusXM’s streaming and in-vehicle audio entertainment platforms.\n\n\nHow you’ll make an impact:\n\nThis position is responsible for evolving our user interfaces and helping to build our web applications. You will collaborate closely with our design and product teams, gathering requirements, building solutions, and providing guidance to team members on best-practice approaches to follow. You will be a partner to our developers, helping understand their needs and championing positive engineering practices.\n\nWhat you’ll do:\n\nSiriusXM is looking for a creative and collaborative Senior Software Engineer with experience building modern consumer web applications. As a member of our Experience Engineering team, you will participate in important design and development decisions and play a key role in developing SiriusXM streaming music services (SiriusXM, Pandora), used daily by millions of listeners.\n\nWhat you’ll need:\n\nA strong interest in collaborating via code reviews and technical discussions.\nExcellent communication and interpersonal skills.\nA growth mindset and an ability to learn quickly.\n4+ years demonstrable professional experience and 2+ years developing solutions for consumer web applications.\nExcellent understanding of visual and interaction design principles, empowering strong collaboration between engineering and design.\nSolid command of web standards, best practices, accessibility, and browser compatibility issues.\nClear understanding of visual design principles, including color, typography, layouts, interactivity, and motion.\nExposure to interactive UI prototyping tools such as Figma, or similar.\nDemonstrable experience building responsive and mobile web experiences.\nExpert at debugging code errors and troubleshooting UI and API issues.\nExposure to architectural design patterns of highly scaled web applications.\nExperience writing unit, integration, and acceptance tests with Jest, Vitest, or similar.\nProficient with front-end languages including HTML, JavaScript/TypeScript, and CSS.\nSolid understanding of React and related technologies.\nNice to have experience with Webpack, Vite, or similar, and related JavaScript / TypeScript tooling.\nNice to have familiarity with trunk-based development.\nNice to have familiarity with HTML5/JavaScript environments beyond web browsers, such as HTML-based TV applications.\n\nOur goal at SiriusXM is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.\n\nThe requirements and duties described above may be modified or waived by the Company in its sole discretion without notice."}
{"id": "c6d152ae8bc7aa42", "title": "Senior Software Engineer", "company": "Adswizz", "location": "Dublin, County Dublin", "description": "Dublin, Ireland\nRegular Employee Full-Time\nR-2024-IR-175\nHybrid\n\n\n\nWho We Are:\n\nSiriusXM and its brands (Pandora, SiriusXM Media, AdsWizz, Simplecast, and SiriusXM Connected Vehicle Services) are leading a new era of audio entertainment and services by delivering the most compelling subscription and ad-supported audio entertainment experience for listeners - in the car, at home, and anywhere on the go with connected devices. Our vision is to shape the future of audio, where everyone can be effortlessly connected to the voices, stories and music they love wherever they are.\n\nThis is the place where a diverse group of emerging talent and legends alike come to share authentic and purposeful songs, stories, sounds and insights through some of the best programming and technology in the world. Our critically-acclaimed, industry-leading audio entertainment encompasses music, sports, comedy, news, talk, live events, and podcasting. No matter their individual role, each of our employees plays a vital part in bringing SiriusXM’s vision to life every day.\n\nWe are proud to be launching a new state-of-the-art technology facility in Dublin, Ireland. The Dublin-based team will play a critical role in our continued digital transformation, and will function as a center of excellence for SiriusXM’s global Product and Technology organization.\n\nSiriusXM’s new Dublin facility will comprise a workforce primarily focused on software development, automotive technology and engineering, adtech, data science, and analytics. Talent based in the new technology hub will be charged with developing and implementing best-in-class standards for high-quality, scalable software deliveries for SiriusXM’s streaming and in-vehicle audio entertainment platforms.\n\n\nHow you’ll make an impact:\n\nThis position is responsible for evolving our user interfaces and helping to build our web applications. You will collaborate closely with our design and product teams, gathering requirements, building solutions, and providing guidance to team members on best-practice approaches to follow. You will be a partner to our developers, helping understand their needs and championing positive engineering practices.\n\nWhat you’ll do:\n\nSiriusXM is looking for a creative and collaborative Senior Software Engineer with experience building modern consumer web applications. As a member of our Experience Engineering team, you will participate in important design and development decisions and play a key role in developing SiriusXM streaming music services (SiriusXM, Pandora), used daily by millions of listeners.\n\nWhat you’ll need:\n\nA strong interest in collaborating via code reviews and technical discussions.\nExcellent communication and interpersonal skills.\nA growth mindset and an ability to learn quickly.\n4+ years demonstrable professional experience and 2+ years developing solutions for consumer web applications.\nExcellent understanding of visual and interaction design principles, empowering strong collaboration between engineering and design.\nSolid command of web standards, best practices, accessibility, and browser compatibility issues.\nClear understanding of visual design principles, including color, typography, layouts, interactivity, and motion.\nExposure to interactive UI prototyping tools such as Figma, or similar.\nDemonstrable experience building responsive and mobile web experiences.\nExpert at debugging code errors and troubleshooting UI and API issues.\nExposure to architectural design patterns of highly scaled web applications.\nExperience writing unit, integration, and acceptance tests with Jest, Vitest, or similar.\nProficient with front-end languages including HTML, JavaScript/TypeScript, and CSS.\nSolid understanding of React and related technologies.\nNice to have experience with Webpack, Vite, or similar, and related JavaScript / TypeScript tooling.\nNice to have familiarity with trunk-based development.\nNice to have familiarity with HTML5/JavaScript environments beyond web browsers, such as HTML-based TV applications.\n\nOur goal at SiriusXM is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.\n\nThe requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.\n\nR-2024-IR-175"}
{"id": "458c37b0ef0cac72", "title": "Front End Engineer", "company": "f5", "location": "Dublin, County Dublin", "description": "At F5, we strive to bring a better digital world to life. Our teams empower organizations across the globe to create, secure, and run applications that enhance how we experience our evolving digital world. We are passionate about cybersecurity, from protecting consumers from fraud to enabling companies to focus on innovation.\n\nEverything we do centers around people. That means we obsess over how to make the lives of our customers, and their customers, better. And it means we prioritize a diverse F5 community where each individual can thrive.\nRole Summary:\nAt F5, we are expanding our AI Security team and seeking a motivated and skilled Frontend Engineer to develop intuitive and efficient user interfaces for our AI-powered security web applications. In this critical role, you will collaborate with multidisciplinary teams to deliver high-quality and user-centric solutions.\nAs a Frontend Engineer, you will work with cutting-edge technologies to build modern, scalable, and performant web applications. You will contribute to the team by creating frontend components, improving application architecture, ensuring superior user experience, and advancing F5's technical solutions. If you're passionate about frontend engineering and eager to innovate, grow, and work with modern web technologies, F5’s AI Security team is the perfect environment for your career advancement.\n\nKey Responsibilities:\nFrontend Development\nBuild and maintain robust, efficient, and scalable web applications using TypeScript, JavaScript, CSS, and HTML.\nDevelop and optimize frontend components, ensuring performance, usability, and accessibility standards are met.\nCollaboration\nPartner with backend engineers, data scientists, UX designers, and product managers to deliver seamless user-centered features.\nFacilitate open and effective communication across teams to ensure alignment on development goals and requirements.\nArchitecture and Design\nDesign features and components that align with modern frontend architecture and design principles, including component-based systems and micro-frontend architecture.\nContribute to the development of design systems and reusable libraries to streamline frontend development processes.\nQuality and Performance\nDeliver high-quality UI elements with seamless functionality across devices and browsers.\nOptimize web applications for speed, scalability, and performance, focusing on reducing size and enhancing responsiveness.\nUser Focus and Feedback\nImplement feedback from end users and customers to enhance user experiences and achieve product goals.\nEmbrace a user-focused mindset to ensure solutions address real-world needs.\nContinuous Improvement\nStay updated on evolving frontend standards, tools, and technologies, and contribute innovative ideas for improving current processes.\nProactively suggest and implement solutions to challenges, fostering an environment of continuous growth and improvement.\n\nQualifications:\nRequired Skills and Experience:\nMinimum 3 years of experience as a Frontend Engineer or Frontend Developer.\nComprehensive knowledge of frontend architecture and design patterns.\nStrong expertise in the JavaScript language and ecosystem.\nWorking knowledge of CSS and CSS preprocessors such as Sass, SCSS, or Less.\nProficiency in modern JavaScript features (e.g., ES2015–ES2025).\nAbility to debug and optimize browser performance, troubleshoot compatibility issues, and ensure cross-platform functionality.\nHands-on experience with modern JavaScript view libraries, such as Vue.js, React, or Svelte.\nFamiliarity with popular frontend tools such as Webpack, Vite, and CSS Modules.\nPreferred Skills:\nExperience with Vue 3 and TypeScript.\nAdvanced knowledge of modern CSS features, including grid, flexbox, CSS variables, and animations.\nFamiliarity with mobile-first design, atomic design principles, and progressive enhancement for responsive applications.\nWorking knowledge of npm or Vite package managers, including publishing packages.\nUnderstanding of emerging browser APIs and modern web technologies.\nKnowledge of design tools such as Figma, Adobe XD, or Sketch for translating design concepts into functional interfaces.\n\nTeam and Technology Stack:\nAt F5’s AI Security team, we are strong believers in creating scalable and reusable solutions. As part of our team, you'll contribute to:\nComponent-based design and the development/maintenance of robust component libraries for reusable and modular functionality.\nA cutting-edge technology stack, including Vue 3, TypeScript, Socket.IO, Pinia (state management), Storybook (components), npm workspaces, and Vite (build tools).\nAdvancing micro-frontend architecture and leveraging in-house tools and libraries to supercharge day-to-day work.\n\nWhy Join F5’s AI Security Team:\nAt F5, we are committed to building innovative solutions that enhance system security and user experience. Joining our team means:\nWorking on industry-leading AI technologies in a fast-paced, collaborative environment.\nHaving the flexibility to innovate and grow as a Frontend Engineer, leveraging the latest web standards and technologies.\nGaining access to mentorship, resources, and opportunities to advance your skills and career.\nBuilding impactful solutions that address cutting-edge security and system challenges.\n\nWhat Success Looks Like:\nA successful Frontend Engineer at F5 demonstrates the following:\nTechnical excellence in designing and building performant, scalable, and user-centric web applications.\nProactive communication and collaboration to ensure alignment across technical and non-technical stakeholders.\nStrong ownership of problem-solving and initiative in introducing innovative solutions to challenges.\nContinuous learning and adaptability to stay ahead in the evolving landscape of frontend technologies.\n\n#LI-SS5\nThe Job Description is intended to be a general representation of the responsibilities and requirements of the job. However, the description may not be all-inclusive, and responsibilities and requirements are subject to change.\nPlease note that F5 only contacts candidates through F5 email address (ending with @f5.com) or auto email notification from Workday (ending with f5.com or @myworkday.com).\nEqual Employment Opportunity\nIt is the policy of F5 to provide equal employment opportunities to all employees and employment applicants without regard to unlawful considerations of race, religion, color, national origin, sex, sexual orientation, gender identity or expression, age, sensory, physical, or mental disability, marital status, veteran or military status, genetic information, or any other classification protected by applicable local, state, or federal laws. This policy applies to all aspects of employment, including, but not limited to, hiring, job assignment, compensation, promotion, benefits, training, discipline, and termination. F5 offers a variety of reasonable accommodations for candidates. Requesting an accommodation is completely voluntary. F5 will assess the need for accommodations in the application process separately from those that may be needed to perform the job. Request by contacting\naccommodations@f5.com\n."}
{"id": "a8b94e56a3d1b0d5", "title": "Senior Front End Engineer", "company": "f5", "location": "Dublin, County Dublin", "description": "At F5, we strive to bring a better digital world to life. Our teams empower organizations across the globe to create, secure, and run applications that enhance how we experience our evolving digital world. We are passionate about cybersecurity, from protecting consumers from fraud to enabling companies to focus on innovation.\n\nEverything we do centers around people. That means we obsess over how to make the lives of our customers, and their customers, better. And it means we prioritize a diverse F5 community where each individual can thrive.\nRole Summary:\nAt F5, we are expanding our AI Security team and seeking a motivated and skilled Frontend Engineer to develop intuitive and efficient user interfaces for our AI-powered security web applications. In this critical role, you will collaborate with multidisciplinary teams to deliver high-quality and user-centric solutions.\nAs a Frontend Engineer, you will work with cutting-edge technologies to build modern, scalable, and performant web applications. You will contribute to the team by creating frontend components, improving application architecture, ensuring superior user experience, and advancing F5's technical solutions. If you're passionate about frontend engineering and eager to innovate, grow, and work with modern web technologies, F5’s AI Security team is the perfect environment for your career advancement.\n\nKey Responsibilities:\nFrontend Development\nBuild and maintain robust, efficient, and scalable web applications using TypeScript, JavaScript, CSS, and HTML.\nDevelop and optimize frontend components, ensuring performance, usability, and accessibility standards are met.\nCollaboration\nPartner with backend engineers, data scientists, UX designers, and product managers to deliver seamless user-centered features.\nFacilitate open and effective communication across teams to ensure alignment on development goals and requirements.\nArchitecture and Design\nDesign features and components that align with modern frontend architecture and design principles, including component-based systems and micro-frontend architecture.\nContribute to the development of design systems and reusable libraries to streamline frontend development processes.\nQuality and Performance\nDeliver high-quality UI elements with seamless functionality across devices and browsers.\nOptimize web applications for speed, scalability, and performance, focusing on reducing size and enhancing responsiveness.\nUser Focus and Feedback\nImplement feedback from end users and customers to enhance user experiences and achieve product goals.\nEmbrace a user-focused mindset to ensure solutions address real-world needs.\nContinuous Improvement\nStay updated on evolving frontend standards, tools, and technologies, and contribute innovative ideas for improving current processes.\nProactively suggest and implement solutions to challenges, fostering an environment of continuous growth and improvement.\n\nQualifications:\nRequired Skills and Experience:\nMinimum 4 years of experience as a Frontend Engineer or Frontend Developer.\nComprehensive knowledge of frontend architecture and design patterns.\nStrong expertise in the JavaScript language and ecosystem.\nWorking knowledge of CSS and CSS preprocessors such as Sass, SCSS, or Less.\nProficiency in modern JavaScript features (e.g., ES2015–ES2025).\nAbility to debug and optimize browser performance, troubleshoot compatibility issues, and ensure cross-platform functionality.\nHands-on experience with modern JavaScript view libraries, such as Vue.js, React, or Svelte.\nFamiliarity with popular frontend tools such as Webpack, Vite, and CSS Modules.\nPreferred Skills:\nExperience with Vue 3 and TypeScript.\nAdvanced knowledge of modern CSS features, including grid, flexbox, CSS variables, and animations.\nFamiliarity with mobile-first design, atomic design principles, and progressive enhancement for responsive applications.\nWorking knowledge of npm or Vite package managers, including publishing packages.\nUnderstanding of emerging browser APIs and modern web technologies.\nKnowledge of design tools such as Figma, Adobe XD, or Sketch for translating design concepts into functional interfaces.\n\nTeam and Technology Stack:\nAt F5’s AI Security team, we are strong believers in creating scalable and reusable solutions. As part of our team, you'll contribute to:\nComponent-based design and the development/maintenance of robust component libraries for reusable and modular functionality.\nA cutting-edge technology stack, including Vue 3, TypeScript, Socket.IO, Pinia (state management), Storybook (components), npm workspaces, and Vite (build tools).\nAdvancing micro-frontend architecture and leveraging in-house tools and libraries to supercharge day-to-day work.\n\nWhy Join F5’s AI Security Team:\nAt F5, we are committed to building innovative solutions that enhance system security and user experience. Joining our team means:\nWorking on industry-leading AI technologies in a fast-paced, collaborative environment.\nHaving the flexibility to innovate and grow as a Frontend Engineer, leveraging the latest web standards and technologies.\nGaining access to mentorship, resources, and opportunities to advance your skills and career.\nBuilding impactful solutions that address cutting-edge security and system challenges.\n\nWhat Success Looks Like:\nA successful Frontend Engineer at F5 demonstrates the following:\nTechnical excellence in designing and building performant, scalable, and user-centric web applications.\nProactive communication and collaboration to ensure alignment across technical and non-technical stakeholders.\nStrong ownership of problem-solving and initiative in introducing innovative solutions to challenges.\nContinuous learning and adaptability to stay ahead in the evolving landscape of frontend technologies.\n\n#LI-SS5\n\nThe Job Description is intended to be a general representation of the responsibilities and requirements of the job. However, the description may not be all-inclusive, and responsibilities and requirements are subject to change.\nPlease note that F5 only contacts candidates through F5 email address (ending with @f5.com) or auto email notification from Workday (ending with f5.com or @myworkday.com).\nEqual Employment Opportunity\nIt is the policy of F5 to provide equal employment opportunities to all employees and employment applicants without regard to unlawful considerations of race, religion, color, national origin, sex, sexual orientation, gender identity or expression, age, sensory, physical, or mental disability, marital status, veteran or military status, genetic information, or any other classification protected by applicable local, state, or federal laws. This policy applies to all aspects of employment, including, but not limited to, hiring, job assignment, compensation, promotion, benefits, training, discipline, and termination. F5 offers a variety of reasonable accommodations for candidates. Requesting an accommodation is completely voluntary. F5 will assess the need for accommodations in the application process separately from those that may be needed to perform the job. Request by contacting\naccommodations@f5.com\n."}
{"id": "ef381ec317f6cbf3", "title": "Full Stack Engineer", "company": "f5", "location": "Dublin, County Dublin", "description": "At F5, we strive to bring a better digital world to life. Our teams empower organizations across the globe to create, secure, and run applications that enhance how we experience our evolving digital world. We are passionate about cybersecurity, from protecting consumers from fraud to enabling companies to focus on innovation.\n\nEverything we do centers around people. That means we obsess over how to make the lives of our customers, and their customers, better. And it means we prioritize a diverse F5 community where each individual can thrive.\nRole Summary\nF5 is growing its AI Security team and is looking for an ambitious, versatile, and self-driven Backend Software Engineer. In this role, you will design, develop, test, and maintain scalable backend applications that power world-first AI Security solutions. Your contributions will be crucial to building out our AI Security web application, ensuring robust, reliable, and cutting-edge technology to successfully meet business and customer needs.\nThis role offers an exciting opportunity to collaborate with a multidisciplinary team, solve technically challenging problems, and grow professionally in a culture that values innovation, collaboration, and team excellence.\n\nTech Stack We Use\nBackend: Python, FastAPI, Pydantic, uvicorn\nFrontend: Typescript, Vue3, Vite\nSource Control: GitLab\nContinuous Delivery: ArgoCD\nDeployment: AWS (Dockerized applications, Helm charts, Kubernetes)\n\nKey Responsibilities\nBuild and Deliver Exceptional Technology\nDesign, develop, and maintain scalable backend applications, SDKs, and tools to support AI Security solutions at scale.\nCollaborate with the product, QA, frontend, and data science teams to deliver seamless, user-friendly, high-performance software.\nWrite clean, efficient, and maintainable code, adhering to F5’s best practices in software development and secure coding.\nEnsure Quality, Performance, and Architecture\nTest, troubleshoot, and optimize backend services to ensure maximum scalability, performance, and reliability.\nArchitect backend features based on best practices in modern software design and scalable architecture patterns.\nContinuous Improvement and Collaboration\nProactively suggest and implement solutions to challenges encountered during development cycles.\nThrive in a collaborative environment, working cross-functionally to ensure alignment with business and technical goals.\nStay updated with emerging technologies, leveraging new tools and features where appropriate to improve backend systems.\nQualifications and Skills\nRequired Experience\nAt least 3 years’ experience developing server-side applications using Python, FastAPI, or equivalent frameworks.\nStrong understanding of database technology, including platforms like PostgreSQL or MySQL.\nDemonstrated expertise in building, debugging, and maintaining RESTful APIs and multi-service backend systems.\nExcellent troubleshooting skills to debug and analyze complex software systems.\nA passion for owning and delivering high-quality backend solutions that meet business and customer needs.\nCore Skills\nCritical Thinking: Structured problem-solving approach when debugging and troubleshooting multi-service applications.\nCollaboration: Proven ability to work both independently and as part of a larger engineering team.\nCommunication: Clearly communicate ideas, features, and risks to technical and non-technical collaborators.\nTime Management: Ability to prioritize and manage multiple tasks effectively while meeting deadlines.\nPreferred Skills\nFamiliarity with Dockerized applications, Kubernetes, and cloud environments like AWS.\nHands-on experience with testing and delivery pipelines, including automated CI/CD workflows (e.g., ArgoCD).\nKnowledge of secure coding practices and deploying applications in mission-critical production environments.\n\nWhy Join the F5 AI Security Team?\nAt F5, Backend Engineers are critical to building AI-driven, scalable solutions that deliver empowerment and innovation to customers across the globe. Here’s why you’ll love it here:\nTechnical Excellence: Work with modern technologies and solve unique technical challenges in the rapidly evolving AI Security space.\nImpactful Collaboration: Partner with cross-functional teams to create features that solve meaningful customer problems.\nGrowth Opportunities: Advance your skills and career while contributing directly to world-first AI security innovations.\nSupportive Work Culture: We foster a collaborative team where diverse perspectives and continuous improvement drive our success.\n\nWhat Success Looks Like\nAs a Backend Software Engineer at F5, success is demonstrated by your ability to:\nDeliver high-quality, scalable backend services that enhance the capabilities of our AI Security products.\nCollaborate seamlessly with cross-functional teams to align engineering solutions with product goals.\nMaintain a growth mindset, adopting modern technologies and improving backend architecture to meet current and future needs.\nTroubleshoot and resolve complex production issues, minimizing downtime and ensuring system reliability.\n\n#LI-SS5\nThe Job Description is intended to be a general representation of the responsibilities and requirements of the job. However, the description may not be all-inclusive, and responsibilities and requirements are subject to change.\nPlease note that F5 only contacts candidates through F5 email address (ending with @f5.com) or auto email notification from Workday (ending with f5.com or @myworkday.com).\nEqual Employment Opportunity\nIt is the policy of F5 to provide equal employment opportunities to all employees and employment applicants without regard to unlawful considerations of race, religion, color, national origin, sex, sexual orientation, gender identity or expression, age, sensory, physical, or mental disability, marital status, veteran or military status, genetic information, or any other classification protected by applicable local, state, or federal laws. This policy applies to all aspects of employment, including, but not limited to, hiring, job assignment, compensation, promotion, benefits, training, discipline, and termination. F5 offers a variety of reasonable accommodations for candidates. Requesting an accommodation is completely voluntary. F5 will assess the need for accommodations in the application process separately from those that may be needed to perform the job. Request by contacting\naccommodations@f5.com\n."}
{"id": "d3e6c75d41bc24a2", "title": "Sr Full Stack Engineer", "company": "f5", "location": "Dublin, County Dublin", "description": "At F5, we strive to bring a better digital world to life. Our teams empower organizations across the globe to create, secure, and run applications that enhance how we experience our evolving digital world. We are passionate about cybersecurity, from protecting consumers from fraud to enabling companies to focus on innovation.\n\nEverything we do centers around people. That means we obsess over how to make the lives of our customers, and their customers, better. And it means we prioritize a diverse F5 community where each individual can thrive.\nRole Summary\nF5 is growing its AI Security team and is looking for an ambitious, versatile, and self-driven Backend Software Engineer. In this role, you will design, develop, test, and maintain scalable backend applications that power world-first AI Security solutions. Your contributions will be crucial to building out our AI Security web application, ensuring robust, reliable, and cutting-edge technology to successfully meet business and customer needs.\nThis role offers an exciting opportunity to collaborate with a multidisciplinary team, solve technically challenging problems, and grow professionally in a culture that values innovation, collaboration, and team excellence.\n\nTech Stack We Use\nBackend: Python, FastAPI, Pydantic, uvicorn\nFrontend: Typescript, Vue3, Vite\nSource Control: GitLab\nContinuous Delivery: ArgoCD\nDeployment: AWS (Dockerized applications, Helm charts, Kubernetes)\n\nKey Responsibilities\nBuild and Deliver Exceptional Technology\nDesign, develop, and maintain scalable backend applications, SDKs, and tools to support AI Security solutions at scale.\nCollaborate with the product, QA, frontend, and data science teams to deliver seamless, user-friendly, high-performance software.\nWrite clean, efficient, and maintainable code, adhering to F5’s best practices in software development and secure coding.\nEnsure Quality, Performance, and Architecture\nTest, troubleshoot, and optimize backend services to ensure maximum scalability, performance, and reliability.\nArchitect backend features based on best practices in modern software design and scalable architecture patterns.\nContinuous Improvement and Collaboration\nProactively suggest and implement solutions to challenges encountered during development cycles.\nThrive in a collaborative environment, working cross-functionally to ensure alignment with business and technical goals.\nStay updated with emerging technologies, leveraging new tools and features where appropriate to improve backend systems.\nQualifications and Skills\nRequired Experience\nAt least 5 years’ experience developing server-side applications using Python, FastAPI, or equivalent frameworks.\nStrong understanding of database technology, including platforms like PostgreSQL or MySQL.\nDemonstrated expertise in building, debugging, and maintaining RESTful APIs and multi-service backend systems.\nExcellent troubleshooting skills to debug and analyze complex software systems.\nA passion for owning and delivering high-quality backend solutions that meet business and customer needs.\nCore Skills\nCritical Thinking: Structured problem-solving approach when debugging and troubleshooting multi-service applications.\nCollaboration: Proven ability to work both independently and as part of a larger engineering team.\nCommunication: Clearly communicate ideas, features, and risks to technical and non-technical collaborators.\nTime Management: Ability to prioritize and manage multiple tasks effectively while meeting deadlines.\nPreferred Skills\nFamiliarity with Dockerized applications, Kubernetes, and cloud environments like AWS.\nHands-on experience with testing and delivery pipelines, including automated CI/CD workflows (e.g., ArgoCD).\nKnowledge of secure coding practices and deploying applications in mission-critical production environments.\n\nWhy Join the F5 AI Security Team?\nAt F5, Backend Engineers are critical to building AI-driven, scalable solutions that deliver empowerment and innovation to customers across the globe. Here’s why you’ll love it here:\nTechnical Excellence: Work with modern technologies and solve unique technical challenges in the rapidly evolving AI Security space.\nImpactful Collaboration: Partner with cross-functional teams to create features that solve meaningful customer problems.\nGrowth Opportunities: Advance your skills and career while contributing directly to world-first AI security innovations.\nSupportive Work Culture: We foster a collaborative team where diverse perspectives and continuous improvement drive our success.\n\nWhat Success Looks Like\nAs a Backend Software Engineer at F5, success is demonstrated by your ability to:\nDeliver high-quality, scalable backend services that enhance the capabilities of our AI Security products.\nCollaborate seamlessly with cross-functional teams to align engineering solutions with product goals.\nMaintain a growth mindset, adopting modern technologies and improving backend architecture to meet current and future needs.\nTroubleshoot and resolve complex production issues, minimizing downtime and ensuring system reliability.\n\n#LI-SS5\nThe Job Description is intended to be a general representation of the responsibilities and requirements of the job. However, the description may not be all-inclusive, and responsibilities and requirements are subject to change.\nPlease note that F5 only contacts candidates through F5 email address (ending with @f5.com) or auto email notification from Workday (ending with f5.com or @myworkday.com).\nEqual Employment Opportunity\nIt is the policy of F5 to provide equal employment opportunities to all employees and employment applicants without regard to unlawful considerations of race, religion, color, national origin, sex, sexual orientation, gender identity or expression, age, sensory, physical, or mental disability, marital status, veteran or military status, genetic information, or any other classification protected by applicable local, state, or federal laws. This policy applies to all aspects of employment, including, but not limited to, hiring, job assignment, compensation, promotion, benefits, training, discipline, and termination. F5 offers a variety of reasonable accommodations for candidates. Requesting an accommodation is completely voluntary. F5 will assess the need for accommodations in the application process separately from those that may be needed to perform the job. Request by contacting\naccommodations@f5.com\n."}
{"id": "7cd517ddbbae47b2", "title": "Fullstack Developer", "company": "Zurich Insurance", "location": "County Cavan", "description": "苏黎世保险集团（“苏黎世”）是一家全球领先的保险集团公司，成立已有150多年，现已发展成为服务于200多个国家和地区的超过7500万名客户的企业。瑞太信息技术（深圳）有限公司作为苏黎世保险（香港）在深圳设立的全资子公司和研发中心。致力于利用大湾区更广泛的人才资源，应用现代技术，加强协作，以支持苏黎世香港和大中国区的保险业务发展。\n\n\n岗位职责：（React & 小程序方向）\n负责公司 Web 端和小程序端产品的前端开发与维护；\n使用 React 构建高性能、可维护的用户界面；\n基于微信/支付宝/字节跳动等平台开发和优化小程序功能；\n与BA、后端工程师紧密协作；\n持续优化前端性能和用户体验，解决跨平台兼容性问题；\n参与技术选型与架构设计，推动前端技术发展。\n任职要求：\n3年以上前端开发经验，熟练掌握 React ，nextjs框架及其生态（Hooks、Redux、React Router 等）；\n熟悉至少一种主流小程序开发框架（wechat mini app）；\n熟悉 HTML5、CSS3、JavaScript（ES6+）；\n有良好的编码习惯和文档编写能力；\n具备良好的沟通能力和团队协作精神；\n有跨端开发经验（Web + 小程序）者优先；\n有大型项目或组件库开发经验者优先。\n\n\n苏黎世保险集团（“苏黎世”）是一家全球领先的保险集团公司，成立已有150多年，现已发展成为服务于200多个国家和地区的超过7500万名客户的企业。瑞太信息技术（深圳）有限公司作为苏黎世保险（香港）在深圳设立的全资子公司和研发中心。致力于利用大湾区更广泛的人才资源，应用现代技术，加强协作，以支持苏黎世香港和大中国区的保险业务发展。\n\n\n岗位职责：（React & 小程序方向）\n负责公司 Web 端和小程序端产品的前端开发与维护；\n使用 React 构建高性能、可维护的用户界面；\n基于微信/支付宝/字节跳动等平台开发和优化小程序功能；\n与BA、后端工程师紧密协作；\n持续优化前端性能和用户体验，解决跨平台兼容性问题；\n参与技术选型与架构设计，推动前端技术发展。\n任职要求：\n3年以上前端开发经验，熟练掌握 React ，nextjs框架及其生态（Hooks、Redux、React Router 等）；\n熟悉至少一种主流小程序开发框架（wechat mini app）；\n熟悉 HTML5、CSS3、JavaScript（ES6+）；\n有良好的编码习惯和文档编写能力；\n具备良好的沟通能力和团队协作精神；\n有跨端开发经验（Web + 小程序）者优先；\n有大型项目或组件库开发经验者优先。"}
{"id": "4d4df1a10faa4eb9", "title": "Principal AI Software Engineer", "company": "Microsoft", "location": "Dublin, County Dublin", "description": "Overview\n\n\nWould you like to work on a product that transforms Microsoft AI technologies and a modern-work suite to help millions of users work better and faster together? Do you enjoy working with teams that leverage AI to create fast and useful solutions for end-users?\n\nThe future of work is being redefined with AI agents acting as digital co-workers. Microsoft is leading this transformation with M365, Copilot Studio, and Azure AI Foundry. As part of this team, you will help build Agent Cloud— an enterprise-grade solution that secures, governs, and manages AI agents with the same rigor and familiarity as human employees.\n\nAs a Principal AI Software Engineer, you will collaborate with a diverse multi-discipline, multi-site team delivering end-to-end solutions and end user experiences across the M365 ecosystem. These experiences are built upon a highly scalable Azure service architecture, featuring a React-based UI that will delight our customers.\n\nYou can learn more about our Dublin Engineering site here:\nhttps://careers.microsoft.com/v2/global/en/locations/dublin.html\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\n\nResponsibilities\n\n\nThis role demands a blend of artificial intelligence expertise with full-stack development skills to contribute to all phases of our product lifecycle, from conception to deployment. You'll work closely with our product and design teams to deliver on the vision.\n\nDesign implement, evaluate, and deploy AI-powered applications and services\n\nDevelop and fine-tune large language models (LLMs) and other deep learning models\n\nWrite clean, maintainable, and scalable code for model training, evaluation, and inference pipelines\n\nOptimize AI models for performance, latency, and cost efficiency in production environments\n\nApply prompt engineering to enhance model outputs and performance\n\nCollaborate and partner with cross-functional teams to integrate the latest from Entra ID, M365, and other Microsoft technologies\n\nStay current with emerging research, tools, and frameworks in AI/ML to drive innovation.\n\nRapidly prototype and iterate on new ideas to stay ahead in the agent platform race\n\nProvide technical leadership and guidance to a team of software engineers\n\n\nQualifications\n\n\nRequired Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n2+ years working with large scale distributed SaaS architectures.\nProven experience in developing and deploying large language models (LLMs): Demonstrated expertise in working with state-of-the-art LLMs, including their training, fine-tuning, and application in natural language processing tasks.\nPractical experience in prompt engineering and evaluation, with the ability to design, refine, and test prompts to improve model accuracy, reliability, and usability.\n\nOther Requirements: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\n\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\n\nPreferred Qualifications:\n\n8+ years of experience writing software in one or more high level language and frameworks including, but not limited to Python, C++, C#, ASP.NET, Java, J2EE, Spring.\nExperience with Agent based architectures, frameworks and technologies (such as MCP, A2A protocol, Langchain, Azure AI Foundry)\nProficiency in Python for data science workflows, leveraging libraries such as NumPy, Pandas, scikit-learn, Matplotlib, and Jupyter for data analysis, experimentation, and rapid prototyping\nExposure to Deep Neural Network training and inference and experience in one or more deep learning frameworks (PyTorch, TensorFlow, etc.).\nExperienced in web application development frameworks, such as React\nExperience delivering a Cloud SaaS product on Azure, AWS or GCP\nExcellent communication and collaboration skills to work effectively across disciplines and partner teams\n\n\n#BICJobs\n\n#AGENT365\n\n\n\n\n\n\n\nThis position will be open for a minimum of 5 days, with applications accepted on an ongoing basis until the position is filled.\n\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance with religious accommodations and/or a reasonable accommodation due to a disability during the application process."}
{"id": "7aab1dbd44acd105", "title": "Software Engineer Frontend - React", "company": "Uvation", "location": "Remote", "description": "Job Overview:\n\nAs a React Frontend Software Engineer, you will be responsible for developing and implementing user interface components using React.js and workflows (such as Flux or Redux). You will ensure that these components and the overall application are robust and easy to maintain, ensuring a seamless user experience.\n\nResponsibilities:\n\nDevelopment and Design: Develop new user-facing features using React.js. Build reusable components and front-end libraries for future use. Translate designs and wireframes into high-quality code.\n\nPerformance Optimization: Optimize components for maximum performance across a vast array of web-capable devices and browsers.\n\nCollaboration: Collaborate with product team and back-end developers for defining and implementing innovative solutions for the product direction, visuals, and user experience.\n\nTesting and Debugging: Write and maintain test cases to ensure the robustness and reliability of the code. Debug and fix issues reported in the production environment.\n\nMaintenance and Upgrades: Keep up-to-date with the latest React.js trends and industry best practices.\n\nRequirements:\n\nEducation: Bachelor's degree in Computer Science, Software Engineering, or a related field.\n\nExperience: At least 5-6 years of experience in React.js development. Experience with popular React.js workflows (such as Flux or Redux) is a must.\n\nTechnical Skills: Proficiency in JavaScript, including DOM manipulation and the JavaScript object model. Familiarity with newer specifications of ECMAScript. Experience with data structure libraries.\n\nSoft Skills: Strong problem-solving skills, a keen eye for detail, and a team-oriented mindset. Excellent communication skills for coordinating with other teams.\n\nOther: Familiarity with RESTful APIs, modern front-end build pipelines and tools, code versioning tools such as Git.\n\nDisclaimer:\n\nThis job description is not an exhaustive list of the skills, efforts, duties, and responsibilities associated with the position. The company is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations, and ordinances.\n\nNote: The actual duties and responsibilities may vary depending on the department's needs and the evolution of the role."}
{"id": "ed66a88544979118", "title": "Software Engineer Backend(Django)", "company": "Uvation", "location": "Remote", "description": "Job Overview:\n\nAs a Backend Software Engineer, you will be responsible for server-side web application logic. You will work hand in hand with frontend developers to integrate their work with the server-side logic, ensuring the development of robust and efficient systems.\n\nResponsibilities:\n\nDevelopment and Design: Develop high-quality software design and architecture. Design and implement efficient APIs for the front-end team.\n\nCoding and Implementation: Write clean, functional, and scalable code for the back-end of web applications. Implement and manage databases and applications.\n\nIntegration: Integrate front-end elements with server-side logic. Coordinate with front-end developers to align server-side with client-side.\n\nOptimization: Optimize applications for speed, scalability, and security. Address and improve any technical issues.\n\nTesting: Collaborate with QA engineers to develop effective strategies and test plans. Write and execute testing scripts.\n\nMaintenance and Upgrades: Perform regular updates to improve system functionality and develop new features.\n\nRequirements:\n\nEducation: Bachelor's degree in Computer Science, Software Engineering, or a related field.\n\nExperience: At least 2-5 years of experience as a Backend Developer or similar role.\n\nTechnical Skills: Proficiency in server-side languages such as Python with Django and Django Rest Framework. Experience with database technology like MySQL, Oracle, MongoDB, etc. Familiarity with front-end languages such as HTML, JavaScript, and CSS. Basic understanding of Data Structures and Algorithms (DSA)\n\nSoft Skills: Excellent problem-solving skills, a strong attention to detail, and the ability to work in a team-oriented environment. Good communication skills for coordinating with other teams.\n\nOther: Familiarity with Agile development methodologies.\n\nDisclaimer:\n\nThis job description is not an exhaustive list of the skills, efforts, duties, and responsibilities associated with the position. The company is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations, and ordinances.\n\nNote: The actual duties and responsibilities may vary depending on the department's needs and the evolution of the role."}
{"id": "6e6bdd7240461dfd", "title": "Senior Software Engineer - Amplify C.S", "company": "Klaviyo", "location": "Dublin, County Dublin•Hybrid work", "description": "At Klaviyo, we value the unique backgrounds, experiences and perspectives each Klaviyo (we call ourselves Klaviyos) brings to our workplace each and every day. We believe everyone deserves a fair shot at success and appreciate the experiences each person brings beyond the traditional job requirements. If you're a close but not exact match with the description, we hope you'll still consider applying. Want to learn more about life at Klaviyo? Visit careers.klaviyo.com to see how we empower creators to own their own destiny.\n\nTeam Overview:\n\nThe Amplify Engineering team builds internal tools, platforms, and AI-powered automation that help Klaviyos work more efficiently and at scale as the company grows. We partner across the organisation, including Sales, Marketing, Engineering & Product, Customer Service & Success, and Finance, to solve real operational problems with practical, well-designed software.\n\nOur work spans internal applications, 3rd-party integrations, interactive dashboards, CMS integrations, and robust AI systems and agents that automate repetitive tasks, surface the right information at the right time, and help teams make better decisions. We operate in tight feedback loops with our internal customers, shipping quickly, learning fast, and seeing the impact of our work immediately in how deals move faster, tickets resolve sooner, and launches go more smoothly.\n\nThis role is for senior engineers who enjoy turning real-world problems into reliable, scalable solutions. The work is highly visible and has a direct impact on how thousands of Klaviyos get their work done every day.\n\nHow You'll Make an Impact:\n\nThe Amplify team builds the internal platforms, automation, and AI-driven systems that power how Klaviyos work every day. As a Senior Software Engineer on Amplify, you will:\n\nDesign, build, and own complex internal products and platforms, including internal web applications, APIs, data and event pipelines, and AI-powered workflows used daily by Sales, Marketing, Customer Service & Success, R&D, and Finance teams.\nLead the end-to-end lifecycle of projects and features – from discovery and technical design through implementation, rollout, and long-term ownership.\nPartner closely with internal customers to understand their workflows and constraints, and translate real operational challenges into scalable, maintainable solutions that measurably improve productivity, quality, and reliability.\nTake ownership of the technical and architectural evolution of parts of the Amplify platform, anticipating scalability, reliability, and observability needs as usage grows.\nDefine and maintain operational standards for the systems you own, including SLOs, monitoring, incident response, and follow-up on root-cause analysis.\nUse modern AI tools as part of your day-to-day engineering workflow (e.g. LLM-based tooling for design, coding, testing, and documentation), and help shape best practices for how the team applies AI responsibly and effectively.\nContribute to shared patterns, tooling, and processes that make it easier for teams across Klaviyo to build high-quality internal tools and AI-powered systems consistently.\nMentor and support other engineers through design reviews, pairing, and constructive feedback, leaving the codebase and systems better than you found them.\nCollaborate closely with Product, Design, Data, and operational partners to define requirements, trade-offs, and success metrics, ensuring Amplify's work focuses on the highest-value problems.\n\nWho You Are:\n\nYou care deeply about building software for the long term, balancing technical quality, delivery pace, and business impact.\nYou have strong hands-on experience building and operating highly available, full-stack SaaS systems, and are comfortable owning complex problems end to end.\nYou've led the delivery of significant projects or features independently, including discovery, technical design, implementation, rollout, and ongoing maintenance, and you're comfortable providing technical direction to others.\nYou have deep expertise in one or more areas of modern web engineering (e.g. backend services, data pipelines, internal platforms, or AI-enabled systems) and a solid understanding of scalable, multi-tenant architectures.\nYou regularly use AI-powered tools in your development workflow and are curious about applying AI thoughtfully to improve engineering productivity and system capabilities.\nYou take ownership of operational excellence for the systems you build, including performance, reliability, observability, and on-call participation where required.\nYou enjoy questioning convention and continuously improving how things work, whether that's architecture, tooling, workflows, or team practices.\nYou are a clear communicator and collaborative teammate, comfortable leading technical discussions, writing design docs or RFCs, and keeping stakeholders aligned.\nYou enjoy working in small, autonomous, agile teams, shipping incrementally, and partnering closely with product managers and other engineers to deliver better outcomes.\n\nNice to have:\n\nExperience building internal tools, platforms, or automations for developers and/or non-technical stakeholders, with a track record of improving reliability, productivity, or operational efficiency.\nHands-on experience in full-stack environments, including diagnosing and improving application performance, database queries, and complex, multi-service workflows.\nPractical experience building or integrating AI-powered systems and agents; e.g., workflows using LLM APIs/SDKs, agentic or automated workflows, RAG pipelines, or evaluation/monitoring frameworks.\nExperience working with cloud infrastructure (AWS preferred), infrastructure-as-code (Terraform), and containerised environments (Kubernetes), and designing services that run reliably at scale.\n\nTechnologies We Use:\n\nKlaviyo's platform is primarily built with Python and React and runs on AWS. Engineers join us from a wide range of technical backgrounds and are supported in learning our stack. Core technologies include:\n\nPython / Django / FastAPI\nTypescript / React\nMySQL / Redis / Memcached\nRabbitMQ / Celery / Apache Kafka / Apache Pulsar\nAWS / Terraform / Kubernetes\n\nLocation & Work Model:\n\nThis role is based in Dublin, Ireland and follows a hybrid working model. Klaviyo supports work authorization and relocation for this position.\n\nAt Klaviyo, we enjoy tackling meaningful engineering challenges and value people who take ownership, learn continuously, and collaborate openly. We are committed to building inclusive teams and encourage applications from candidates of all backgrounds.\n\nKlaviyo is growing fast and we have openings for all skill levels across all of our teams. Learn more about our engineering culture at https://klaviyo.tech\n\n\nWe use Covey as part of our hiring and / or promotional process. For jobs or candidates in NYC, certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on April 3, 2025.\n\nPlease see the independent bias audit report covering our use of Covey here\n\nGet to Know Klaviyo\n\nWe're Klaviyo (pronounced clay-vee-oh). We empower creators to own their destiny by making first-party data accessible and actionable like never before. We see limitless potential for the technology we're developing to nurture personalized experiences in ecommerce and beyond. To reach our goals, we need our own crew of remarkable creators—ambitious and collaborative teammates who stay focused on our north star: delighting our customers. If you're ready to do the best work of your career, where you'll be welcomed as your whole self from day one and supported with generous benefits, we hope you'll join us.\n\nAI fluency at Klaviyo includes responsible use of AI (including privacy, security, bias awareness, and human-in-the-loop). We provide accommodations as needed.\n\nBy participating in Klaviyo's interview process, you acknowledge that you have read, understood, and will adhere to our Guidelines for using AI in the Klaviyo interview Process. For more information about how we process your personal data, see our Job Applicant Privacy Notice.\n\n\n\n\nKlaviyo is committed to a policy of equal opportunity and non-discrimination. We do not discriminate on the basis of race, ethnicity, citizenship, national origin, color, religion or religious creed, age, sex (including pregnancy), gender identity, sexual orientation, physical or mental disability, veteran or active military status, marital status, criminal record, genetics, retaliation, sexual harassment or any other characteristic protected by applicable law.\n\nIMPORTANT NOTICE: Our company takes the security and privacy of job applicants very seriously. We will never ask for payment, bank details, or personal financial information as part of the application process. All our legitimate job postings can be found on our official career site. Please be cautious of job offers that come from non-company email addresses (@klaviyo.com), instant messaging platforms, or unsolicited calls.\nBy clicking \"Submit Application\" you consent to Klaviyo processing your Personal Data in accordance with our Job Applicant Privacy Notice. If you do not wish for Klaviyo to process your Personal Data, please do not submit an application. You can find our Job Applicant Privacy Notice here and here (FR)."}
{"id": "04f3abeb74f27731", "title": "Lead Software Engineer - Amplify C.S", "company": "Klaviyo", "location": "Dublin, County Dublin•Hybrid work", "description": "At Klaviyo, we value the unique backgrounds, experiences and perspectives each Klaviyo (we call ourselves Klaviyos) brings to our workplace each and every day. We believe everyone deserves a fair shot at success and appreciate the experiences each person brings beyond the traditional job requirements. If you're a close but not exact match with the description, we hope you'll still consider applying. Want to learn more about life at Klaviyo? Visit careers.klaviyo.com to see how we empower creators to own their own destiny.\n\nTeam Overview:\n\nThe Amplify Engineering team builds internal tools, platforms, and AI-powered automation that help Klaviyos work more efficiently and at scale as the company grows. We partner across the organisation, including Sales, Marketing, Engineering & Product, Customer Service & Success, and Finance, to solve real operational problems with practical, well-designed software.\n\nOur work spans internal applications, 3rd-party integrations, interactive dashboards, CMS integrations, and robust AI systems and agents that automate repetitive tasks, surface the right information at the right time, and help teams make better decisions. We operate in tight feedback loops with our internal customers, shipping quickly, learning fast, and seeing the impact of our work immediately in how deals move faster, tickets resolve sooner, and launches go more smoothly.\n\nThis role is for lead engineers who enjoy turning real-world problems into reliable, scalable solutions. The work is highly visible and has a direct impact on how thousands of Klaviyos get their work done every day.\n\nHow You'll Make an Impact:\n\nThe Amplify team builds the internal platforms, automation, and AI-driven systems that power how Klaviyos work every day. As a Lead Software Engineer on Amplify, you will:\n\nProvide technical oversight and direction for a portfolio of Amplify systems, including internal web applications, APIs, data and event pipelines, and AI-powered workflows used daily by Sales, Marketing, Customer Service & Success, R&D, and Finance teams. You will help ensure they are reliable, scalable, secure, and straightforward to evolve.\nFormulate and drive a forward-looking technical vision for key Amplify domains in partnership with your Engineering Manager, Product, Data, and cross-functional stakeholders, aligning that vision with our AI-first strategy and the business outcomes we are accountable for.\nLead the end to end lifecycle of complex, multi component projects and platforms that span multiple internal customers and engineering teams, from discovery and technical design through implementation, rollout, and long term ownership.\nAct as the primary technical interface between your areas of ownership in Amplify and the rest of engineering, helping clarify requirements, reduce technical ambiguity and risk, and ensure the team delivers roadmap and OKR commitments on time with the right quality bar.\nTake responsibility for the technical and architectural evolution of multiple significant domains within Amplify, anticipating scalability, reliability, security, and observability needs as usage grows and new use cases emerge.\nDefine, refine, and uphold operational standards for the systems you and your team own, including SLOs, monitoring and alerting, incident response practices, and post incident learning that continually improves our operational excellence.\nCreate, teach, and improve shared engineering processes, patterns, and internal platforms that make it easier for Amplify and other teams across Klaviyo to build high quality internal tools and AI-powered systems consistently.\nUse modern AI tools as part of your day-to-day engineering workflow and help the team adopt AI effectively, from design and coding through testing, documentation, and evaluation. You will help establish sensible guardrails, evaluation practices, and patterns for AI-first development.\nWork through influence and delegation to get work done, setting clear technical direction, breaking down projects into actionable workstreams, and enabling other engineers to deliver successfully.\nMentor and coach other engineers across levels through design reviews, pairing, and thoughtful feedback. You will help grow future technical leaders, raise the technical bar for the team, and ensure knowledge is shared rather than concentrated.\nCollaborate closely with Product, Design, Data, and operational partners to define problems, shape trade offs, and agree on success metrics, ensuring Amplify's work focuses on the highest value opportunities and that outcomes are clearly measured.\nRepresent Amplify's systems and strategy in broader engineering forums, contributing to architectural discussions, technical RFCs, and cross team initiatives, and helping ensure our internal platforms fit well into the wider Klaviyo ecosystem.\n\nWho You Are:\n\nYou care deeply about building software and platforms for the long term, balancing technical quality, delivery pace, and measurable business impact, and you are comfortable making and explaining trade offs at that intersection.\nYou have strong hands on experience building and operating highly available, full stack or backend focused SaaS systems, and have been responsible for the health and evolution of multiple services or product areas, not just a single application.\nYou have led delivery of business critical projects that span multiple engineers and months, including discovery, technical design, implementation, rollout, and ongoing maintenance. You are comfortable scrutinising requirements, reducing ambiguity, and setting technical direction for others.\nYou have deep expertise in several areas of modern web engineering such as backend services, data pipelines, internal platforms, or AI enabled systems, and a strong understanding of scalable, multi-tenant architectures and the operational realities of running them in production.\nYou regularly use AI powered tools in your development workflow and are interested in shaping how a team or organisation uses AI thoughtfully to improve engineering productivity, system capabilities, and internal customer experiences.\nYou take ownership of operational excellence for the systems you and your team build, including performance, reliability, observability, and on-call participation where required. You are comfortable defining and maintaining SLOs and holding systems to them.\nYou are effective at working through influence and delegation. You know when to keep a task for yourself and when to hand it to others, and you enjoy creating the clarity, patterns, and guardrails that let other engineers move quickly and safely.\nYou enjoy questioning convention and continuously improving how things work, whether that is architecture, tooling, workflows, or team processes, and you are comfortable introducing change in a way that brings people along with you.\nYou are a clear communicator and collaborative teammate, comfortable leading technical discussions, writing design docs or RFCs, and keeping stakeholders aligned from early discovery through delivery and follow up.\nYou enjoy working in small, autonomous, agile teams, shipping incrementally, and partnering closely with product managers, data partners, and other engineers to deliver better outcomes for internal customers.\n\nNice to Have:\n\nExperience building internal tools, platforms, or automations for developers and or non technical stakeholders, with a track record of improving reliability, productivity, or operational efficiency across multiple teams.\nExperience providing technical leadership across several related systems or domains, including defining technical vision, setting design patterns, and aligning multiple teams on shared approaches.\nPractical experience building or integrating AI powered systems and agents such as workflows using LLM APIs or SDKs, agentic or automated workflows, retrieval augmented generation pipelines, or evaluation and monitoring frameworks for AI systems.\nExperience working with cloud infrastructure (AWS preferred), infrastructure as code (Terraform), and containerised environments (Kubernetes), and designing services that run reliably at scale in those environments.\nExperience partnering closely with customer service & support, go to market, or operations teams to understand complex workflows and build internal tools that drive measurable efficiency gains.\n\nTechnologies We Use:\n\nKlaviyo's platform is primarily built with Python and React and runs on AWS. Engineers join us from a wide range of technical backgrounds and are supported in learning our stack. Core technologies include:\n\nPython / Django / FastAPI\nTypescript / React\nMySQL / Redis / Memcached\nRabbitMQ / Celery / Apache Kafka / Apache Pulsar\nAWS / Terraform / Kubernetes\n\nLocation & Work Model\n\nThis role is based in Dublin, Ireland and follows a hybrid working model. Klaviyo supports work authorization and relocation for this position.\n\nAt Klaviyo, we enjoy tackling meaningful engineering challenges and value people who take ownership, learn continuously, and collaborate openly. We are committed to building inclusive teams and encourage applications from candidates of all backgrounds.\n\nKlaviyo is growing fast and we have openings for all skill levels across all of our teams. Learn more about our engineering culture at https://klaviyo.tech\n\n\nWe use Covey as part of our hiring and / or promotional process. For jobs or candidates in NYC, certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on April 3, 2025.\n\nPlease see the independent bias audit report covering our use of Covey here\n\nGet to Know Klaviyo\n\nWe're Klaviyo (pronounced clay-vee-oh). We empower creators to own their destiny by making first-party data accessible and actionable like never before. We see limitless potential for the technology we're developing to nurture personalized experiences in ecommerce and beyond. To reach our goals, we need our own crew of remarkable creators—ambitious and collaborative teammates who stay focused on our north star: delighting our customers. If you're ready to do the best work of your career, where you'll be welcomed as your whole self from day one and supported with generous benefits, we hope you'll join us.\n\nAI fluency at Klaviyo includes responsible use of AI (including privacy, security, bias awareness, and human-in-the-loop). We provide accommodations as needed.\n\nBy participating in Klaviyo's interview process, you acknowledge that you have read, understood, and will adhere to our Guidelines for using AI in the Klaviyo interview Process. For more information about how we process your personal data, see our Job Applicant Privacy Notice.\n\n\n\n\nKlaviyo is committed to a policy of equal opportunity and non-discrimination. We do not discriminate on the basis of race, ethnicity, citizenship, national origin, color, religion or religious creed, age, sex (including pregnancy), gender identity, sexual orientation, physical or mental disability, veteran or active military status, marital status, criminal record, genetics, retaliation, sexual harassment or any other characteristic protected by applicable law.\n\nIMPORTANT NOTICE: Our company takes the security and privacy of job applicants very seriously. We will never ask for payment, bank details, or personal financial information as part of the application process. All our legitimate job postings can be found on our official career site. Please be cautious of job offers that come from non-company email addresses (@klaviyo.com), instant messaging platforms, or unsolicited calls.\nBy clicking \"Submit Application\" you consent to Klaviyo processing your Personal Data in accordance with our Job Applicant Privacy Notice. If you do not wish for Klaviyo to process your Personal Data, please do not submit an application. You can find our Job Applicant Privacy Notice here and here (FR)."}
{"id": "5c574ad122a95741", "title": "Software Engineer II - Amplify C.S", "company": "Klaviyo", "location": "Dublin, County Dublin•Hybrid work", "description": "At Klaviyo, we value the unique backgrounds, experiences and perspectives each Klaviyo (we call ourselves Klaviyos) brings to our workplace each and every day. We believe everyone deserves a fair shot at success and appreciate the experiences each person brings beyond the traditional job requirements. If you're a close but not exact match with the description, we hope you'll still consider applying. Want to learn more about life at Klaviyo? Visit careers.klaviyo.com to see how we empower creators to own their own destiny.\n\nTeam Overview:\n\nThe Amplify Engineering team builds internal tools, platforms, and AI-powered automation that help Klaviyos work more efficiently and at scale as the company grows. We partner across the organisation, including Sales, Marketing, Engineering & Product, Customer Service & Success, and Finance, to solve real operational problems with practical, well-designed software.\n\nOur work spans internal applications, 3rd-party integrations, interactive dashboards, CMS integrations, and robust AI systems and agents that automate repetitive tasks, surface the right information at the right time, and help teams make better decisions. We operate in tight feedback loops with our internal customers, shipping quickly, learning fast, and seeing the impact of our work immediately in how deals move faster, tickets resolve sooner, and launches go more smoothly.\n\nThis role is for software engineers who enjoy turning real-world problems into reliable, scalable solutions. The work is highly visible and has a direct impact on how thousands of Klaviyos get their work done every day.\n\nHow You'll Make an Impact:\n\nThe Amplify team builds the internal platforms, automation, and AI-driven systems that power how Klaviyos work every day. As a Software Engineer II on Amplify, you will:\n\nDesign, build, and maintain internal products and platforms, including internal web applications, APIs, data and event pipelines, and AI-powered workflows used daily by Sales, Marketing, Customer Service & Success, R&D, and Finance teams. You will own features and small-to-medium projects end to end, from design through deployment and iteration.\nDeliver project work with increasing autonomy and scope. You will break down problems into actionable pieces, refine requirements with your team, and collaborate to ship high-quality solutions that meet reliability and performance expectations.\nWork closely with internal customers to understand their workflows and constraints, and translate operational challenges into pragmatic, maintainable software and AI-enabled tools that improve productivity and reliability.\nContribute to the technical and architectural evolution of Amplify's systems by participating in design discussions, proposing improvements, and helping ensure our platforms remain scalable, observable, and reliable as usage grows.\nTake responsibility for the quality and operational health of the code you ship, including testing, deployment, monitoring, debugging issues in development and production, and participating in on-call rotations for the systems your team owns.\nUse modern AI tools as part of your day-to-day engineering workflow, including for coding, testing, documentation, and experimentation, and share learnings to help the team continuously improve how it works with AI.\nHelp improve the developer experience and engineering practices on Amplify by contributing to tooling, CI/CD, automation, tests, and shared utilities that support consistent, high-quality delivery.\nCollaborate closely with Product, Design, Data, and operational partners, contributing to discovery, evaluating trade-offs, and ensuring the work you deliver is tied to clear success criteria and business outcomes.\n\nWho You Are:\n\nYou care about building software for the long term, balancing technical quality, delivery pace, and business impact.\nYou have strong hands-on experience building and operating full-stack or backend-focused software systems, including SaaS products, platforms, or internal tools.\nYou can take a well-defined feature or small-to-medium project from design through implementation, testing, rollout, and ongoing maintenance, seeking input when needed and moving work forward independently.\nYou are comfortable questioning and refining requirements, working with product managers and stakeholders to clarify scope, identify edge cases, and propose pragmatic solutions.\nYou have experience in at least one area of modern web engineering such as backend services, data pipelines, internal tools, integrations, or AI-enabled workflows, and understand how to build secure, scalable, and maintainable systems.\nYou are comfortable using AI-powered tools to support your development workflow and are interested in continuing to grow your AI skills over time.\nYou care about operational excellence and are comfortable debugging issues, improving tests, adding logging and metrics, and working within reliability goals.\nYou are a clear communicator and collaborative teammate, contributing thoughtfully to technical discussions, writing clear tickets or lightweight design docs, and keeping others informed on progress and risks.\nYou enjoy working in small, autonomous, agile teams, shipping iteratively, and partnering closely with product managers and other engineers to deliver meaningful outcomes.\nYou are motivated to continuously improve how things work, whether that is tooling, workflows, architecture, or team practices.\n\nNice to Have:\n\nExperience building internal tools, platforms, or automations for developers and/or non-technical stakeholders, with a track record of improving reliability, productivity, or operational efficiency.\nHands-on experience in full-stack environments, including diagnosing and improving application performance, database queries, and complex, multi-service workflows.\nPractical experience building or integrating AI-powered systems and agents; e.g., workflows using LLM APIs/SDKs, agentic or automated workflows, RAG pipelines, or evaluation/monitoring frameworks.\nFamiliarity with cloud infrastructure (AWS preferred), infrastructure-as-code (Terraform), and containerized environments (Kubernetes), including how to design services that run reliably at scale in those environments.\n\nTechnologies We Use:\n\nKlaviyo's platform is primarily built with Python and React and runs on AWS. Engineers join us from a wide range of technical backgrounds and are supported in learning our stack. Core technologies include:\n\nPython / Django / FastAPI\nTypescript / React\nMySQL / Redis / Memcached\nRabbitMQ / Celery / Apache Kafka / Apache Pulsar\nAWS / Terraform / Kubernetes\n\nLocation & Work Model:\n\nThis role is based in Dublin, Ireland and follows a hybrid working model. Klaviyo supports work authorization and relocation for this position.\n\nAt Klaviyo, we enjoy tackling meaningful engineering challenges and value people who take ownership, learn continuously, and collaborate openly. We are committed to building inclusive teams and encourage applications from candidates of all backgrounds.\n\nKlaviyo is growing fast and we have openings for all skill levels across all of our teams. Learn more about our engineering culture at https://klaviyo.tech\n\n\nWe use Covey as part of our hiring and / or promotional process. For jobs or candidates in NYC, certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on April 3, 2025.\n\nPlease see the independent bias audit report covering our use of Covey here\n\nGet to Know Klaviyo\n\nWe're Klaviyo (pronounced clay-vee-oh). We empower creators to own their destiny by making first-party data accessible and actionable like never before. We see limitless potential for the technology we're developing to nurture personalized experiences in ecommerce and beyond. To reach our goals, we need our own crew of remarkable creators—ambitious and collaborative teammates who stay focused on our north star: delighting our customers. If you're ready to do the best work of your career, where you'll be welcomed as your whole self from day one and supported with generous benefits, we hope you'll join us.\n\nAI fluency at Klaviyo includes responsible use of AI (including privacy, security, bias awareness, and human-in-the-loop). We provide accommodations as needed.\n\nBy participating in Klaviyo's interview process, you acknowledge that you have read, understood, and will adhere to our Guidelines for using AI in the Klaviyo interview Process. For more information about how we process your personal data, see our Job Applicant Privacy Notice.\n\n\n\n\nKlaviyo is committed to a policy of equal opportunity and non-discrimination. We do not discriminate on the basis of race, ethnicity, citizenship, national origin, color, religion or religious creed, age, sex (including pregnancy), gender identity, sexual orientation, physical or mental disability, veteran or active military status, marital status, criminal record, genetics, retaliation, sexual harassment or any other characteristic protected by applicable law.\n\nIMPORTANT NOTICE: Our company takes the security and privacy of job applicants very seriously. We will never ask for payment, bank details, or personal financial information as part of the application process. All our legitimate job postings can be found on our official career site. Please be cautious of job offers that come from non-company email addresses (@klaviyo.com), instant messaging platforms, or unsolicited calls.\nBy clicking \"Submit Application\" you consent to Klaviyo processing your Personal Data in accordance with our Job Applicant Privacy Notice. If you do not wish for Klaviyo to process your Personal Data, please do not submit an application. You can find our Job Applicant Privacy Notice here and here (FR)."}
{"id": "3a583d43742c5f9f", "title": "Senior Software Engineer (Front end)", "company": "Viasat", "location": "Dublin, County Dublin", "description": "About us\n\nOne team. Global challenges. Infinite opportunities. At Viasat, we’re on a mission to deliver connections with the capacity to change the world. For more than 35 years, Viasat has helped shape how consumers, businesses, governments and militaries around the globe communicate. We’re looking for people who think big, act fearlessly, and create an inclusive environment that drives positive impact to join our team.\n\n\nWhat you'll do\n\nYou will be part of a cross functional product team challenged with revolutionising Viasat’s Partner Experience’s and Field Operations across our business segments.\n\n\nThe day-to-day\n\nCrafting engaging user experiences, using AI and our platform to build user journeys that simplify our business processes, improve quality, and support usability for various personas.\n\nYou'll participate in our team meetings and agile ceremonies. This is a hands on software engineering role.\n\n\nWhat you'll need\n\nA degree in Computer Science, Software Engineering or related field or equivalent practical hands on experience\nExtensive professional experience in a related job using an Agile software lifecycle including TDD, pair programming, short release cycles\nExperience working in a collaborative team environment\nSelf Starter\n\nWhat will help you on the job\n\nKey Skills\nExperience developing applications using React Native combined with TypeScript (required)\nExperience with Test Automation with JEST\nExperience building web or mobile applications using modern JavaScript (ES6+)\nExperience with native build processes including deploying apps to App/Play Store.\nExperience integrating with GraphQL and RESTful JSON API’s\nBackground in developing Native mobile apps (important to have some experience)\nExperience delivering mobile applications developed with REACT Native to production\nExperience with CI/CD pipelines using GitHub Actions\nExperience with Datadog or another analytics tools\n\nDesired Capabilities\nEffective communicator with internal and external collaborators\nAbility to seek out, clarify and challenge requirements\nAbility to mentor other engineering team members\nRota paid on call\nProven involvement in Field Services\nOpportunities to work on full-stack (native & backend) development\nArchitect, build and maintain excellent React Native applications\nContributing to our design and software development lifecycles\nExperience creating native modules for React Native apps (important to have)\n\n\nNice to Have\n\nExperience with EXPO\nExperience working with hardware integrations with React Native (Bluetooth and USB preferable)\nNodeJS\n\nEEO Statement\n\nViasat is proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, ancestry, physical or mental disability, medical condition, marital status, genetics, age, or veteran status or any other applicable legally protected status or characteristic. If you would like to request an accommodation on the basis of disability for completing this on-line application, please click here."}
{"id": "362e505d8f9dfaf8", "title": "Software Engineer II-Full Stack", "company": "Toast", "location": "Dublin, County Dublin•Hybrid work", "description": "Toast creates technology to help restaurants and local businesses succeed in a digital world, helping business owners operate, increase sales, engage customers, and keep employees happy.\n\nThe Toast POS (point-of-sale) app is the central pillar of Toast’s restaurant products. Millions of servers, hosts, bartenders, and chefs use Toast’s POS daily to serve their guests!\n\nToast is looking for a mid level Fullstack Engineer to join our Kiosk team. This team is responsible for owning the Kiosk product, a guest facing Android tablet that enables self-ordering and payment at restaurants. The Kiosk team recently rolled out a new Kiosk experience to all Toast restaurants, and now we are looking to further enhance Kiosk by adding new features that will improve the guest experience and increase restaurant operational efficiency. New features require new updates to how a restaurant configures their Kiosk, and this Fullstack Engineer role will involve the ownership and development of Toast’s Kiosk configuration web page, where restaurant owners configure their Kiosk devices.\n\nIf you want to be at the forefront of creating something tangible that is used every day to help restaurants worldwide achieve their vision, then Toast is the place for you.\n\n\n\n\nA day in the life (Responsibilities)\n\nWork collaboratively with UX, PM, QA and other engineers building the Kiosk configuration webpage using modern frontend and backend technologies (React, Tailwind, GraphQL and Storybook).\nDevelop and maintain Kiosk configuration workflows, creating a seamless and intuitive user experience.\nAdhere to best practices such as quality integration and unit testing.\nParticipate in the full software development lifecycle, from design and prototyping to deployment and maintenance.\nProvide technical guidance and support through code reviews and design discussions.\n\n\n\nWhat you'll need to thrive (Requirements)\n\nExperience with Fullstack development using some or all of these technologies: React, GraphQL, Kotlin, PostgreSQL, Protobuf, Microservices, AWS\nProficient with traditional databases and alternative data stores\nExcellent cross-team communication skills on complex technical topics\nProficient in Software Development best practices (Code Quality, UnitTest, BDD)\nExperience delivering high-quality, reliable services to production\nPassionate about building great software\n\n\nWhat we use to make our dish (Our Tech Stack)\n\nA core of Kotlin & Java based backend services.\nReact SPAs leveraging Tailwind, GraphQL and Storybook.\nAndroid app built in Java & Kotlin running in the restaurant.\nDynamoDB and PostgreSQL as core persistence.\nPulsar, Camel and RabbitMQ for message-based integrations.\nAnd many more technologies that help us build a top class platform\n\n*** This is a hybrid role requiring in-office presence two days per week ***\n\nAI at Toast\n\nAt Toast, one of our company values is that we're hungry to build and learn. We believe learning new AI tools empowers us to build for our customers faster, more independently, and with higher quality. We provide these tools across all disciplines, from Engineering and Product to Sales and Support, and are inspired by how our Toasters are already driving real value with them. The people who thrive here are those who embrace changes that let us build more for our customers; it’s a core part of our culture.\n\nOur Total Rewards Philosophy\nWe strive to provide competitive compensation and benefits programs that help to attract, retain, and motivate the best and brightest people in our industry. Our total rewards package goes beyond great earnings potential and provides the means to a healthy lifestyle with the flexibility to meet Toasters’ changing needs. Learn more about our benefits at https://careers.toasttab.com/toast-benefits.\n\nHow Toast Uses AI in its Hiring Process\n\nThroughout the hiring process, our goal is to get to know you. We use AI tools to support our recruiters and interviewers with tasks like note-taking, summarization, and documentation of interviews to ensure they can be fully focused on your conversation. All hiring decisions are made by people.\n\nDiversity, Equity, and Inclusion is Baked into our Recipe for Success\n\nAt Toast, our employees are our secret ingredient—when they thrive, we thrive. The restaurant industry is one of the most diverse, and we embrace that diversity with authenticity, inclusivity, respect, and humility. By embedding these principles into our culture and design, we create equitable opportunities for all and raise the bar in delivering exceptional experiences.\n\nWe Thrive Together\n\nWe embrace a hybrid work model that fosters in-person collaboration while valuing individual needs. Our goal is to build a strong culture of connection as we work together to empower the restaurant community. To learn more about how we work globally and regionally, check out: https://careers.toasttab.com/locations-toast.\n\nApply today!\n\nToast is committed to creating an accessible and inclusive hiring process. As part of this commitment, we strive to provide reasonable accommodations for persons with disabilities to enable them to access the hiring process. If you need an accommodation to access the job application or interview process, please contact candidateaccommodations@toasttab.com.\n\n-\n\nFor roles in the United States, it is unlawful in Massachusetts to require or administer a lie detector test as a condition of employment or continued employment. An employer who violates this law shall be subject to criminal penalties and civil liability."}
{"id": "8174e5af20cbf45c", "title": "E-commerce Web Developer", "company": "Allied Imports LTD (Tipperary Crystal)", "location": "Dublin, County Dublin", "description": "Location: Dublin, Ireland | Salary: €35,000* | Full-Time | Monday – Friday, 8:00 am – 4:00 pm\n\nWe’re expanding our e-commerce team and work with an exciting range of products, including fragrances, soft toys, homeware, jewellery, and more. If you enjoy coding, building features, analysing data, and being hands-on across multiple areas of the business, this role could be perfect for you!\n\nThe E-commerce Web Developer will work on our websites, ensuring they’re technically robust, user-friendly, and optimised for sales. You will also use data analytics to drive performance improvements and support creative marketing initiatives across our brands: Tipperary Crystal, Regency Fragrances, and Gosh! Soft Toys.\n\nYou will collaborate closely with the E-commerce Manager, SEO Specialist, Paid Ads Manager, and Stock Management Team to support campaigns, social media, email marketing, and website management.\n\nKey Responsibilities\n\n1. Website & Web Development (BigCommerce)\n\nMaintain, and enhance our BigCommerce websites using coding skills (HTML, CSS, JavaScript, and relevant frameworks).\nImplement technical fixes, troubleshoot issues, and enhance website functionality.\nCustomise themes, configure plugins, and develop new features to improve UX and drive online sales.\nAssist with product listings: images, descriptions, pricing, and categorisation.\nMonitor website performance, page speed, and mobile responsiveness, implementing improvements as needed.\n\n2. E-commerce & Marketplace Management\n\nManage Amazon Seller Central accounts.\nOptimise product listings with high-quality content, images, and keywords using Amazon SEO techniques.\nHandle customer service, reviews, and daily operations on Amazon.\nUse data analytics to identify trends, track KPIs, and optimise sales performance.\n\n3. Creative Support & Content\n\nAssist with creating banners, visuals, and website content updates. Creative work on Canva and Adobe.\nWrite compelling product descriptions, marketing copy, and email campaigns.\nEnsure all creative content aligns with website updates and product launches.\n\n4. Collaboration & Analytics\n\nWork closely with the E-commerce Manager and other teams to support marketing and e-commerce initiatives.\nUse analytics tools (Google Analytics, BigCommerce reports, or similar) to monitor traffic, conversions, and customer behaviour.\nRecommend data-driven improvements for campaigns, promotions, and website features.\n\nBackground / Experience\n\n1–3 years’ experience in e-commerce, digital marketing, or web development.\nStrong technical skills: HTML, CSS, JavaScript, and experience customising BigCommerce or other e-commerce platforms.\nExperience managing online marketplaces, especially Amazon, is an advantage.\nComfortable with data analytics, KPI reporting, and conversion optimisation.\nExposure to creative work, copywriting, or CRM campaigns.\n\nAddress - Allied House, Unit 804, Northwest Business Park, Phase 3. Ballycoolin. Dublin 15\n\nJob Type: Full-time\n\nPay: €35,000.00 per year\n\nBenefits:\n\nCompany events\nEmployee discount\nOn-site parking\n\nEducation:\n\nBachelor's (required)\n\nExperience:\n\nE-commerce: 1 year (required)\n\nWork Location: In person"}
